{"skills":[{"Languages":": C#, C++\n\nIDE: SQL Server BI Development Studio (BIDS), SQL Server Management Studio "},{"Key Skills":"\n\n? "},{"Front-end Technologies":": HTML5, XML, JSON, CSS3, Bootstrap, Java Script, jQuery\n\nDatabases: MS SQL Server 2005\/2008\/R2\/2012\/2014, MySQL, SQL Query Analyzer, SQL Profiler\n\nVersion Control: Team Foundation Server (TFS), Git\n\nSDLC: Agile, Waterfall\n\nDesign Pattern: Structural, MVC, N-Tier\n\nFrameworks: Microsoft .NET, Entity Framework\n\nTesting Tools: N-Unit, MSTest\n\n"},{"Web Technologies":": RESTful Web API, Web Services, WCF, Web Forms, ASP.NET MVC, ADO.NET, IIS\n\n"}],"work":[{},{},{},{"summary":" Visual Studio 2015\/2013\/2012\/2010\n\n","startDate":"2005\/2008","company":"Microsoft"},{"summary":"\n\nInfinite Dimensions Software Development Company, Addis Ababa, Ethiopia. Private IT Company based in England dedicated in web, app development and hosting services\n\n? Handled client web maintenance and upgrade service request via ticketing system.\n\n? Developed CMS application using .NET 2.0, Master Pages, ASP.NET AJAX, Java script, XML, CSS, and HTML tools\n\n? Used scripting technologies like JavaScript\/JQuery and CMS to develop dynamic websites.\n\n? Managed all aspects of Web design projects for diverse clients;\n\n? Coordinated Web development from initial concept through completion including Web hosting, design, administration, and functionality testing.\n\nLecturer and Database ","position":"Developer","startDate":"Feb 2011","endDate":"June 2013"},{"summary":" Wolaita Sodo University, Wolaita Sodo, Ethiopia A Governmental University offering education and research\n\n? Designed, implemented & maintained RDBMS, Database Schemas, Tables, Queries, Stored Procedures, User Defined Functions, Triggers, Constraints, Indexes, Views and Complex SQL Statements for the development of\n\nthe University Registrar System.\n\n? Fine-tuned database objects and developed complex reports using SSRS 2008.\n\n? Taught Computer Science courses such as .NET Technologies, Algorithm Analysis, Artificial Intelligence, HTML, JavaScript.\n\n? Advised students from small to large scale projects\n\n","position":"Developer","startDate":"Feb 2007","endDate":"Sep 2009"},{"summary":" – Present EDMONIA IT SOLUTIONS, Addis Ababa, Ethiopia, Addis Ababa, Ethiopia IT solutions company specializing in website development and hosting and security, and ICT consulting.\n\n? Created use case diagram, class diagram, activity diagram and sequence diagrams, page flow diagrams using UML technologies.\n\n? Developed core functionality of Learning Management project with ASP.NET MVC Framework (C#.NET)\n\n? Hands on experience with software Development Lifecycle (SDLC) phases (Feasibility, Analysis, Design, Implementation, Test and Maintain) involved in development.\n\n? Worked in a fast paced Agile Development Environment SCRUM, Test Driven Development.\n\n? Implemented test classes and re-factoring using C# Defensive Coding approach\n\n? Authored a number of queries using LINQ and ","position":"Developer","startDate":"Dec 2015"},{"summary":" UNITED NATIONS ECONOMIC COMMISSION FOR AFRICA, Addis Ababa, Ethiopia International Non-Governmental organization is one of the five regional commissions of the United Nations with 53\n\nAfrican nations’ member states focusing on African social and economic developments.\n\n? Developed modules for Record and Archives Management Project undertaken by the commission using C#, ASP.NET MVC, SQL Server 2008 R2, Visual Studio 2012, ADO.NET, XML, JavaScript, AJAX, CSS, HTML\n\ntechnologies.\n\n? Developed ECA publications management Web Services using Windows Communication Foundations.\n\n? Used Session Objects to keep track of session and security attributes built in ASP.NET MVC Framework.\n\n? Developed and Maintained Web Forms with ASP.Net and C#.Net.\n\n? Used bootstrap, CSS3, HTML and JavaScript to Customize the organization official Intranet Website\n\n? Extensively applied agile scrum methodology throughout the project life time.\n\n? Designed, implemented & maintained Relational Database Models, Databases, Schemas and Tables using Object Oriented design principles.\n\n? Improved the performance of database queries and applications by creating well designed Indexes.\n\n2 | P a g e\n\n? Strong experience in data retrieval and manipulation using ADO.NET data objects such as Dataset, Data Reader, Data list, Data Adaptor.\n\n? Created Stored Procedures, Triggers for processing, maintenance of the database, joins for retrieving data.\n\n? Created SSIS\/ETL Packages for an application that would transfer data among servers and perform other data transformations using SQL Server BI Development Studio.\n\n? Used Automated Unit Testing with NUnit and MS Unit.\n\nWebsite ","startDate":"July 2013","company":"Lambda","endDate":"Nov 2015"},{"summary":" http:\/\/www.mycertprofile.com\/Profile\/5936440664\n\n","startDate":"2012\/2014","company":"Microsoft"},{}],"basics":{"summary":null,"phone":["(702)-550-9630"],"website":["https:\/\/www.linkedin.com\/in\/abelmengistu"],"email":["abeltmengistu@gmail.com"],"name":Abel Mengistu ,"label":"Software Developer"},"interests":[],"education":[{"EDUCATION":"\n\nMaster of Science (MSC) in Computer Science Oct 2009 – Jan 2011\n\nAddis Ababa University\n\nRanked 1’s Best University in Ethiopia\/ (Equivalence to Master’s Degree according to World Education Service)\n\nBachelor of Science (BSC) in Computer Science Feb 2003 – July 2006 Hawassa University (formerly Debub University)\n"},{"CERTIFICATIONS":"\n\n? Microsoft Certified Specialist (MCS), Programming in C# with Microsoft Visual Studio Microsoft Certified Professional.\n\n? Microsoft Certified IT Professional (MCITP), Querying "}]}