{"skills":[{"Xml Technologies":"\n\nXAML, XML, XSLT, XSL\n\n"},{"UI Technologies":"\n\nWinforms, WPF, AngularJS, Bootstrap 3.0, Node JS ,HTML5, Telerik\n\nIDE Tools\n\nVisual Studio 2013\/2010\/2008, Sql Server Management Studio 2008, Toad for Oracle\n\n.Net Frameworks\n\n.Net Framework 4.0\/3.5\/3.0\/2.0\/1.*\n\nDatabases\n\nMS SQL SERVER 2008\/2005\/2000, Oracle 11g\/10g\/9i\n\nReporting Tool\n\nSQL Server Reporting Services (SSRS 2008\/2005)\n\nModeling Tools\n\nUML, MS Visio 2010\/2007\n\nVersion Control Tools\n\nVisual SourceSafe(2005), SubVersion, Team Foundation Server(2010)\n\nMiddleware\n\nWCF, ADO.NET 4.0\/3.5\/3.0\/2.0, Web Services, Nhibernate, Enterprise Library 5.0\/4.0\/3.1\n\nServers\n\nWindows Server "},{"Programming Languages":"\n\nC++, C#.Net(4.0\/3.5\/3.0), VB.NET(10.0\/9.0\/8.0), HTML, T-Sql\n\n"},{"Web Technologies":"\n\nASP.Net MVC, ASP.NET 4.0\/3.5\/3.0\/2.0, Silverlight 4.0\/3.0, ASP.Net Ajax Toolkit 3.0\/2.0, Javascript, Jquery, VB Script.\n\n"},{"Expertise":" in Client \/ Server ( Win Forms ) and Web based ( Web Forms, ASP.Net ) application development.\n\nExtensive experience in developing WCF Services to expose useful functionality to web users through SOAP , describing them using WSDL , registering them using UDDI for easy availability to potential users and consuming them.\n\nProficient in developing applications using JavaScript, JQuery, Knockout JS, Angular JS, JSON, Xml, Telerik Kendo UI, AJAX, HTML5, CSS3, Zurb Foundation, Bootstrap and Razor\n\nExtensively used HTML5, BOOTSTRAP, ANGULAR JS and JQUERY and created Single Page Applications (SPA).\n\nLeveraged the introduction of Web API Controllers (Web API 2) in ASP.NET MVC 5 to build, maintain Restful API’s and also consume the API’s client side using Angular JS data binding.\n\nGood knowledge on components like Data Access, Exception Handling, Caching.\n\nExperienced in Service Oriented Architecture (SOA) using Windows communication foundation.\n\n"}],"work":[{"summary":"\n\nHospital Management System (HMS)\n\nDescription: This is a comprehensive and integrated Hospital Management System for a Super Specialty Hospital. This package is used to computerize the activities of a servicing system. This package contains four modules. They are Administration, Patient Care System, Health Services and Auxiliary Services. Each module is having sub modules with in this sub modules will maintains storing, registering, details of joining patient details, and over all day activities maintains one particular database.\n\nResponsibilities:\n\nExtensively used ADO.Net objects to populate Data sets, Data grid and Repeater controls for display and manipulation of records.\n\nCreated Database Tables and have written SQL Queries , Stored Procedures for all the Transactions in and out of the Database using SQL server 2000 .\n\nCreated a Data Layer object in C# language which gives the common classes of methods to execute stored procedures into a Data Set, Data Table and Data Reader .\n\nUsed ASP.NETUser Controls to create wizard steps for submitting and modifying events and evaluation forms. Involved in creating the logic for the several different modules.\n\nDeveloped Custom Controls which provides flexibility, reusability better design time experience.\n\nDeveloped partial post back validations to manipulate data on web pages using AJAX.\n\nPerformed Unit testing using n-unit from the Designer GUI and participated in System Testing.\n\nEnvironment: ADO.NET, C#.Net, ASP.Net 2.0\/1.1\/1.0, Javascript, SQL Server 2000, HTML, CSS, Webservices, VSS.\n","position":"Developer","startDate":"Jan 2009","endDate":"Jan 2011"},{"summary":"\n\nExternal Tracking System\n\nDescription: External Tracking System for State Farm Insurance is a web-based application to be used internally and built to assist the IES (Internal External Staffing) Function personnel in the collection and accurate reporting of information associated with external associates. It includes managing of Vendor information, External Associate information, Contract information, Work order creation and approval process, and Invoice generation.\n\nResponsibilities:\n\nDesigned Corporate Portal for HealthCare Customers in ASP.Net framework.\n\nCreated Date pickers and JavaScript validations for Healthcare Customers.\n\nWork in Agile environment and empowered to take the task and work accordingly.\n\nUsed ASP.Net validation control for the server side validation.\n\nUsed Master Pages, Themes to develop consistent user interface.\n\nDeveloped Business Logic components in middle tier using C#.\n\nImplemented Data Access layer using ADO.Net to communicate with the Oracle server database.\n\nDesigned complex User Interface (UI) screens, modifying existing screens to use AJAX framework.\n\nInvolved in developing the client side scripting files using JavaScript for dynamic actions as well as validations to be performed at the client-side apart from standard .Net validation controls.\n\nData binding was extensively used to bind various server controls to the data from database. List controls like repeater controls, data list controls and data grid controls was used in displaying rows of data in a customized template format.\n\nUsed ASP.Net server controls like Grid View , Form View as a part of user interface and for data display.\n\nUsed ASP.Net Master Pages that were common throughout the application and content pages.\n\nDesign and developed several reports using SSRS which flow through different workflows including email notifications.\n\nWrote T-SQL Statements, Stored Procedures, Triggers, Functions, and Sequences to access data from database along with ADO.NET Class & Methods.\n\nUnit tested all the modules. Wrote unit test cases for a number of modules using\n\nDocument technical specifications and used code generation tool to create class code for several entities.\n\nEnvironment: Visual Studio 2008\/2010, C#, VB.Net, XML Web Services, IIS 7.0,Framework 3.5,XML, NUNIT, Windows XP, MS Office, Windows Server 2003, WCF, WPF, Oracle 11g, PL\/SQL, TOAD, Crystal Reports.\n\nInfotech Solutions, Hyderabad, India ","position":"Consultant","startDate":"Mar 2011","endDate":"Oct 2011"},{"summary":" is to work on a multi-year conversion from a legacy Data Entry system to a SOA-based .NET application. This involved understanding the technical functionalities in power builder and recreate the same or better functionality using Microsoft .NET and related technologies. This needed active participation in daily standup meetings, sprint meetings as a part of the Agile Scrum product developmental methodology.\n\nResponsibilities:\n\nInvolved in technical development and support activities of project solutions.\n\nParticipated in daily scrums and weekly meetings with the project sponsors to meet expectations and deadlines. \n\nUsed AJAX Library, CSS, JavaScript, XML and various web controls to present data to users in a  convenient method. \n\nDeveloped web services for the exchange of data between the interface systems.\n\nDeveloped a scheduler using WCF that triggers an update of details to the interfaced systems at regular intervals.\n\nDesigned and developed Rich presentation tiers using Silverlight for Web and WPF for windows with XAML , and Expression Blend with C#, .NET 4.0 and VisualStudio.NET2010 and leveraged Silverlight features such as Styles, Animations, Story Boards, Path objects, Resource files, Control Templates, Data Template with Prism 2.1 and LINQ\n\nInvolved in Database design, created stored procedures, triggers, cursors, views, functions and indexes.\n\nInvolved in developing applications in C# to meet the business requirements using Visual   Studio.NET 2010 . \n\nWorked extensively on web forms and data binding controls like Grid View, Data List and drop down boxes and Mapping page fields to the database fields. \n\nImplemented form authentication class in the ASP.NET  application and also implemented AJAX controls within ASP.NET  webpages. \n\nImplemented a . Net Web services to SQL Server 2008 database. \n\nDeveloped WCF services to enable effective communication. \n\nDeveloped and consumed WCF Services to achieve Service Oriented Architecture (SOA) and communication between heterogeneous applications. \n\nGained working knowledge of developing web applications by using MVC architecture.  Integrated Google Maps API into VB.Net  application. \n\nGained good expertise in HTML5 , knockout and JQuery.  \n\nUsed Crystal Report to generate various reports as per the client's requirement. \n\nInvolved in testing using NUnit tool and also had knowledge of Silverlight Unit Test Framework.\n\nEnvironment: Visual Studio 2010, C#, VB.Net, XML Web Services, IIS 7.0,XML, JQuery, NUNIT, Windows XP, MS Office, Windows Server 2003, Entity Framework 4.0, WCF, WPF, Oracle 11g, PL\/SQL, TOAD, Crystal Reports.\n\nState farm Insurance, Bloomington, IL ","position":"Senior Software Developer","startDate":"Nov 2011","company":"Paychex","endDate":"May 2012"},{"summary":" - Rochester, NY ","position":"Manager","startDate":"2008","company":"Paychex Inc."},{"summary":" Enterprise Library, Serena Dimensions, BMC SDE, Experian Internal Tools, Team city, Control-M Enterprise ","startDate":"2003\/2008","company":"Microsoft"},{"summary":"\n\nStagecoach\n\nDescription: This project is aimed to build a partner version of Freecreditscore.com® for Wells Fargo and offer their customers best-in-class Identity and Credit management product by meeting the needs of their affiliates, their bankers and their millions of customers. In addition to the existing products offered to the customers by Wells Fargo, other enhancements have been developed like the Lost Wallet Service, Increased identity theft, Real-time Identity alerts, SMS text alerts, Credit utilization and limit alerts, Transactional reports.\n\nResponsibilities:\n\nWorked as a engineer on the Wells Fargo version of Free Credit Score® website by creating, implementing and supporting business-critical modules for Customer facing pages, Payments, Report-ordering, ITP\/EITP® Membership conversion modules and general site\/user maintenance using ASP.NET 4.0, C#, WCF , Generics, XML, MVC 3.0 , SQL Server 2008 .\n\nMigrated the existing tool ‘Request for Response’ with enhanced features for Business Analysts and Product team (Billing) which use Litle ® session of a batch to generate reports from ASP.Net 1.1 to ASP.Net MVC 3.0 .\n\nDeveloped controller action methods and views using Razor view engine.\n\nCreated proof of concept for implementing views in Angular JS.\n\nCreated various Angular Services to make AJAX calls and custom angular directives to create own HTML tags and induce some kind of behavior to those tags.\n\nImplemented data access and business logic to meet client requirement.\n\nDeveloped Routing, URl , Security, Action Filter techniques for application development.\n\nImplementation of client side validations using JQuery and ASP.NET MVC Validation implemented at Controller level\n\nHandled ASP.NET features such as Exception Handling, and Custom Error Messages.\n\nHandled Run Time Errors & Design Time Errors by implementing appropriate Error handlers in C#.Net.\n\nDeveloped windows jobs to generate Identity Alerts and configured them using Control-M enterprise manager.\n\nInvolved in retrieving data using LINQ to SQL and LINQ to Objects with ASP.NET .\n\nPerformed peer to peer code reviews.\n\nWorked on implementing new Stored Procedures as well as modifying the existing ones based on the Wells Fargo requirements.\n\nImplemented and consumed WCF services to communicate with the remote host for transactional services.\n\nResponsible for Analysis, Design, Developing applications, testing and Maintenance.\n\nResponsible for maintaining versions, Reverse and forward integration of code branches to Main branch of source code using Team Foundation Server 2010 .\n\nResponsible for deployment of the Application in production and resolving any post-deployment issues.\n\nInvolved in coordinating the Disaster Recovery process from Engineering and Web perspective.\n\nCollaborate with other IT teams, communicating and negotiating needs to achieve project goals.\n\nWorked on triaging and trouble-shooting numerous production issues using Splunk on 100+ websites of Experian internal and its affinity partners.\n\nEnvironment: ASP.NET 1.*\/3.0\/4.0, ASP.NET MVC 3.0, C#, LINQ, T-SQL HTML, SQL Server 2008, XML\/XSLT, IIS, Splunk, Visual Studio ","position":"Consultant","startDate":"Jun 2012","endDate":"Jul 2014"},{"summary":" \/ Analyst\n\nPayroll & Insight Reporting\n\nDescription: Payroll and Insight Reporting is part of the claims team in Equifax. This application mainly deals with unemployment and payroll process of the clients. Whenever an employee is laid off from the company he can claim unemployment benefit from his employer. Payroll application receives payroll data from the client and provides payroll information to other applications. Insight Report handles all kinds of reports related with unemployment process of each client.\n\nResponsibilities:\n\nPerform project tasks in Agile Scrum environment with development team spanning across Atlanta, Charlotte and India.\n\nAssessed risks and made decisions in cases of ambiguity, keeping team on-task and progressing while balancing potential retrogressions.\n\nParticipated in gathering application knowledge and moving system from a different vendor, which is being managed by them for past 10 years and worked closely with customer’s development team to identify APIs , define data schemas, and document workflows, business requirements, and domain knowledge.\n\nDesigning and developing the ASP.NET applications with Model-View-Controller (MVC) framework and ensuring to satisfy the TDD approach.\n\nScripted functionalities on the customized Client implementation using JQuery .\n\nCustom node.js proxy used to simulate API responses before client implementation was complete, and to proxy requests to finished client APIs , handling authentication, custom headers, etc.\n\nData Access, routing and caching were implemented using custom JavaScript modules\n\nWorked on Roles and Permission and managed users by restricting application access.\n\nEnhance the existing functionality and re-platform the key components of application to ASP.Net MVC 4.0 from the mixture of classic ASP and .Net web forms technologies to increase productivity and decrease the release time using Razor , C#, NHibernate , Structure Map.\n\nCreated and modified SQL DDL scripts, stored procedures, functions and pre- and post- deployment scripts.\n\nProviding application architecture and design best practices to achieve code quality using Resharper .\n\nEnsure compliance of established SDLC procedures and appropriate usage of SDLC tools like Vera Code and Web Inspect .\n\nPartner with Operations, Enterprise Architecture, and QC members on Release Management, project prioritization, triaging and scheduling activities throughout the SDLC \/ project life-cycle.\n\nModularized the existing CSS on the UI components to improve the performance by loading what is necessary.\n\nLeveraged angular resources for all data access, encapsulating URLs and standardizing data access interfaces.\n\nSuccessfully migrated manufacturer templates to the latest version which was key to business growth and financial compliance.\n\nTalk with business owners and analysts to story point future requirements and work with database analysts concerning technical issues and document existing business practices.\n\nFixed various bugs and defect, which are managed on “HP Quality Center Application” with collaboration of QA\/Test team.\n\nBi-weekly code reviews, deployments and maintenance.\n\nEnvironment: Visual Studio 2013, .Net Framework4.0, Elmah, C#, ASP.NET 4.0, ASP.Net MVC 4, SQL Server 2008, SQL Source Control, XML, HTML5, JavaScript, CSS, JQuery, LINQ to SQL, Tortoise SVN, Responsive Design, node.js, API, T-SQL, NHibernate, Vera code, Cruise Control, Team city, Windows Server ","position":"Developer","startDate":"Aug 2014","company":"Equifax"},{"summary":" Enterprise Library, ReSharper, Version One.\n\nExperian® Consumer Direct, Costa Mesa, CA ","startDate":"2008","company":"Microsoft"},{"summary":" IIS(7.0\/6.0\/5.0\/4.0)\n\nOther Utilities\n\nILdasm, gacutil, Sn.exe, FxCop, Resharper\n\n\nEducational Qualification\n\n\nBachelors in Information Technology, GITAM UNIVERSITY. ","startDate":"2008\/2003","company":"Microsoft"},{},{},{},{}],"basics":{"summary":null,"email":["singhalokit89@gmail.com"],"name":Silver Light },"interests":[],"education":[]}