{"skills":[{"AFS Technologies":", New York NY\n\nMaintaining existing code, fixing bugs, and developing new features for Android and Windows Mobile applications using C#, Xamarin, SQLite, Windows CE Forms, SQL Compact, and Windows Mobile SDK.\n\nProviding multi-language support and certification of different mobile printers.\n\nCreating interface for Bluetooth Low Energy Data Exchange (DEX) devices.\n\nAdapted Windows Mobile Data Exchange (DEX) code to Android replacing Serial port connection with classic Bluetooth connection.\n\nUpdated Data Access Layer code for Android applications.\n\nProgrammer Analyst ["},{"Skills":"\n\nC#, VB.NET, VB6, Windows Forms, WPF, ASP.NET, WCF, Entity Framework\n\nSQL Server, Oracle\n\nHTML, JavaScript, CSS\n\n"}],"work":[{"summary":"]\n\nJewish Guild Healthcare, New York NY\n\nDeveloped desktop and web applications integrated into Patient Assessment and Tracking System using C#, VB.NET, Windows Forms, WPF, ASP.NET, WCF, Entity Framework, and SQL Server.\n\nDeveloped an application for providing fast and easy access to database objects located on different servers and for executing predefined parameterized SQL queries.\n\nDeveloped an application for generating a data access layer code.\n\nDeveloped customized user controls.\n\nDeveloped and maintained a database of NYC pharmacies and physicians.\n\n","position":"Consultant","startDate":"12\/2011","endDate":"11\/2013"},{"summary":"]\n\nCreative Genius Group, New York NY\n\nDeveloped different desktop and web applications supporting business processes of the company using C#, Windows Forms, WPF, WCF, Entity Framework, SQL Server, Excel VBA, eBay SDK, Shopify API, Magento API, QBFC, PHP, and MySQL, including\n\nApplication for listing and managing the company’s inventory (10,000 items) on multiple online ecommerce stores on eBay and Shopify,\n\nETL solution for moving data from legacy data sources (Clarion, TPS, Pervasive SQL) to SQL Server databases,\n\nApplications for generating different inventory reports into Excel format, printing product display labels and inventory labels with bar codes,\n\nQuickBooks extensions,\n\nImport\/export system for a Magento website database,\n\nTime punching system.\n\n","position":"Software Developer","startDate":"06\/2010","endDate":"12\/2011"},{"summary":"]\n\nAxxos Industry Systems, Jonkoping, Sweden\n\nDeveloped different desktop and web applications for manufacturing industries and for internal use inside the company using VB.NET, VB6, ASP.NET, Classic ASP, Web Services, and SQL Server, including\n\nAxxos System for Calibration – a complete system for easy handling and registration of measuring instruments (used in Volvo Cars, Volvo Trucks, Husqvarna, GE Healthcare, etc.),\n\nCRM application for tracking and organizing contacts with customers.\n\nMigrated legacy applications to .NET platform.\n\n","position":"Software Developer","startDate":"08\/2002","endDate":"03\/2010"},{"summary":"]\n\nArtefakt, Moscow, Russia\n\nCreated and run a social networking website for musicians, poets, writers, and artists using PHP and MySQL. (5,000 members, 80,000 publications).\n\nLead Programmer Analyst \/ Head of Department [","position":"Web Developer","startDate":"01\/1999","endDate":"08\/2002"},{"summary":" – Present]\n\n","position":"Developer","startDate":"11\/2014"},{"summary":" Health System, New York NY\n\nDeveloped different web components for a web-based experimental research portal using C#, ASP.NET, Classic ASP, and SQL Server, including\n\nResource scheduling component,\n\nRandomization module for randomized control trials,\n\nTime reconciliation reports.\n\n","startDate":"11\/2013","company":"Mount Sinai","endDate":"10\/2014"},{"summary":"]\n\nGreen Expectations, Caldwell NJ\n\nMaintained existing code, fixed bugs, and developed new features for a real estate market website using VB.NET, ASP.NET, and SQL Server.\n\nTechnical ","position":"Web Developer","startDate":"07\/2013","endDate":"07\/2014"},{},{"summary":", Kaliningrad, Russia\n\nDeveloped different client-server applications supporting business processes of the company using Delphi, C#, Windows Forms, ASP.NET, Web Services, and Oracle, including\n\nDebt management system,\n\nBudget control system,\n\nCashier applications and control components for fiscal printers,\n\nClient database and telephone number directory reports,\n\nApplications and scripts for post-processing of call data records,\n\nSystem for DSL service registration.\n\nManaged departments of information technology and billing system maintenance. Planned and coordinated a migration of the billing databases to new billing systems and a processing of the billing cycle (100,000 clients).\n\nLead Programmer Analyst \/ Head of Department [04\/1989 – 11\/1996]\n\nState Statistics Committee, Kaliningrad, Russia\n\nDeveloped different multi-user information systems supporting business processes of the company using Delphi, Turbo Pascal, Paradox, dBase and PL\/1, including\n\nPayroll accounting system,\n\nEnterprise registration system,\n\nSpare parts registration system,\n\nSurvey management system,\n\nData input verification system.\n\nManaged departments of computers and new technology. Planned, coordinated, and installed new computer systems and network systems in the company.\n\nProgrammer Analyst [04\/1986 – 04\/1989]\n\nExperimental Design Bureau “FAKEL” (Federal Space Agency), Kaliningrad, Russia\n\nDeveloped real-time process control systems for different testing equipment units on the base of DEC LSI-11 (PDP-11) using Macro Assembler 11.\n\nGot 3rd place in an industrial contest for the development of a real-time process control system for a vibration testing unit.\n\n","startDate":"11\/1996","company":"Telecom","endDate":"03\/2010"}],"basics":{"summary":"\n\nOver 20 years of experience providing software solutions to different companies.\n\nDetail oriented hard working professional.\n\nStrong analytical and problem solving skills.\n\nHistory of building software products that “have positive feedback from customers”.\n\n","email":["logunov@hotmail.com"],"name":Server },"interests":[],"education":[]}