{"skills":[{"Technical Proficiencies":", Certifications, and Security Clearances\n\nSoftware: MS SQL Server 2000\/2005\/2008\/2008 R2\/2012, MS Reporting Services 2000\/2005\/2008\/2012, SQL Analysis Services, SQL Data Transformation Services, SQL Integration Services, MS Visual Source Safe 6, MS Team Foundation Server "},{"Programming Languages":": ASP .Net (2.0, 3.5, 4.5), C# .Net 4.0, Visual Basic 6, VB .NET, VBA, ADO, ADO .Net, T-SQL, PL-SQL, XML, MDX, Objective-C, Object Oriented programming, HTML5\n\n"},{"Skills":" and Core Values\n\n• Well-rounded in all areas of IT\n\n• Excellent software development skills\n\n• Excellent analytical and problem solving skills\n\n• Excellent communication and presentation skills\n\n• Strong financial and economic background\n\n• Team Player\n\n• Mission-focused\n\n• Passion for innovation\n\n• Values customer service\n\nPersonal\n\nAutomobile Enthusiast\n\nTechnology Enthusiast\n\nWorld Traveler\n\nAvid Road and Mountain Bike Rider\n\nAvid Snowboarder\n\nRestaurant Connoisseur\n\nMusic Lover\n\nEnjoys Socializing\n\nEnjoys Outdoors\n\nEnjoys Fashion\n\nPart-time Professional Photographer"}],"work":[{"summary":" web-based interface to Team Foundation Server, maintaining and administering SQL Server 2008, as well as developing SQL reports. I also maintain the virtualized Team Foundation Server deployment which is hosted on virtual machines. All development duties were performed using Windows 7 as a virtual machine, hosted within Mac OS X, using Parallels virtualization software. My position also requires that I document and train existing developers on Team Foundation Server 2010 deployment and Visual Studio integration. Upon completion of source code migration from Remedy to TFS, I also proposed, developed, implemented, and administered a SQL and TFS database back-up and disaster recovery plan. In addition, I am required to provide project management training to government\/client project managers in the form of technical presentations as well as one-on-one training. I am also required to report to my supervisors and participate in regular technical meetings and administrative meetings. I also regularly participate in “scrum” development meetings and maintain sprint logs. My position also requires an active Secret Clearance.\n\n","position":"Controller","startDate":"2010"},{"summary":", VA\n\nAs a Team Foundation Server Architect\/Admin for CACI, my primary responsibility has been to architect, deploy, and administer a Team Foundation Server 2010 Source Control deployment with integration to an existing government client infrastructure. This responsibility includes installing and configuring Team Foundation Server 2010, installing and configuring SQL Server 2008 R2, installing and configuring SharePoint Server 2010, and installing and configuring SQL\n\nReporting Services 2008 R2. I am also required to consolidate and migrate existing .Net web based applications to the newly deployed Team Foundation Server Source Control system and integrate Team Foundation Server with Visual Studio 2010. Migration of application code bases requires a thorough understanding of application architecture, application file structures and hierarchy. Migration from Remedy was perform using SQL Server Integration Services, SSIS (formerly DTS) to author transformation scripts and packages to move data from Remedy into TFS’s SQL Server 2008 R2 database. In addition to developing Team Foundation Server Infrastructure, I am also required to administrate and support all source control related issues, including maintaining application code bases, maintaining TFS security model, maintaining an existing Active Directory and Domain ","position":"Administrator","startDate":"Sep 2011","company":"Arlington","endDate":"July 2013"},{"summary":" Health Organization; Washington DC\n\nAs a Software Systems Developer for the Pan American Health Organization, I perform a wide range of duties related to developing, maintaining, testing, and integrating the Ampes Omis and Ampes Omis Web software applications. Ampes Omis (legacy VB 6 app) and Ampes Omis Web (modern VB .Net and ASP .Net app) are enterprise level financial planning and monitoring applications used worldwide in 40 countries that make up the Pan American Health Organization. My daily responsibilities include business analysis, functional requirements analysis, relational data modeling, database maintenance, software application architecting, user interface design, software development, and report authoring. In addition to my technical responsibilities, I also attend regular meeting with team members, department heads, and organizational executives to share ideas and provide my expertise. I also am responsible for prioritizing daily tasks and\n\nday-to-day interaction with end- users, both in person and through e-mail communication. My daily responsibilities require a thorough understanding of Visual Basic .Net, Visual Basic 6, ASP .Net, .Net Framework 2.0 and 3.5, MS Reporting Services, MS Visual Source Safe, MS Team Foundation Server 2010, MS Sharepoint 2007, MS-SQL Server 2000, 2005, and 2008 and the SQL programming language. I am familiar with and regularly employ related techniques including object modeling and object oriented coding, application architecting, recursive function design, .Net\/COM Integration, Share Point Integration, configuration management, complex stored procedure, view and query authoring, SQL tuning and optimization, software quality assurance testing, business process engineering (re-engineering), financial application support, and trouble-shooting. I am required to provide business intelligence through various types of solutions; including interactive dashboard’s and advanced reports. Highly Advanced Custom Reports authored in SSRS included Financial Reports, Budget Reports, Planning Reports, Procurement Reports, Accounting Reports, Fixed Asset Reports, Depreciation Reports, HR Reports, Expense Reports, Travel Reports, Inventory Reports, System Discrepancy Reports, System Integration Reports, Performance Monitoring Reports, and Multi-dimensional Analytical Reports. In addition I was responsible for facilitating a migration from Test Track Pro to Team Foundation Server 2010. Advanced knowledge of SQL Integration services were required to facilitate the upgrade. Educational requirements include strong skills in accounting, finance, statistics, economics, mathematics, and engineering. I am also required to have a basic understanding of the Spanish language.\n\n","position":"Developer","startDate":"Oct 2007","company":"Pan American","endDate":"Mar 2011"},{"summary":", Mortgage Electronic Registration Systems; Reston, VA\n\nAs a senior .Net developer for Mortgage Electronic Registration Systems (MERS), I was responsible for developing a Microsoft-based IT development infrastructure within the company. This responsibility included installing and configuring Team Foundation Server 2010, installing and configuring Share Point Server 2010, installing and configuring SQL Server 2008 R2, and installing and configuring SQL 2008 R2 Reporting Services Server. I was responsible for converting web source code projects (ASP .Net, VB .Net, and C#) to the latest .Net framework within Visual Studio 2010. This task included adding all source code to the Team Foundation Server source control system. Team Foundation Server was integrated into the MERS Domain (with Active Directory Security), Share Point 2010 (for browser-based access to source control), SQL 2008 R2, SQL 2008 Reporting Services, and Visual Studio 2010. Development and test environments were also established, creating a development process that assured software quality. Databases were migrated to SQL 2008 R2 and web applications were configured and tested for compatibility. My responsibilities also included developing, converting, maintaining, and troubleshooting existing web applications including MERS Website, MERS Central, and CRMS. Web application development required that I have thorough knowledge of HTML, ASP .Net, and VB .Net. Further responsibilities also included updating and maintaining existing databases including altering and re-engineering of stored procedures, functions, triggers, and other database objects.\n\n","position":"Developer","startDate":"Mar 2011","endDate":"Aug 2011"},{"summary":" (FAS); Washington D.C.\n\nAs a TFS Administrator for USDA Foreign Agriculture Services (FAS), my primary responsibility is to administrate, support, and troubleshoot USDA’s TFS deployment. This includes administering project based security, branching and merging of source code projects, build definition and deployment automation, full administration of TFS servers; including TFS Server, SSRS Server, Build Server, and SharePoint Server, as well as ensuring the health of the TFS tiers and connectivity (both application and data tiers). In addition, I administrate all of the TFS SharePoint Project sites, as well as all of the Windows Servers that make up the TFS deployment. I regularly administrate, diagnose, maintain, troubleshoot, upgrade and patch TFS, IIS, SharePoint, and Windows Servers that make up the TFS deployment.\n\nAs a Senior .Net Developer for USDA (FAS), my primary responsibility is to develop, support, upgrade, and maintain iMart: a web based HR and Financial Application used worldwide by USDA FAS (Foreign Agriculture Services), integrating with US Department of State systems. System development and development tasks required a thorough knowledge of the C# Development Language, ASP .Net, MVC System Architecture, Team Foundation Server 2012, Office 2010, Office 2013, SQL Server 2008 R2, SQL Management Studio, SQL Server Reporting Services, and Visual Studio 2010, 2012, and 2013. Application Lifecycle Management was facilitated on a monthly iteration based schedule under the Agile development methodology. Development tasks included analyzing system requirements documents, system and change request documents, and software bugs; developing software based solutions around my analysis of the specified work item. Knowledge of Visual Studio project integration with Office, was fundamental in performing my development duties. Solutions were authored in both a VBA\/.Net interoperability configuration, as well as Visual Studio Tools for Office (VSTO) configuration. Application database calls were made through a referenced web service based object.\n\n","position":"Developer","startDate":"July 2013","company":"USDA"},{"summary":" on the SAFARI (Supplemental Application for Analysis and Reporting Information) project, I worked as part of a development team within the Expert Witness Unit of the United States Department of Justice. My primary responsibility was to design, develop, implement and support an expert witness case\/financial management system. To perform my duties, my position required a complete working knowledge of Microsoft’s Visual Basic 6 IDE and programming language. In addition, my position required that I have extensive knowledge of ","position":"Developer","startDate":"Apr 2005","company":"Arlington","endDate":"Dec 2005"},{"summary":" database platform, with the ability to perform relational and OLAP database design, relational and OLAP reporting, as well as stored procedure authoring, function authoring, and view creation. Periodically, I was also required to consult with the customer and analyze their business processes and system needs. Given the system’s integration requirement, I was also required to have extensive knowledge of Microsoft’s Office Suite. I was also responsible for complete testing and QA of the system as it entered the testing phase of its development lifecycle; including the development of test plans. My position also required me to have an NACI Secret security clearance.\n\nFeb 2004 - Apr 2005. Technical Analyst, Cizer Software Corporation; Ashburn, VA\n\nAs a Technical Analyst for Cizer Software, my responsibilities included consulting with customers, analyzing business processes, gathering system requirements, as well as designing, developing, and implementing customized database and reporting solutions. Cizer Software Corporation was a Microsoft Gold Certified Partner. Therefore, my responsibilities required me to have a working knowledge of MS SQL, MDX, DTS, VBA, .NET Expressions, IIS, Active Directory, MS Reporting Services, MS Analysis Services, Database Design, and the MS SQL Server platform. I played a key role in the success of the Cizer.Net Reporting Suite, commercial reporting product, where I was responsible for quality assurance and documentation of the final product before public release. Given my knowledge of our software product and my interpersonal skills, I was trusted to demonstrate the Cizer.Net Reporting Suite to prospective national and international clients.\n\nWorking for a small software company, I had the opportunity to perform a variety of tasks including software development, software technical documentation, end-user documentation, help-desk support, training, testing, work station and server configuration management, trouble-shooting, and network administration. I was also responsible for the design and administration of Cizer’s PBX phone system. In addition, I was responsible for the design and development of a Balanced Scorecard Analysis system built with SharePoint 2003 for a client. My range of duties also included the typical expectations of helping to move to a new location, including the physical move of equipment and the corresponding setup including network wiring and configuration.\n\n","startDate":"2000","company":"Microsoft"},{"summary":" on the Claims 3 project, I performed a wide range of duties related to upgrading the CLAIMS 3 Financial Immigration Application from Visual Basic 6 to Visual Basic .Net. CLAIMS 3 is a client\/server financial tracking and analysis system used by the Department of Homeland Security to process financial claims made by immigrants during their process of immigration. My range of duties on the CLAIMS 3 project include analyzing business processes, improving upon business processes, and implementing the processes into new applications. In addition to implementing software enhancements, I was required to unit-test and peer review system changes based on the Capability Maturity Model Integration (CMMI) standards. I was also responsible for upgrading the installation and deployment process from a standard installer to a Wise Package Studio .MSI Installer. In addition to performing software changes, I was also required to perform routine database maintenance. My position required complete working knowledge of the Visual Basic 6, .Net, and 2005 Development Environments and languages, knowledge of working with XML Data, as well as a thorough understanding of ODBC database connectivity and the Pervasive SQL 8 and 9 Database. My position required a Homeland Security Secret Clearance.\n\n","position":"Software Developer","startDate":"Sep 2006","company":"Computer Sciences Corporation","endDate":"Oct 2007"},{"summary":" for the Structure and Manpower Allocation System (SAMAS) project, I worked as part of a development team that designs, develops, supports, and upgrades the SAMAS application. SAMAS is a client\/server budget, financial and workforce management system, written in Visual Basic 6, that is used at the Pentagon by the United States Army. My primary position responsibilities included implementing software change-requests from the customer, upgrading and maintaining system source code, maintaining a version control system, maintaining the application database, and authoring reports using Crystal Reports 8.5. Change-requests ranged from database changes (structural changes as well as stored procedure and function changes) to changing or upgrading existing software features, class modules, procedures, and functions within the source code. To perform my version control duties, I was required to have extensive knowledge of computer file structures as well as Visual Source Safe. Maintaining the application database included authoring and modifying stored procedures as well as routine cleansing of temporary procedures and tables. My database duties were performed using the PLSQL Developer interface with an Oracle 8i database. In addition, my position requires knowledge of object-oriented programming techniques, ActiveX control\n\ndesign, and code optimization. My position also required that I have a DOD Secret Clearance.\n\n","position":"Developer","startDate":"Dec 2005","company":"Arlington","endDate":"Sep 2006"},{"summary":"\/.Net\/2005\/2008\/2010\/2012, MS SharePoint 2003\/2007\/2010, MS Balanced Scorecard Accelerator, WordPerfect Suite, Libre Office, MS Office 2000\/XP\/2003\/2007\/2010\/2011 Mac, MS Access, MS FrontPage, MS Visio, MS Publisher, MS Producer, MS Exchange, Cizer.Net Reporting Suite, MySQL, Infragistics UltraSuite, Datadynamics Active Reports, Crystal Reports 8 and 9, IIS 5 and 6, Sheridan Datawidgets, Tidestone Formula One, Wise Package Studio Pro, Pervasive Database Engine, Remedy Ticket Tracker, PVCS Tracker, PVCS Version Manager, Adobe Flash, Adobe Dreamweaver, Adobe Acrobat, Lotus Notes 5, 6, TestTrack Pro, Toad, PL SQL Developer, Oracle 8i, Oracle 9i, Tableau 5.2, Tableau 6, Adobe Photoshop CS5, Adobe Photoshop CS6, Paralells Virtual Machine, Vmware Workstation, VMWare Fusion, Apple Logic, Propellerhead Reason, iLife, Aperture, Rapidweaver, MS Expression Studio, Google Apps Suite, Citrix XenServer, OpenVPN, Cisco VPN, .Net Framework (2.0, 3.5, 4.5), Windows Azure, DropBox, SkyDrive, Google Drive, Google Suite of Apps (Gmail, Calaneder,etc.)\n\nOperating Systems and Platforms: Windows 3.x, Windows 9x\/ME, Windows Server ","startDate":"2010","company":"Studio 6","endDate":"2012"},{"summary":" and .NET Framework 4.0\n\n","startDate":"2010","company":"Microsoft"},{"summary":", Windows 7, Windows 8, Windows 10, Windows NT, Mac OS X, Linux (Red Hat, Mandriva, Suse, Ubuntu, Linux Mint), iOS 9,\n\nAndroid OS, Bean, Blackberry OS, Windows Phone 8, Cloud Computing\n\nNetworks and Hardware: Windows Networking, Unix\/Linux Networking, Mac Networking, Cisco and 802.11x hardware, Wimax, 4G-LTE, 802.11x Wi-Fi, Motherboards, Graphics Cards\n\n","startDate":"2000\/2003","company":"Vista","endDate":"2008\/2012"}],"basics":{"summary":"\n\nI am an experienced Information Technology (IT) professional seeking an opportunity with a progressive, dynamic organization. I have diverse IT and analytical skills as well as experience with financial systems and welcome the challenge of applying my knowledge and learning new technologies to help an organization grow. I have experience in several different industries\/organizations including Federal Government contracting, Defense contracting, International non-profit healthcare contracting, as well as the commercial software industry. I have a solid understanding of the technical project lifecycle and application lifecycle management including functional requirements analysis, software design and development, application architecting and engineering, as well as product testing, training, and support. I have experience developing international enterprise-level financial management systems (both in an ASP .Net web configuration as well as Windows client\/server based configuration). I also have experience developing commercial software packages in desktop, client server, and browser-based configurations. I have extensive experience in providing business intelligence solutions through Reporting and Analytics. I also have familiarity with mobile and tablet device technology and have a solid understanding of mobile enterprise services. I have a passion for engineering professional business solutions; I’m creative, hardworking, personable, enjoy a team approach, and take pride in my work. My ideal position would be to develop global web-enabled IT systems for an organization that has a sound mission and provides opportunity for professional growth. I have strong drive to engineer professional business solutions and I pride myself in my integrity, creativity, interpersonal relations, and work ethic. My passion is to contribute to an Organization.\n\n","phone":["20008\n\n703-867"],"email":["tony.disabatino@gmail.com"],"name":Anthony DiSabatino },"interests":[],"education":[{"Education":"\n\nCollege: University of Maryland; College Park, MD\n\nDegree: Bachelor of Arts, Major: Economics, Minor: Decision & Information Technology, Minor: Astronomy\n\nGraduation Date: December 2003\n\nRelevant Coursework: Business Computer Application Programming, Business Information Systems and Technology, Systems Analysis and Design, Business Telecommunications, Information Systems Logic and Design, International Business Management, Economic Statistics, Economic Development of Underdeveloped Areas, International Economics, Econometrics I & II, Theory of Public Finance and Fiscal Federalism, Business Ethics and Theory of Labor Economics,\n\nQuantitative Methods in Economics, Principals of Accounting I & II, Calculus I & II\n\n"},{"Professional Courses":": March 2012 - 10266A Programming in C# with "},{"Certifications":": Vertical TeleVantage Certified, Tableu Certified\n\nSecurity Clearance: Active DOD Secret Clearance (2005 – Present, Last used Dec 2011), DOJ NACI Clearance (2005), Homeland Security Secret Clearance (2006-2007)\n\n"}]}