{"skills":[{"COMPUTER SKILLS":" \n\n• Primary Software\/Skill: MS Visual Studio 2008, 2010, 2012, MS SQL Server, MS Expression Blend, MS Expression Web, Dreamweaver, MS Excel, MS Access, IIS 7.0, Excel .NET, Apache, SQL Plus, OEM, PhpMyAdmin, Visio, Photoshop, MS Dynamics, SharePoint, Telerik Control.\n\n• Primary Language\/Skill: C# .NET, X\/HTML, HTML5, CSS, JavaScript, DHTML, JQuery, YUI, XML, XSLT, JSON, XAML, C# ASP .NET, ASP .NET MVC (C# .NET\/VB .NET), Visual Basic .NET, Silverlight development, Active Reports 6(ASP .NET C#\/ASP .NET VB), LINQ, YQL, PHP 4\/5, MYSQL, MS SQL 2005\/2008, Oracle SQL.\n\n• Secondary Software\/Skill: Fireworks, Photoshop, MS Excel, MS Access, SSIS, Bethnic Golden, Macromedia Flash 8 (some familiarity), Lawson ( basic ), PeopleSoft (basic), Excel Power Pivot, SSIS, SSRS.\n\n• Secondary Language\/Skill: C++, Java, FORTRAN, COBOL, C Shell scripting, Excel macro, and basic UNIX commands.\n\n• I know, I have experience, and I am familiar with: SDLC, OOP, REST, Relational Database, DOM, SOAP, Web Service, SEO, Lawson (basic for software development), PeopleSoft (basic for software development), basic banking or finance knowledge (Account Payable, Remit, Payment, Account Clearing House, Reconciliation) for software development, ERP, CMS ( Joomla, WordPress, Umbraco).\n\n \n\n"},{"OTHER SKILLS":" \n\n• Communication: I can support people as well as can communicate with people effectively and efficiently by email or phone.\n\n• Writing Skill: I have good experience in writing technical documents or manuals. I am also proficient in gathering requirements from clients, writing specification, writing test plans, or writing delivery documents.\n\n• I can work with other software developers as well as can work alone.\n\n• I can learn new subject, language, or concept independently.\n\n• I am very detail oriented.\n"}],"work":[{"summary":"\/Programmer Analyst\n\n• For corporate website, I created dynamic pages and section; for example, main employment section. I created the user interface as well as wrote code for backend section.\n\n• I have created new content as well as updated contents of internal\/external company sponsored sites, while I maintained them. Dynamic languages that got used, by me, are: C# ASP .NET, ColdFusion, PHP, SQL. For all these websites, I have worked on user interface development as well as on backend development.\n\n• I have updated, maintained, troubleshoot and resolved problem on existing legacy software.\n\n• With C# .NET, I wrote code for user interface and backend for various applications, where the software interacts with other software, database, and generates output per specification. For example, I wrote code so that Account Payable, Reconciliation reports \/ calculation, Expense calculation, Credit calculation, Account Clearing House Transaction information can be generated as text, csv, excel, custom pdf or as custom means, which can be sent to bank or network locations as well as can be emailed as custom emails to different groups. These applications interact with banks, ERP (Lawson), database; these applications get used by Finance department, so that many business activities can be automated. I also wrote code for Microsoft Active Directory and Role-Based Access Control to authenticate users.\n\n• I wrote at Corporate Wiki on how to use software, or on how to troubleshoot a specific issue.\n\n• I set up server and set up environment; for example, setting up Apache, setting up IIS based websites, installing and setting up database, allowing certain IP to access FTP server, setting up security, setting up DSN, setting up sitemap for SEO, etc.\n\nEnvironment and scope: Windows, IIS 7.0, Apache, Oracle, PhpMyAdmin, MS SQL Server 2008, SQL Plus, T-SQL, PL\/SQL, Access, Excel, Lawson, Apache, PHP, ColdFusion, C# .NET, ASP .NET 2.0\/3.5\/4.0, ADO .NET, JavaScript, CSS, XHTML, HTML 5, ","position":"Web Developer","startDate":"January, 2012","endDate":"April, 2014"},{"summary":", Notepad++, OEM, AxWay, Scheduler, batch scripting, Visio, CSV, SVN, JSON, XML, SQL Server 2012, writing UX\/UI code, etc.\n\nACOE ","startDate":"2010\/ 2012","company":"CMS"},{"summary":" • I created user interface and backend of ASP .NET MVC 3 Application. I used VB .NET, Razor, SQL, and HTML code. • I created table at SQL Server 2008 R2 and created LINQ to SQL classes, so that application can do data transaction.\n\n• I wrote codes so that information can be sent to database, information can be sent to personnel, and information can be displayed in web page.\n\n• I wrote codes to make user interface or partial view files; I wrote codes in Global.asax to fix routing problems, and wrote codes to generate dynamic HTML entities or dynamic UX\/UI elements.\n\n• I wrote code so that custom email can be generated with dynamic content.\n\n• I wrote codes to modify MVCSiteMap’s template to generate different menus as client specified.\n\n• I fixed web accessibility issues, HTML, CSS validation issues by writing vbhtml and HTML codes.  \n\n• I wrote technical documentation. Environment and scope: Visual Studio 2010, SQL Server 2008 R2, VB .Net 3.5, ADO .NET, Entity Framework, T-SQL, PL\/SQL, ASP .NET MVC 3, Razor Code, SQL, LINQ, HTML, CSS 2.1, SVN, writing UX\/UI code.\n\nProgressive Consulting Technology Client: Office of Personnel Management January, 2011 - May, 2011\n\nLocation: Macon, Georgia Programmer Analyst • I resolved technical issues which emerged in Application Manager Software by using Oracle 11g and Benthic • To resolve bugs, worked on USA Staffing solution software on existing features by using Visual Studio 2010, ASP VB .NET, Active Reports 6, and Infragistic control. • Tested USA Staffing solution software\n\nEnvironment and scope : Visual Studio 2010, VB .Net 2.0, ADO .NET, HTML, SQL, CSS 2.1, Active Reports 6, Infragistic Control\n\n \n\nVidiEmi\n\n","position":"Web Developer","startDate":"August, 2011","endDate":"November, 2011"},{"summary":" (Consultant)\n\n• I wrote ASP .NET C# code, JavaScript, HTML, CSS as specified by supervisor.\n\n• I configured and extended 3rd party software, like MarkItUp, as specified by supervisor.\n\n• I researched and suggested solution to team as problem emerged, which were implemented.\n\n• I worked on SQL Server 2005 Database tables to configure the tables in an SQL script so that data can be transferred to JDO.\n\n• I wrote SQL query.\n\nEnvironment and scope : Visual Studio 2008, C# .Net 2.0, SQL, T-SQL, XHTML, CSS 2.1, JavaScript, Jquery, writing UX\/UI code.\n\nWest Valley Technology\n\nClient: Tiburon, Inc\n\n","position":"Web Developer","startDate":"September, 2010","endDate":"October, 2010"},{"summary":"\n\n• I worked on security software by utilizing C# .NET, Oracle, SQL Server, SQL, and Copperfire scripts.\n\n• I made Reports by extracting information from database by using Crystal Reports 9 and MS Access.\n\n• In order to handle bugs, investigated C# codes and wrote C# functions by using MS Visual Studio 2005.\n\n• Tested forms by using databases, Oracle 9i or SQL Server 2005, or by using C# Application.\n\n• Regularly communicated with clients as needed and solved clients' problems.\n\nEnvironment and scope : C# .NET 2.0, Visual Studio 2005, MS SQL, T-SQL, PL\/SQL, Oracle 9i, SQL Server 2005, Copperfire script, Crystal Reports, Access.\n\nCALTRANS, D4\n\nJanuary, 2006 - July, 2007\n\nLocation: Oakland, California\n\nWeb Master\n\n• I created user interface and maintained internal intranet site by using XHTML, CSS, JavaScript, and Perl\n\nby using Dreamweaver. I used Photoshop to optimize or resize images.\n\n• I updated and maintained database by using MS Access and Excel.\n\n• I performed data analysis, wrote reports, and manuals by using Excel and MS Word.\n\nEnvironment and scope : HTML, CSS, JavaScript, Photoshop, Perl, Dreamweaver, Access, Excel, writing UX\/UI code.\n\n","position":"Software Engineer","startDate":"July, 2007","endDate":"August, 2008"},{},{"summary":" Certified Professional ID# 6766094\n\n","startDate":"May 2009","company":"Microsoft"},{},{},{"summary":"\n\n• Working on WPF project.\n\n• Working on PDF rendering project.\n\n• Working on ASP .NET MVC project.\n\nEnvironment and scope: C# .NET 4.0, ASP.NET MVC, SQL Server, PDFSharp, MigraDoc, Silverlight, WPF, Entity Framework, TFS, Oracle, etc.\n\nArtech\n\nClient: Lumobee\n\nLocation: Redmond, Washington\n\n","position":"Developer","startDate":"September, 2016"},{"summary":"\n\n• Worked on AVE project, where I wrote code for customized data import\/export software. I also updated corporate’s existing software.\n\n• I deployed software at Azure.\n\n• For AVE project, I wrote unit test and integration test that validates different functionality; for example, user verification, school API functionality, emails verification, etc.\n\nEnvironment and scope: C# .NET 4.5, ASP.NET MVC, Azure SDK, Cloud, TDD, NO SQL, Service Development, Entity Framework, Unit Testing, TFS, SQL Server ","position":"Developer","startDate":"February, 2016","endDate":"April, 2016"},{"summary":"\n\nLocation: Portland, Oregon\n\n","startDate":"2012","company":"Bank"},{"summary":"\n\n• I used C# .NET, ASP .NET, MVC 4.0 .NET, Jquery, JavaScript, CSS, Kendo to create web pages for USBank Workstation\/Software application. Through the webpages, users can update, delete, add, read, or configure workstations and software. There were two web projects: one is .NET Web form based, where C# ASP .NET, JavaScript, and Jquery got used. Another application is based on MVC 4 with MVVM architecture pattern. At MVC project, I used Kendo UI, Jquery along with C# .NET to create modern web pages which make user experience better as well as automate business activities. Both of these applications uses AJAX, uses web methods along with server side events as deemed suitable.\n\n• I wrote stored procedures, which gets invoked from USBank Workstation\/Software SSRS project or from USBank Workstation\/Software web application. The SSRS reports enable user to analyze and manage data about workstation, software, and licenses.\n\nI wrote codes for User Interaction (UX\/UI) in chstml, html5, and aspx page. I used razor, html, aspx, Kendo UI, Jquery to write UX\/UI code.\n\nI worked in an agile team, where agile methodologies got followed.\n\nEnvironment and scope: Windows, C# .NET, ASP .NET, .NET 4.5, ADO .NET, JavaScript, CSS, XHTML, HTML 5, Visual Studio 2013, Entity Framework, Kendo, MVC 4.0, Web API, Jquery, SQL Server, SSRS, JSON, XML, SQL Server 2012, writing UX\/UI code, etc.\n\nFirst Tek\n\nClient: Bonneville Power Administration | DOE\n\nLocation: Portland, Oregon ","position":"Developer","startDate":"May, 2015","endDate":"August, 2015"},{"summary":"\n\n• I used C# .NET to create custom controls for web application.\n\n• I used Telerik control to make custom UX\/UIs, where I worked on both front and back end.\n\n• I made multi-threaded custom file import control, which is integrated with Dynamics and SharePoint.\n\n• I worked on various entities of data layer to ingrate front end with MS Dynamics as well as SharePoint.\n\n• I wrote code that interacted with WCF services for data exchange.\n\n• I wrote codes for User Interaction (UX\/UI) in aspx page, and I used JavaScript, aspx, and Teleric control to write UX\/UI code.\n\n• I worked in a team environment with senior software engineers, where agile and scrum methodology got followed.\n\nEnvironment and scope: Windows, C# .NET, ASP .NET, .NET 4.0, ADO .NET, Entity Framework, JavaScript, CSS, XHTML, HTML 5, Visual Studio 2012, MS Dynamics 2010, MS SharePoint, Telerik Control, WCF, SQL Server 2012, writing UX\/UI code, etc.\n\nPublic Health Institute ","position":"Software Developer","startDate":"July, 2014","endDate":"January, 2015"}],"basics":{"summary":null,"phone":["510-415-6889"],"email":["sritterson@yahoo.com"],"name":Developer ,"label":"Developer"},"interests":[],"education":[{"Training":" and Exams\n\n??Got trained under UNITEK, IT on .NET application and web development using .NET 2.0.\n\n??Passed all Microsoft exams, which are 70-536 and 70-528\n\n"},{"EDUCATION":"\n\n??SAN FRANCISCO STATE UNIVERSITY, San Francisco, CA, May 2007\n\nI have a BSC in Computer Science with a minor in Mathematics.\n\n??Diablo Valley College, Pleasanton, CA, Pleasant Hill, CA, 2001\n\nI have an A.A. Degree\n\n \n\n"},{"CERTIFICATION":"\n\nMicrosoft Certified Technology Specialist, .NET 2.0 Web Application, "}]}