{"skills":[{"Programming Languages":"\n\nC, .Net (C#, VB), XAML, Java Script, T-SQL, HTML, XML\n\nDatabases\n\nSQL Server 2005\/2008\/2012\n\nTools\n\nVisual Studio "},{"Technical Skills":":\n\n"},{"Web Technologies":"\n\nASP.NET, AJAX, WCF, Silverlight, JQuery, HTML\n\nOperating Systems\n\nWindows XP\/Vista, Windows 7 and Windows 8\n\nMethodologies\n\nOOP Concepts, N-Tier Application and Agile Scrum Methodology\n\n"},{"Expertise":" in Relational Database Management Systems and Experience in PL\/SQL programming. "}],"work":[{"summary":", TFS and VSS\n\n","position":"Developer","startDate":"2005"},{},{"summary":".\n\nDesigning Business Intelligence Solutions with Microsoft SQL Server\n\n","startDate":"2012","company":"Microsoft"},{"summary":"\n\nROLE: .NET DEVELOPER\n\nDescription:\n\nThere were multiple systems in the eCommerce area such as a tool called PMT (Product Management Tool), OCS (Order Client Service), several background Jobs and WCF services among others. PMT was a WPF application designed for internal use in which users could create, read, update, insert and delete products in the Database; Order Client Service was a Visual Studio solution with multiple background processes to help with the web-orders management.\n\nResponsibilities:\n\nDefining and Setting up Application Review (Functional Flow) of the PMT.\n\nApplication design and development of support documents.\n\nInvolved in developing, enhancing the browser based Intranet applications using ASP.NET, C#.NET and VB.NET.\n\nDeveloped the presentation layer which consisted of ASP.NET Web Forms, User Controls and their associated code-behind files.\n\nCoded the application logic layer which contained all the business rules and business entities represented by C# Classes. It also contained data access logic and data access classes using ADO.Net, which would communicate with the underlying database layer.\n\nUsed ADO.Net to provide connectivity to SQL Server back end database.\n\nDesigned the business logic and implemented it by creating interfaces, abstract classes, static classes and sealed classes.\n\nExtensively involved in using MVC and MVVM patterns.\n\nWriting Stored Procedures using T-SQL in SQL Server.\n\nDebugged programs, analyzed and made newer versions of the current components and\/or systems.\n\nMaintenance of WCF services and Web Services Provided.\n\nMaintenance of a WPF application provided.\n\nParticipated in periodic technical reviews of various modules and developed schema to improve them.\n\nSolved TFS Bugs and Tasks related to the current systems.\n\nUsed Team Foundation Server (TFS) for project repository and versioning control.\n\nEnvironment : Visual Studio 2010, ASP.Net, Entity Framework, C#.NET, VB.NET, ADO.Net, XML, MVC, MVVM, WCF, WPF, SQL Server 2008, T-SQL, HTML 4, TFS, AJAX.\n\nDean Health Plan, Madison WI July 2008 – Dec 2009\n\nROLE: .NET DEVELOPER\n\nDescription:\n\nIn today's busy world, well-being often takes a back seat to other daily priorities. Dean Health Plan is committed to helping you focus on your well-being now - before a health condition occurs or worsens. That's why Dean Health Plan offers the Well-Being Assessment (WBA). Dean Health Plan is committed to the overall health and well-being of our members, and we are dedicated to supporting healthy lifestyles. Now, take advantage of Living Healthy and get rewarded for making those everyday good choices.\n\nResponsibilities:\n\nInvolved in all the phases of Development Life Cycle.\n\nInteracting with business analysts, business users, testers, other developers and management to deliver a Web based solution.\n\nInvolved in Test Driven Development and in testing of the application as a member of the Quality Assurance team.\n\nTransformed business\/functional requirements to technical specification documents.\n\nCreated ASP.NET User Controls to reduce the complexity of User Interface (UI) design.\n\nUtilized JavaScript for Client-side validations that greatly decreased processing time and resource consumption, freeing resources for use by other applications and speeding up processing times.\n\nWorked on SSRS technology to generate different types of reports.\n\nInvolved in the creation and consumption of several XML Web Services.\n\nDeveloped several Business Classes using C#.\n\nUsed nHibernate and WCF to communicate between Data Access Layer and other business components.\n\nWorked as IIS web Server administration to manage web sites, redirect request and restart IIS.\n\nProgrammed ADO.Net for communication between application and database, used extensively Data Grid, Data Set, Data Table, Data Views, Data Adapter and Data Readers.\n\nInvolved in performance tuning and designing database tables, Stored Procedures, Functions and Triggers in SQL and T-SQL.\n\nUsed Team Foundation Server (TFS) as a Source code control.\n\nEnvironment : ASP.Net, C#, ADO.Net, HTML, JavaScript, SQL Server 2008, AJAX, Visual Studio.Net 2008, .Net Framework 3.0\/3.5, Windows 2005, TFS, nHibernate, WCF, SSRS, IIS.\n\nELOGBOOK FOR PETROCHEMICALS, INDIA Jan 2007 - Jun 2008\n\nROLE: PROGRAMMER\n\nDescription:\n\nThis is a web application for petrochemical industry, where it manages plant, departments, assets and activities of the employees. It also manages the shift allocated to each employee of a particular plant and generates customized reports depending on the details of employees. It also contained an Excel add-in application to generate Excel spreadsheets for given criteria.\n\nResponsibilities:\n\nThe existing application was in .NET 2.0 and SQL server 2005 as backend. Migrated the entire database to Oracle and My SQL with all the stored procedures and functions.\n\nMigrated the web application from .NET 2.0 from .NET 3.5 and made the application compatible with Oracle and My SQL.\n\nDatabase work involved, writing PL\/SQL statements, Triggers, Functions and Stored Procedures, which were in turn called by the Data Access modules using ADO.NET.\n\nWorked with SQL Server 2008, Oracle and MySQL for database migration.\n\nDeveloped web pages using C# to support the new functionalities and enhance the existing ones.\n\nClient communication, Requirement gathering, Analysis, Design, Coding and Development, Integration testing, Defects Solving.\n\nUsed Team Foundation Server (TFS) for the security and the version control.\n\nEnvironment:  ASP.NET, C#.Net, .NET Framework 2.0\/3.5, SQL Server 2005\/2008, Oracle 10g, My SQL, ADO.NET, Java Script, HTML, CSS, TFS.\n\n","startDate":"Jan 2010","company":"Meijer","endDate":"Dec 2010"},{"summary":", ASP.NET 3.5, C# .NET, VB.NET, ADO.NET, SQL Server2005\/2008, XML, AJAX, Share Point portal 2003, SOAP\/REST, SSRS, Agile Scrum Methodology, Crystal Reports, Team Foundation Server (TFS).\n\n","startDate":"2008","company":"Microsoft"},{},{"summary":"\n\nROLE: SR .NET DEVELOPER\n\nDescription :\n\nCyberAccess application was Healthcare application and mainly developed for State of MO, TX and KY to find patient’s information based on Patient ID, Date of Birth, First Name and Last Name. Based on their patient’s id our application is mainly find the information about patient’s drug history, prescription and doctor’s information.\n\nResponsibilities:\n\nResponsible for developing user interface by using asp.net with VS 2010.\n\nDeveloped business objects by using WCF with code behind was c#.neT.\n\nDeveloped Web forms, HTML Controls, web controls and Cascading Style Sheets (CSS) using ASP.NET 3.5, C#.NET, VB.NET as Code behind languages and developed Business objects in C# and WCF.\n\nResponsible for developing WCF Web Services with Service Model.\n\nResponsible for developing different contractors like data contractors, operation contractors, service contractors, message contractors by using WCF Service model.\n\nWrote stored procedures and Queries by using SQL Server 2005\/2008 with SSMS (Sql Server Management studio).\n\nDeveloped Reports using SQL Server 2008 Reporting Services (SSRS) and integrated with Web pages.\n\nResponsible for doing enhancements for existing production applications.\n\nMaintained different change sets and versions of the web applications by using TFS.\n\nUsed Agile Scrum Methodologies in developing web application.\n\nResponsible for writing user friendly validations by using VS2008 and Java script.\n\nGave Production support once web applications and win forms are deployed into production.\n\nResponsible for Participated ongoing maintenance, production roll outs & testing.\n\nEnvironment:  ","startDate":"Jan 2011","company":"Xerox","endDate":"Dec 2011"},{},{},{}],"basics":{"summary":null,"name":Framework },"interests":[],"education":[{"Certifications":":\n\nProgramming in HTML5 with JavaScript and CSS3.\n\nMCTS: Web Applications Development with MS.NET Framework 4.\n\nMCTS: Windows Communication Foundation Development with MS.NET Framework 4.\n\nImplementing Data Models and Reports with "}]}