{"skills":[{"Technologies":" Utilized:\n\nVisual FoxPro\nSQL Server 2000\nDescription:\n\nDesigned Windows GUI for Trade Capture processing.\n\nCreated & Monitored Scheduled batch jobs\/stored procedures for nightly jobs in Opalis Scheduler included interest sharing, risk metrics, hard to borrow stocks for stock loan department, short options processing, etc.\n\nHands on development included building an N-Tiered Distributed Application utilizing a BusinessObject Design Pattern.\n\nResponsible for overseeing solution deployment to some 50 workstations throught Merrill Lynch at World Financial Center (Trading Floor) and 222 Broadway (Domestic & Global Prime Brokerage.)\n\nAssisted in Migration from Windows NT 4.0 Server to Advanced Windows 2000 Server with Cluster Administration (included Virtual Nodes and C&R fallover).\n\n04\/22\/03 – 05\/04\/03 Greater New York Health Association NY, NY\n\nSenior Developer\/Analyst: Onsite\n\nConverted a legacy VFP application using Visual FoxPro 7.0 from single user to multi-user and from a VFP database to a SQL Server 2000 database using remote views. T-SQL Stored Procedures in SQL Server .\n\n"},{"Technologies":" Utilized:\nVisual FoxPro\nSQL Server 2000\nDescription:\nDesigned and developed extensible object oriented distributed application framework in VFP to develop enterprise solutions targeted for the Windows written in Visual FoxPro 6.0.\nApplications Developed:\nHealthPlus MemberPro SQL (Windows)\n\n"}],"work":[{"summary":"\n\n176\n\nDesigning and Implementing Desktop Applications with ","startDate":"0\n\nFeb 14","company":"Microsoft","endDate":"2001"},{"summary":"\n\n156\n\nDesigning and Implementing Desktop Applications with Microsoft® Visual FoxPro® 6.0\n\n\n","startDate":"0\n\nMay 20","company":"Microsoft","endDate":"2000"},{"summary":" – Enterprise Risk Management\n\nSenior SQL and web developer working in BOA’s USA Enterprise Risk Management group on their Diamond Development Platform. Diamond is the Enterprise Model Risk Management reporting system used to govern the control of models used for pricing, risk, credit, underwriting and various other business critical calculations across the bank.\n\nThe Diamond web app is a modern Python stack (Python 2.7, Flask\/WTForms\/JQuery\/Knockout.js) front end with a SQL Server 12 back end. All development was Agile\/Sprint based using the JIRA system.\n\nResponsibilities included implementing a SQL Server performance improvement initiative, bug fixes, support, and enhancements to the aforementioned Diamond system.\n\n","position":"Developer","startDate":"05\/09\/16","company":"Bank","endDate":"11\/7\/16"},{"summary":" Of America NYC, NY\n\nSolutions Architect – Wholesale Credit Group\n\nSenior architect on Notifications initiative to provide generic headless API driven solution to enable various domains under the Bank’s wholesale credit umbrella to enable their users to subscribe to email and text notifications.\n\n10\/18\/09 – 04\/20\/2015 MultiTask123 LLC Brooklyn, NY\n\nCo-Founder, CTO, Developer & Architect\n\nMultiTask123 LLC is a startup I co-founded that has completed the following websites and applications:\n\nTaskSmarter.com – (Released June 2015) Cloud based Responsive Task Management web application using the following technologies: C# WCF, Kendo UI Framework, SQL Server, Amazon S3, CSS3, jQuery, HTML5 & CloudFlare CDN\n\nBucketBacker.com (Released ","startDate":"08\/24\/15","company":"Bank","endDate":"12\/1\/15"},{},{"position":"Developer","startDate":"05\/01\/04","company":"Mellon","endDate":"07\/16\/05"},{},{"summary":" S3 Backup Software utilizing C#\/WPF\/XML\/.NET\/Multi-threaded\/Transaction Processing Library and Amazon S3.\n\nRadiodile.com (Released. 2014) – Android streaming radio app using Eclipse, Java, Amazon S3, CloudFlare CDN, YouTube & SoundCloud public APIs. Middle Tier in C# WCF with MySQL and SQL Server backends.\n\nFMGEM.com (Released. 2012) – jQuery, HTML, C#\/WPF\/SQL Server, Amazon S3, CloudFlare CDN, YouTube, SoundCloud, Vimeo, AOL Video and Discogs public APIs.\n\nMultiTask123.com (Prototype Awarded US Patent #8548992 – Telerik ASP.NET C# Framework, Amazon S3, Amazon CloudFront, jQuery & MS SQL Server. Task Management and Cloud Based File Storage web application.\n\n","startDate":"Feb. 2015","company":"Amazon"},{"summary":"\n\nCo-Architect & Senior C#\/ASP.NET\/SQL Server Developer on the Bank Of New York’s “Compliance & Suspicious Incident <CSI>” intranet application.\n\nDesign Patterns Utilized: Model View Controller (MVC) & Factory Patterns.\n\nTechnology Utilized: C#, ASP.NET, Javascript, SQL Server, MS Data Access Blocks for ADO.NET & Web Services.\n\nAs a result of a government settlement in a highly publicized case of unchecked money laundering at the bank I was tasked with co-designing and implementing an intranet with a user base of 20,000+ (all bank employees worldwide) that adds, edits, reports and tracks any and all suspicious incidents ranging from money laundering to bank robberies to employee injuries and enables management and legal to determine whether a Suspicious Activity Report (SAR) is to be filed with the government.\n\nLed a team of 10 developers to make a December 15th deadline for the rollout of the first phase of this project thereby avoiding exposing the bank to a 25 million dollar fine.\n\nCurrently preparing to deploy to 30,000 users as a result of the BONY\/","position":"Developer","startDate":"08\/18\/05","company":"Bank","endDate":"8\/18\/09"},{},{"summary":"\/System Architect\n","position":"Developer","startDate":"05\/26\/03","company":"Merrill Lynch","endDate":"04\/30\/04"},{},{"summary":"; System Analyst & Programme: Telecommuting and Onsite\n\nDatabase conversions, design and programming for Medical Credentialing System in VFP Codebook framework.\n\n11\/16\/98 – 2\/1\/99 Contemporary Computer Svcs. Inc. Bohemia, NY\n\nVisual FoxPro Consultant; System Analyst & Programmer: Telecommuting and Onsite\n\n","position":"Consultant","startDate":"2\/6\/99","endDate":"6\/16\/99"},{"summary":" Rutgers Law School Camden, NJ\n\n1985-1989 SUNY @ Stony Brook Long Island, NY\n\nBA Liberal Studies - Phi Beta Kappa, Cum Laude\n\n\n","startDate":"1990-1991","company":"UPS"},{"summary":" Collectibles Inc. W. Babylon, NY\nCompany Founder, Owner & President\n\nResponsible for designing, implementing and maintaining FoxPro 2.6 (Windows) and Visual FoxPro custom systems for $700k international mail order company. Implementing and Maintaining Lantastic For DOS, 5.0 and 7.0 LAN. Other responsibilities included designing, implementing and maintaining World Wide Web site, creating custom software and online ordering system for company's 600+ customer base. Writing online help systems, hiring and managing personnel, placing purchase orders, inventory control, managing customer service, purchasing ad space, designing direct response display ads, bookkeeping, payroll, overseeing shipment of 750 orders per month worldwide via ","startDate":"7\/92","company":"Universal","endDate":"3\/7\/98"},{"summary":" Bank Of NY New York, NY Senior Developer\/Analyst: Onsite\n\nTeleommunications Management System (TMS) Conversion Project, Support Utilities and WTC Attack Disaster Recovery Applications. Visual FoxPro, Visual Basic & ASP Application(s)\n\nEquipment Repair Application: Visual FoxPro 7.0\n\nTracks repairs and turnaround progress for LAN\/Phone Systems Hardware Outages\n\nWireless & Pagers Tracking Application: Visual FoxPro 6.0\n\nTracks all Pagers and Cell Phones for all bank employees.\n\nReport Formatting Utility: Visual Basic 6.0 OLE Technology\n\nTurns ASCII files generated by FOXPRO for DOS into formatted WORD documents.\n\nEmergency Telephone Directory Application: Visual FoxPro 7.0, Active Server Pages\/VBScript\/JavaScript\n\nAllowed data entry people to update Bank Phone Directory with contact information for displaced employees after WTC attacks. Created ASP pages to update employee info utilizing VB COM Objects and BONY’s Visual Foxpro database.\n\nSeptember 11 Wireless Phone Tracking Utility\n\nTracks 5000 cell phones ordered after WTC attacks.\n\n","startDate":"05\/21\/01","company":"Smith Barney","endDate":"05\/03\/02"},{"summary":"\/Analyst: Onsite\n\nWorking with Citigold Database Marketing Support & Solutions department to help coordinate large scale mainframe conversion of Citigold Software platform.\n\nPrimarily using Microsoft Visual FoxPro 7.0, Mainframe FTP feeds, DB2 & Oracle to create mailing lists, ad hoc queries\/reports, data entry applications to support DBSS department during conversion. Responsibilities included ensuring that high net-worth clients are kept abreast of the latest changes in terms of regulatory and margin deposit compliance as Salomon ","position":"Developer","startDate":"06\/24\/02","company":"Citigroup","endDate":"12\/31\/02"},{"summary":"\/Analyst: Onsite\n\n\"GinnieNet\" 5.3 Upgrade: Senior Programmer\/Analyst GinnieNet is a Visual FoxPro\/Visual Basic\/SQL Server application used by approximately 1,000 banks participating in the Government National Mortgage Association's, \"Mortgage Backed Securities\" program. GinnieNet 5.3 is a suite of applications designed with VFP \/VB\/VFP Codebook Framework, utilizing a dedicated network server, RSA encryption keys, digitally authenticated signatures, and several VB Components connected to a SQL Server Back end activated via Citrix WinFrame.\n\nMultiple Responsibilities included design and implementation of class libraries used throughout the suite to enable enhanced data processing requirements.\n\nLetter Of Credit Mortgage Certification Tracking & Reporting System\n\nLetter Of Credit Mortgage Certification Tracking & Reporting System for Banks participating in the Government National Mortgage Association (GNMA). VFP 3.0-6.0 Conversion\\Enhancements utilizing the Visual FoxPro Codebook Framework. CLS Lite (Commitment Line System) Y2K Contingency Application\n\nCLS Lite (Commitment Line System) Y2K Contingency Application for Government National Mortgage Association (GNMA) in Visual FoxPro 6.0 \/ VFP Codebook Framework \/ Citrix Winframe. Additional skills implemented: Documentation\/Technical Writing, Client Demonstrations in Washington DC for GNMA Staff, User Training and Technical Support.\n\n","position":"Developer","startDate":"6\/26\/99","company":"Bank","endDate":"10\/27\/00"},{"summary":"\/Analys: Telecommuting & OnSite\n\n\"Smart2000\" Upgrade: Senior Programmer\/Analyst Smart2000 is a Visual FoxPro application used by AP Bureaus throughout the Domestic US.\n\nResponsibilities included bug fixes, enhanced functionality and detailed analysis for Oracle\/Java team redesigning Smart2000 as an intranet application.\n\n","position":"Developer","startDate":"10\/30\/00","company":"Associated Press","endDate":"04\/15\/01"},{"summary":" Enterprise Edition\n\nJun 17, 2005\n\n310\n\nDeveloping XML Web Services and Server Components with Microsoft® Visual Basic® .NET and the Microsoft® .NET Framework\n\nJun 14, 2005\n\n320\n\nDeveloping XML Web Services and Server Components with Microsoft Visual C# .NET and the Microsoft .NET Framework\n\nJun 14, 2005\n\n306\n\nDeveloping and Implementing Windows®-based Applications with Microsoft® Visual Basic® .NET and Microsoft® Visual Studio® .NET\n\nJun 06, 2005\n\n316\n\nDeveloping and Implementing Windows®-based Applications with Microsoft® Visual C#™ .NET and Microsoft® Visual Studio® .NET\n\nJun 06, 2005\n\n315\n\nDeveloping and Implementing Web Applications with Microsoft® Visual C#™ .NET and Microsoft® Visual Studio® .NET\n\nMar 19, 2004\n\n305\n\nDeveloping and Implementing Web Applications with Microsoft® Visual Basic® .NET and Microsoft® Visual Studio® .NET\n\nMar 19, 2004\n\n100\n\nAnalyzing Requirements and Defining Solution Architectures\n\nMar 06, 2001\n\n175\n\nDesigning and Implementing Distributed Applications with ","startDate":"2000","company":"Microsoft"},{"summary":"\n\nMicrosoft Certified Professional\n\nApr 01, 2000\n\n","startDate":"0\n\nMar 06","company":"Microsoft","endDate":"2001"}],"basics":{"summary":null,"name":Development ,"label":"Developer"},"interests":[{"Strengths":"\n\nArchitecture, Full System Development Lifecycle, .NET and Leadership abilities\n\nExcellent communication skills; oral and written\n\nExcellent problem solving skills\n\n6 Years experience running a $700,000 per year high-tech mail order business I founded when I was 24\n\n\n8\n"}],"education":[{"Microsoft Certification":" Status\n\n"},{"Education":" level:\n\nBachelors\n\nIndustry experience:\n\nSenior Developer, Architecture, Consultant\n\nWork authorization:\n\nU.S. Citizen\n\nYears tech experience:\n\n24\n\nYears tech consulting:\n\n15+\n\n \n\nPosition information\n\n\nDesired position:\n\nSenior Role\n\nAvailability date:\n\n11\/9\/2016\n\nFirst choice location:\n\nNYC \/ Jersey City\n\nRelocate:\n\nNo\n\nTelecommute:\n\nYes\n\nTravel:\n\nYes\n\nDesired rate:\n\nNegotiable\n\n \n\n\n"},{"Microsoft Certification":" Exams Completed Successfully\n\nExam ID\n\nDescription\n\nDate Completed\n\n300\n\nAnalyzing Requirements and Defining Microsoft .NET Solution Architectures\n\nJun 24, 2005\n\n229\n\nDesigning and Implementing Databases with "},{"Certification":"\n\nVersion\n\nDate Achieved\n\nMicrosoft Certified Application Developer\n\nJun 14, 2005\n\nFor Microsoft .NET\n\nJun 14, 2005\n\nMicrosoft Certified Solution Developer\n\nMar 06, 2001\n\nFor Microsoft .NET\n\nJun 24, 2005\n\n"}]}