{"skills":[{"Languages":"\n\nProficient in: C#, JavaScript, JQuery, JQuery UI, Knockout JS, HTML\/ XHTML, XML, XSL, JSON, CSS, T-SQL, PLSQL\n\nFamiliar with: HTML5, CSS3, Bootstrap , Backbone, AngularJS , LUA, PHP\n\nConcepts: OOP, OOA, UML, ORDBMS, HTML DOM, XML DOM, MVC, MVP, MVVM, AJAX, ECMA Design Patterns, SPA, COM, DCOM, N-TIER, SOA, Logical Layers, TCP\/IP, IPV4, Serial Communications\n\nSoftware\n\nDatabase: "},{"Proscape Technologies":"\n\nDeveloped prototypes of Sales Presentation (ShowBuilder4.0), User Management (UserManager4.0), Electronic Resource Management (Encyclopedia 4.0), and Portal Product (Web Portal 4.0), which provided a framework for version 4.0 software to be created and to test initial object and design concepts. Prepared Personal designs for the application from company documentation.\n\nDefined and implemented standard for the creation of VB\/HTML based widgets to be used through the application. Developed prototypes for Drop Down Menus, Toolbars, Folder Trees, Calendars, and Dialog systems, without having to utilize ActiveX controls. Widgets are based off of VB objects that can be defined on the server, and spit their contents to the browser as XML. The XML is then transformed with an XSL Style Sheet, driven by JavaScript to create Dynamic HTML based widgets.\n\nTested and implemented company created tools and APIs for version 4 software.\n\nLead Developer on Electronic Resources version 4.0,4.0 SP1, 4.1. Responsibilities included scheduling, implementation, and the creation of the application from company design documentation, personal design documentation, business requirements documentation, use cases, UI concept drawings, and Prototypes. Assisted quality assurance department in the testing of application (i.e. bug fixes, enhancements, design related changes)\n\n\n"}],"work":[{"summary":"\n\nCustom Software Solutions\n\nOversaw the planning, design, implementation, and support of desktop and web-based applications. Designed and developed HTML creation utility, in C++ and Visual Basic, to facilitate the creation of e-business systems, such as shopping carts and POS applications.\n\nCreated custom shopping carts with relational database systems (ORACLE, SQL), Membership systems, Client \/ Customer Management Tools, Transaction Management w\/ Reporting features, Reporting\/ Demographic Packages, Real Time Credit Card Terminal w\/ Easy Merchant Access.\n\nDatabase Development (Oracle, SQL server) – relational databases developed in various formats for use with Websites, Retail Systems and Customer Management Systems for Internet, Intranet, and Windows based programs.\n\nWindows Application Development (C++ and Visual Basic 5-6.0) – Database Management Tools (DAO, RDO, ADO) for use, as server components, with Web Based Retail System. Custom Data Components Package (DLL) and Type Libraries Accounting Suite \/ Business tools w\/ component Package for Visual Basic. Prototype Development\n\nClients Include – Sheraton Hotels, Lab Automation Systems, Lastdogstanding (GWBush4President.W.INY2K)\n\nGraphic Design (3D \/ 2D graphics, 3DS MAX modeling, Adobe Photoshop and Premier, Logo Design, Web Site Content Creation, Banners and Advertising, Product Representations)\n\n\nJunior Program Analyst\n\n1996-1998\n\nReiter Associates Web Hosting\n\nParticipated in the design, implementation, testing, maintenance, and support of company developed customer management system.\n\nDeveloped and Implemented Web Based Customer Service System written in Visual Basic 5.0 and Active server pages.\n\nDeveloped and Implemented Automated Recurring Billing System with ICVERIFY Software Terminal, ICV SDK, MS Access, Microsoft Visual Basic 5.0\n\nDHTML (JavaScript) Development for company and client websites\n\nE-Business Planning, Design, Development, and Setup\n\n","position":"Team Lead","startDate":"1998 - 2001"},{"summary":" Windows® 2000, Windows 7, Windows XP, Windows Vista, Windows 98, Windows 95\n\nFramework and Platforms: .Net 1.1 - 4.5, WCF, ASP.Net Web Forms, ASP.Net MVC 4-5, WEB API, ASP.Net Web Services, ADO.Net, Entity Framework 3.5 - 5, Telerik RadControls for ASP.Net.\n\n","startDate":"2008","company":"Microsoft"},{"summary":", Oracle 11g, Microsoft Access, Apache Derby\n\nPlatforms: Windows Server ","startDate":"2008","company":"Microsoft"},{"position":"Senior Software Developer","startDate":"2001-2002"},{},{"summary":" (Web-based Applications Development)\n\nResponsibilities include planning, research, design, implementation, and deployment of corporate website, corporate portal, and internal business systems.\n\nCreated mortgage calculator and amortization schedule building component (web part) for real-estate listing engine and corporate portal.\n\nSupport and Maintenance of internal systems\n\nConsulted on change management strategies in regards to Internet and media marketing.\n\nTransition and adoption of current technological practices and standards in regards to IT infrastructure and enterprise-level system and applications architecture.\n\nSeton Associates, LLC - ","position":"Software Engineer","startDate":"October 2008"},{"summary":", Software Development Specialist\n\nParticipated in audit and analysis consultation for intellectual property lawsuits and copyright infringement claims. Decompiled and 'clean room' reverse engineered applications for comparison. Reengineered and defined artifacts package based on reverse requirements gathering. Interpreted obfuscated source materials.\n\nMaintenance and support of internal business systems.\n\nTransaction Payment Systems - ","position":"Consultant","startDate":"October 2009","endDate":"April 2010"},{"summary":"\n\nPrimary responsibilities include research, design, and implementation of NTCharge Win 32 Credit Card Terminal to work with existing HDC specifications.\n\nBusiness Object design and development for use with user management, transaction management, peripherals, configuration, and reporting.\n\nEntity modeling and database design.\n\nDesigned and developed custom widgets for use with user interfaces, such as, drop down menus, navigational tools, listing, and sorting\n\nDeveloped USB API and Reusable Components for Magtek Card Readers and Hypercom P1200 Pin Pad using C# and shell.\n\nDeveloped Serial Components for Dial-UP and TCP-IP Communications using C#, shell, and serial communications components.\n\n\n","position":"Software Engineer","startDate":"January 2008","endDate":"August 2008"},{"summary":"\n\nTransaction Payment Systems\n\nPrimary responsibilities include design and development of Job Control and Outboard utilities for boarding data.\n\nDocumentation and Designs of existing in house products.\n\nEntity modeling and database design. Creation of custom stored procedures\n\nUML modeling of existing business objects libraries.\n\n","position":"Senior Software Developer","startDate":"2005-2007"},{},{"summary":"-Present\n\nDepartment of Homeland Security (DHS) - August 2013 - Present\n\nCurrent responsibilities include planning, research, requirements gathering, design, implementation, deployment , and maintenance of enterprise-level inventory management system and internal business systems.\n\nContinuous ASP.Net Web Application development in C#\n\nAnalysis, engineering, and implementation of business processes within system's business logic and services layer.\n\nProof of concept, prototype development, and implementation of system components for reuse among application modules.\n\n","position":"Developer","startDate":"2013"},{},{"summary":"\n\nFocus on short-term development contracts and freelance work while being a fulltime student and father. Participated in the planning, design, implementation, maintenance, and support of contracted desktop and web-based applications. Example clients and contracts include:\n\nPacesetter Reality, Inc. - ","position":"Consultant","startDate":"2007-2013"}],"basics":{"summary":null,"phone":["08360\n\n856-794"],"email":["cheuser@verizon.net"],"name":Charles III ,"label":"engineer"},"interests":[],"education":[{"Education":"\n\nUniversity of Phoenix\n\n2009-2013\n\nPhoenix, Arizona\n\nInformation Technology \/ Software Engineering, Bachelors of Science (BSIT\/SE)\n\n"}]}