{"skills":[{"KEY Skills":" & Tools\n\nITKO CA Lisa\/DevTest\n\nSOAP UI\n\nPostman\n\nSOASTA CloudTest\n\nHP Loadrunner\n\nHP Quality Center 10 \/ ALM\n\nJIRA\n\nMicrosoft Office Suite\n\nMicrosoft SQL Server\n\n"}],"work":[{"summary":"\n\nPerformed load \/ stress \/ and non-functional tests for 40+ web applications and web services to validate system performance and stability using tools such as HP Loadrunner, SOASTA CloudTest, and ITKO Lisa.\n\nPerformance tests for UI applications were created, managed and executed in HP Loadrunner, SOASTA CloudTest.\n\nPerformance tests for web services (JSON\/XML) were created, managed and executed using ITKO Lisa.\n\nMaintained performance and security test scripts in HP Quality Center.\n\nAnalyzed test results and worked with the development teams to perform bug fixes. Recommended improvements and generated performance reports for management review.\n\nProvided technical assistance to improve system performance, capacity, reliability and scalability.\n\nSupervised script recording, ensuring correctness and quality with an understanding of monitoring requirements based on test objectives and test execution tasks.\n\nResponsible for collecting testing requirements, test execution\/analysis, project deliverables and quality.\n\nGenerated performance graphs, session reports and other technical documentation required for validation and analysis.\n\nDeveloped and managed queries in SQL Server to retrieve and analyze performance metrics.\n\nMobilized resources; created milestones towards completing performance initiatives for the Center of Excellence.\n\nSupervised the performance-testing environment, including scheduled code deployments and individuals using the testing environment during outage times.\n\nAnalyzed vulnerability assessment reports to determine validity and critical vulnerabilities.\n","position":"Engineer","startDate":"May 2012","endDate":"Feb 2015"},{},{"summary":"\n\nQA Analyst II\n\nManually tested PE Whole Loan UI application and supporting web\/rest services for the Fannie Mae client to identify system defects.\n\nEstimation, test planning, test preparation, test executions, defect logging.\n\nResponsible for reviewing system requirements and developing high level\/low level testing scenarios.\n\nReviewed test cases with development teams in order to ensure testing scenarios cover all requirements.\n\nParticipated in daily status calls with team members, developers, higher management and the client.\n\nServed as Business to Business (B2B) test lead for 3 consecutive releases.\n\nBusiness to Business (B2B) testing required both Manual UI and web service (SOAP UI) web services.\n\nPrepared test plan and test scenarios for B2B regression test suite.\n\nAutomation test preparation, planning, and proof of concept.\n\nAutomated web services using SOAP UI w\/ Jenkins Integration to decrease manual efforts.\n\nJSON\/XML validation using assertions in SOAP UI.\n\nAsurion , Nashville, TN ","startDate":"Feb 2015","company":"Fannie Mae","endDate":"Sep 2015"},{"summary":" – Current\n\nSenior QA Analyst (API Lead)\n\nCreated .COM API Automation proof of concept and served as the API automation test lead for TCS at Home Depot Online.\n\nProvided API automation support for the Cart\/Checkout team of HomeDepot.com full site and mobile site.\n\nTrained onshore\/offshore TCS employees on API automation and the DevTest tool.\n\nResponsible for building Cart\/Checkout API automation test scripts to support testers in their testing efforts.\n\nDesigned API automation workflow for six projects that TCS managed on their Home Depot portfolio.\n\nDeveloped and managed the API test suite in the DevTest tool.\n\nOversee API automation testers and their weekly tasks in relation to projects.\n\nAccenture (","startDate":"Sep 2015","company":"Home Depot"},{"summary":"\n\nMicrosoft SharePoint\n\nSDLC – Waterfall Model\n\nSplunk\n\nJMeter\n\nEclipse Luna\n\nPerf-Mon\n\nPuTTy\n\nWin SCP\n\nTOAD Oracle\n\nGemfire DataBrowser\n\nWeb\/Rest Service Testing (JSON\/XML)\n\nCross browser testing\n\nDefect Tracking\n\nCapacity Planning\n\nVulnerability Assessment\n\nServer Monitoring\n\nRequirement Analysis\n\n","startDate":"2012","company":"HP"}],"basics":{"email":["Courtezk@gmail.com"],"name":Kirkwood },"interests":[],"education":[{"Education":"\n\nTennessee State University , Nashville, TN May 2012\n\nBachelor of Science - Computer Science, Concentration: Software Engineering\n\nArgosy University, Nashville, TN, March 2015\n\nMaster of Business Administration\n"}]}