{"skills":[{"TECHNICAL SKILLS":"\n\nSoftware : VS 2010, Dreamweaver, JIRA, SAP, HPQC 9 & 11, QTP 11, Charles Web Proxy, Selenium IDE, Selenium Webdriver, Git VCS, Office 2013\n\n"},{"Languages":" : C#, HTML, CSS, Java Script, PHP, Python,\n\nDatabase: MySQL\n\nOperating Systems : Windows OS, MAC OS, Linux OS, iOS Mobile, Android Mobile\n\n"}],"basics":{"phone":["(619) 921-0116"],"email":["ana.estrada12@gmail.com"],"name":{"surname":"Web","firstName":"Charles"},"gender":"male"},"education_and_training":[{"EDUCATION":" and KEY CLASSES\n\nMaster of Business Administration, (Currently Attending)\n\nMasters of Science, Information Systems Management\n\nBachelor of Science, Computer Information Systems\n\nMinor in Business Management\n\nAssociates of Science, Computer Information Systems\n\nColeman University\n\nSan Diego, CA\n\nProgramming Concepts and Logic, Software Testing and Quality Assurance,\n\nSystems Analysis, Project Management, Agile Methodologies, Distributed Teams\n\n"}],"work_experience":[{"Experience":" with manual testing and automated testing tools for Functional, Regression, Sanity and Black Box Testing.\n\nCORE COMPETENCIES\n\nTesting • Documentation • Web • Software • Quality Assurance • Multilingual • Agile •\n\nCross Browser Testing • Black Box Testing\n\n"},{"jobtitle":"Engineer","text":" - Current\n\nAgile environment with distributed teams\n\nPerform manual tests on company’s payment processing website.\n\nAssist team with creation and maintenance of automated test suite using Selenium IDE and Webdriver.\n\nTrack and classify bugs based on severity using JIRA project tracking software.\n\nWeb Multi-browser and Mobile testing on Android, Windows and iOS\n\nWork with developers, product managers with feedback and bug reviews.\n\nCreate basic SELECT SQL-queries for database testing.\n\nSEAMGEN LLC San Diego, CA May 2014 – Dec 2014\n\nQA Analyst\n\nAgile environment\n\nPerformed manual black box testing for iOS and Android applications that were built in house.\n\nCreated a test log to track completed stories for regression testing.\n\nAssisted Business Analyst in creating and updating user stories for Agile Projects.\n\nTrack and classify bugs based on the severity using JIRA project tracking software.\n\nHD SUPPLY SOLUTIONS San Diego, CA June 2013 - May 2014\n\nQA Analyst (Contract)\n\nAgile and Waterfall environment\n\nAssisted in creating and updating the test cases for the Company’s e-commerce website.\n\nTracked and classified bugs\/defects using HPQC 9.\n\nPerformed manual testing on Android and iOS mobile.\n\nAutomated scripts to test basic website functionality using QTP 11.\n\nCreated and executed Test Plan for an internal iOS mobile application.\n\nParticipated in Application Enhancement Projects using the Scrum Agile Methodology.\n\nQUALITEST GROUP Del Mar, CA ","date_start":"December 2014"},{"PROFESSIONAL EXPERIENCE":"\n\nPAYLEASE LLC\n\nQA Test "},{"Experience":" using various types of reporting services for creating analysis reports.\n\nTrack and classify bugs based on severity using project tracking software.\n\nParticipated in the Spanish Localization Project.\n\nESTRADA’S MEXICAN FOOD Santee, CA 2002 - 2009\n\nOwner\n\nOwned and concurrently managed multiple family restaurants.\n\nSuccessfully hired and supervised employees, set schedules, prepared payroll, ordered and tracked supplies and raw materials against budgets and projections, and made all financial decisions.\n\nClient-facing initiatives included delivering high levels of customer service, enhancing food and presentation quality, sales, marketing, and driving an increase in revenues.\n\nReferences available upon request.\n"},{"date_end":"June 2013","jobtitle":"Engineer","text":"\n\nAgile environment\n\nWorked and communicated timely with a global virtual team doing Front-end testing on a Server Application using the Scrum Agile Methodology.\n\nCreated a Test Plan to perform regression and Sanity of the Application.\n\nTrack and classify bugs based on severity using project tracking software (Lighthouse).\n\nMELLMO INC. Solana Beach, CA August 2011 - August 2012\n\nQA Intern\n\nExecute test cases to perform functional, regression, and performance testing on a Mobile Application\n\n","date_start":"August 2012"}]}