{"skills":[{"Languages":":\n\nSpanish Bilingual\n\n"}],"basics":{"title":"Developer","name":{"surname":"Acosta","firstName":"Angel"},"gender":"female"},"awards":[{"Awards":" DeVry University Dean's List 2006 DeVry University Dean's List 2007 DeVry University Dean's List 2008 DeVry University Dean's List 2009 DeVry University Dean's List 2010"}],"education_and_training":[{"Certifications & Training":":\n\nProgramming : SQL, PL-SQL, Python, C#, XML, JavaScript, ASP.NET,\n\n"},{"Education":" DEVRY UNIVERSITY - Westminster Campus, CO,  Graduate date 6\/2013 Associate of Applied Science in Network Systems Administration  - GPA: 3.42 DEVRY UNIVERSITY - Westminster Campus, CO,  Degree Expected in 2014 Bachelor of Science in Network and Communications Management - GPA: 3.43 Classes to finish: 7\n\n  "},{"Training":" in : Oracle Business Intelligence\n\nStudying : OCA\/OCP Oracle Database 12c\n\nSoftware:\n\nSQL Navigator 7.2,\n\nOperating Systems:\n\nMS Windows 7\/8.1\/10, Windows Server 2008 R2\/2012 R2, Linux Ubuntu, macOS Sierra, , Mac IOS, Google Android.\n\nProtocol:\n\nLAN\/WAN, TCP\/IP , POP3, IMAP, SMTP, IvP4, DNS, UDP, DHCP, TELNET\n\nHardware:\n\nComputers, PDA, iPad, Smartphone, Servers, Cisco 2950, Cisco 3400 ME, Cisco Catalyst 3750, Cisco ME 3600X Series, Fujitsu, Juniper SRX100 & SRX210, Extreme Network Summit X150-24t, Motorola 4812 bts, Telco T340, Telco T5C, EXFO BV10, JDSU, OTDR, TRAC, BERT, Optical Power Meter, AC and DC power experience, Alcatel-Lucent 7750 Service Router, 7705 Service Aggregation Router.\n\n"}],"work_experience":[{"date_end":"March 2013","jobtitle":"Engineer","text":":   Perform troubleshooting at customer site and at the company core equipment locations. Work with design for new installations and upgrades taking place at the customer site. Managed multiple sites installs and troubleshooting all over Wyoming. • Assemble and wire components as per Installation Quality Review, including various multiplexers, DDM+, DDM1000, OC3, OC12, OC48, Atrica, Nortel, and DWDM, power equipment, rectifiers and batteries. • Create T1 handoffs loop smart jacks, program and check D-Banks for dial tone. Using Sage Test, break out DSO’s on T1 handoff for dial tone. On T3 handoff, check presence of T3 at DSX3 using T\/Berd 310 test set. Check for AC failure battery back-up functions. • On new ring turn-up, check for fiber failure to maintain integrity of mux connectivity. Install and check continuity of hand-off for Ethernet bandwidth. On data installations, complete 9.6 x N continuity, RFC 2544 testing. • Install equipment at customer or Optimum West sites, insuring the integrity of power receptacles and grounding using the Field Installation Check List. • Complete turn-up test procedures with our Service Center, 958 all lines, and 700 all DDD lines, loop T1'’, Stress Test T1'’s, check for FAX1 modem connectivity. • Install Termination Blocks for DSO or T1 hand off (possible RJ48). Test T3 continuity at DSX3. Install T1 Repeaters if loop exceeds 400 feet. Check smart jack for looping and power. Install VDSLs and MRVs as required for Ethernet circuits. • Install, program, test and turn-up Cisco Routers for customer access to the Internet. • Inform and instruct customer\/vendors regarding demarcation locations and type of hand-off. • Installation and testing of complex systems from server to routers and switches. WYOMING MEDICAL CENTER - Casper, WY (November 2010 – May 2012) Computer Support Specialist:   Work with setting up equipment for employee use, performing or ensuring proper installation of cables, operating systems, AND appropriate software. • Oversee the daily performance of computer systems across the company. • Answer user inquiries regarding computer software or hardware operation to resolve problems. • Enter commands and observe system functioning to verify correct operations and detect errors. • Set up equipment for employee use, performing or ensuring proper installation of cables, operating systems, or appropriate software. • Maintain and support over 1000+ computers across the hospital, multiple high end Ricoh printers, HP business printer and other devices. • Install and perform minor repairs to hardware, software, or peripheral equipment, following design or installation specifications. • Read technical manuals, confer with users, or conduct computer diagnostics to investigate and resolve problems or to provide technical assistance and support. • Refer major hardware or software problems or defective products to vendors or technicians for service. • Confer with staff, users, and management to establish requirements for new systems or modifications. • Assisted with the conversion of GroupWise mail system to Google Enterprise mail along with Google docs across the house. • Maintain records of daily data communication transactions, problems and remedial actions taken, or installation activities. • Responsible during the on-call week to teach the on boarding classes for new hires using power point presentation and explaining IT related security measures that complied with HIPPA regulations. • Assist with system configuration design for pre-testing of the CERNER project which is being implemented at the hospital.\n\n","date_start":"May 2012"},{"jobtitle":"Developer","text":":   Responsible to check issues with SQL queries and figure out where the problems are located. Provide those to the supervisor and come up with a fix solution. • Responsible for providing day to day support to the company within the Information Technology department. • Designs and develops computer programs that automate specific business processes. • Responsible for handling all developmental aspects of a project; including developing new software systems and modifying existing systems. • Consults with users to analyze and understand functions to automate and client needs. • Analyzes and estimates feasibility, cost, time, compatibility with other systems, and computer capabilities. • Converts designs and specifications into computer code and then into programs. • Support other Developers with Liaison implementation. • Performs data entry, as well as generating reports for inventory and software licensing. • Monitors performance of programs after implementation. Natrona County Sheriff - Casper, WY (May 2014 – January 2016) IT Technician:   I took in charge of working with system such as Watchguard and Spillman for the Sheriff Office as an IT specialist. • Responsible for Network Security, System Performance, and Communication. • Was put in charge of server orders and configuration of the servers. • Deploy new server to replace old Watchguard server with new ","date_start":"January 2016"},{"text":" R2. • Test drives Sheriff Trucks to test video recording system and communications. • Provides technical and systems support to all staff as a super user to help them learn and work with new applications and operating systems. • Assists with and coordinates system implementation from all levels such as network devices and security for the Jail and town hall center. • Performs data entry, as well as generating reports for inventory and software licensing. • Compiles data using Microsoft Excel and Spice Works to provide to the IT Director when required. Example data would be inventory, system performance, and software license. • Prepares and maintains system that includes desktops, switches, routes, mobile devices, and servers. • Troubleshoots issues and problems on all systems from desktop to servers, switches routers and communication. • Prepares and provides training for staff on new systems such as new laptops or desktops including tablets and phones. • Performs other related duties as required or assigned. VERIZON WIRELESS - Casper, WY (March 2013 – May 2014) Associate Cell Technician:   Responsible for proper operation of a small group of network elements. Applied my skills to support the interdepartmental objectives, to include preventative maintenance, installations, optimization, building and ground upkeep, and integration of network hardware’s plus interconnect facilities. • Responsible for installation, optimizing and troubleshooting of network devices at each tower. • Performs preventative and remedial maintenance on all base station and transmitter equipment. • Making recommendations to engineering for improving network coverage and implementation. • Responsible for updating daily logs for site specific information. • Perform audits as required by local, regional, corporate or regulatory agencies.  • Analyzing network coverage’s to ensure continuous communication and network integrity.  • Work with voice cells infrastructure and telecommunications such as, CDMA data; T1, DACS, and OMP. • IT related tasks such as troubleshooting, PC hardware and configurations. • Test generator at each site to make sure they could power transfer during an outage. • Work with Microwaves, Fiber optics, and switches at the cell site using JSDU and other test equipment’s. • Ran test to the LTE 4G equipment’s that involve different sectors control by TRDU, and performing bCEM upgrades. OPTIMUM WEST (Cablevision) - Casper, WY (","organization":"Microsoft","date_start":"2012"}]}