{"skills":[{"Expertise":" in Developing Applications using common J2EE Design Patterns.\n\n? Excellent communication and presentation supported by good Project management skills.\n\n"},{"Markup Languages":"\/Client Side scripting Groovy, Velocity, XML (XSLT, XPATH) HTML, XHTML, JavaScript, angular JS.\n\nModeling language UML\n\nMethodology Waterfall, Agile and Cascade\n\nIDE RAD 7.5\/6.0, Eclipse, NetBeans, JBuilder, IntelliJ\n\n"}],"summary":[{"Skill Summary":"\n\nProgramming Language Java\/J2EE (JSP, Servlets, EJB), C++, SQL\n\nPlatforms Windows, MacOS\n\nFrameworks Spring Framework, and Hibernate\n\n"},{"Experience Summary":"\n\n? Around 5 years of experience in Web development, client-server-tier Enterprise applications using Java and J2EE. Worked on all phases of SDLC including Analysis, Design Development, Testing, Implementation and Support.\n\n? Expert level programming skills in JAVA\/J2EE related technologies.\n\n? Proficient in developing Multi-Tier Enterprise applications using Java, J2EE Standards, Hibernate, RMI, Struts, Spring, Core Java, XML, HTML, JavaScript, Groovy and Velocity.\n\n? Hands-on experience Windows environments, MacOS, UNIX, Linux.\n\n? Hands-on expertise IDE Tolls: Rational Application Developer, Eclipse, MyEclipse, Netbeans, JBuilder\n\n? "}],"basics":{"phone":["(818) 207-4478"],"email":["aaghajanians@gmail.com"],"name":{"surname":"Tolls"}},"education_and_training":[{"Education":"\n\nAmerican University of Armenia - 2011-2013 MS in Computer Science and Information Thesis: Vehicle Emergency System. Yerevan State University of Armenia - 2006-2010 Bachelor of Engineering in Civil and Industrial Engineering Thesis: Construction Calculation for Basketball Stadium\n"}],"work_experience":[{"date_end":"May 2016","jobtitle":"Developer","text":" Description\n\n? Developed Java Beans to use in JSPs.\n\n? Designed and developed various user interface screens using JSP, HTML.\n\n? Developed web interfaces using JSP and Java Script.\n\n? Analyzed, Designed and developed components for the business logic\n\n? Involved in doing various testing efforts as per the specifications and test cases including Unit testing.\n\n? Provide support of application deployment and maintenance, supported testing.\n\n? Develop JSP pages that use Java beans for server side and backend processing\n\n? Involved in developing and designing the GUI.\n\n? Designed and developed various user interface screens using JSP, HTML.\n\n? Developed web interfaces using JSP and Java Script.\n\nCybeset Corp. January 2014 - February 2015 Position: Internet Marketing Agent Description\n\n? Website Development, CMS and E-commerce platforms\n\n? setup and maintenance\n\n? Internet Marketing Project Management AUA June 2013 - September 2013 (Internship) Description\n\n? University Management System development.\n\n? I was part of team Starting from the first days of project.\n\n? It includes being involved in requirement gathering\n\n? use case scenario creation,\n\n? UML diagram creation\n\n? data base diagram creation\n\n? algorithmic decisions. Unisoft Development - ","date_start":"February 2015"},{"date_end":"April 2012","jobtitle":"application developer","text":" Description\n\n? Responsible for development of business logic and data access layer of an application.\n\n? Created database access code to implement JDBC connectivity to SQL.\n\n? Was also involved in requirement gathering, user case and sequence diagram preparation.\n\n? Prepared documentation for future references and updates.\n\n","date_start":"October 2011"},{"jobtitle":"Developer","text":" Description\n\n? Design, develop, and implement software packages for eCourt.\n\n? Designed and developed various user interface screens using JSP, HTML.\n\n? Developed web interfaces using JSP and Java Script.\n\n? Test the features you create, including creation of Selenium tests.\n\n? Incorporate feedback from, product managers, interaction designers and back- end engineers.\n\n? Troubleshooting, debugging and some client-facing activity.\n\nMCN Software ","date_start":"May 2016"}]}