{"skills":[{"Programming Languages":"\n\nC, .Net (C#, VB), XAML, Java Script, T-SQL, HTML, XML\n\nDatabases\n\nSQL Server 2005\/2008\/2012\n\nTools\n\nVisual Studio "},{"Technical Skills":":\n\n"},{"Web Technologies":"\n\nASP.NET, AJAX, WCF, Silverlight, JQuery, HTML\n\nOperating Systems\n\nWindows XP\/Vista, Windows 7 and Windows 8\n\nMethodologies\n\nOOP Concepts, N-Tier Application and Agile Scrum Methodology\n\n"},{"Expertise":" in Relational Database Management Systems and Experience in PL\/SQL programming. "}],"summary":[{"Professional Summary":"\n\nCORNER BAKERY CAFE, DALLAS, TX Jun 2013 – August 2016\n\nROLE: SR .NET DEVELOPER\n\nDescription:\n\nThis project is all about the tracking daily issues that corner bakery human resource management system has at all over the offices present in USA. In this we rectify all the day to day issues that are sent by their employees. This HR Portal system maintains the information about adding new employee information as well as adding new store information. This system provides the access permission for Area Directors or Regional Directors to request for Pay Rate Change, add an existing employee additional Job Role or remove that employee for a particular Job Role and can also terminate any employee.\n\nResponsibilities:\n\nObject oriented technology was extensively used for developing re-usable frameworks for Data access layer and Standard EXE framework using C# 3.0.\n\nDeveloped ASPX web pages for Application using ASP.NET 3.5, C# 3.0, XML, XSL\/XSLT, HTML and JavaScript.\n\nDeveloped module which deals with validating user and displaying of information depending upon role of the user in site Using ASP.NET.\n\nWorked on SSIS technology to create packages and schedule them as SQL Jobs.\n\nImplemented Data access layer using ADO.NET to connect and retrieve or manipulate database information.\n\nUsed Grid View, Data List and Repeater controls with Paging and Sorting for displaying various data on to the page.\n\nExtensively used User interface controls which use JQuery to ensure client side validation.\n\nDeveloped Stored Procedures, Triggers, and Views in SQL Server 2008 for accessing the database.\n\nExtensively used Crystal Reports to generate custom reports.\n\nImplemented and extensively used the Object Oriented programming concepts in C# and ASP.Net 3.5.\n\nExtensively used ASP.NET user controls, Custom Controls, Master Pages and CSS for the ASP.NET forms.\n\nDeveloped the Classes, Objects, DataSet Classes, and Methods depending upon the business requirements.\n\nUsed ASP.NET User Controls to create wizard steps for submitting and modifying events and evaluation forms. Involved in creating the logic for the several different modules.\n\nDeveloped Custom Controls which provides flexibility, reusability better design time experience.\n\nDeveloped partial post back validations to manipulate data on web pages using AJAX.\n\nUsed Visual Source Safe (VSS) for version control of the source code along with the maintenance of the builds and the relevant documents of the same.\n\nEnvironment:  .Net Framework 4, C#, ASP.Net, MVC 4.0, ADO.Net, Crystal Reports 14.0, T-SQL, JavaScript, CSS3, HTML 5, Visual Studio 2008 \/ 2012, Web services, VSS, SQL Server 2008 \/ 2012, SSIS.\n\nWellCare, Tampa, FL Jan 2012 – May 2013\n\nROLE: SR .NET DEVELOPER\n\nDescription :\n\nWell Care Insurance is mainly a Health and life insurance company. The company’s goal is to provide value added investment opportunities through sophisticated asset and investment management programs. It uses web services for utilities like for verifying customer’s address, credit history, credit card payments. Customer Flow (CF). It is an Intranet application, which is mainly designed to process and coordinate policies. This application helps the employees to process and maintain policy details.\n\nResponsibilities:\n\nAnalysis, design and development of Applications using Microsoft Solutions Framework processes.\n\nDesigned and implemented a three tier architecture that included Presentation, Business and Data Access Layers.\n\nDeveloped architecture for this web-based application using ASP.NET 3.5, C# 3.0, Service Oriented Architecture (SOA), Web Services, Windows Communication Foundation (WCF).\n\nImplemented Web services with SOA using WCF for passing data to multiple platforms.\n\nUsed nHibernate and WCF to communicate between Data Access Layer and other business components.\n\nObject oriented technology was extensively used for developing re-usable frameworks for Data access layer and Standard EXE framework using C# 3.0.\n\nDeveloped dynamic ASPX web pages for Application using ASP.NET 3.5, C# 3.0, HTML and JavaScript.\n\nDeveloped module which deals with validating user and displaying of information depending upon role of the user in site Using ASP.NET.\n\nUsed extensively JQuery, Java Script and ASP.NET 3.5 for AJAX Implementation and Client Side Validations.\n\nWorked with ASP.NET 3.5 Web Forms, Web Services, and State Management, Caching features, configuring optimizations and securing the web application.\n\nExtensively used ASP.NET user controls, Custom Controls, Master Pages and CSS for the ASP.NET forms.\n\nDesigned many user screens with extensive use of Server controls like Grid views, Validation Controls and User Controls.\n\nUsed ADO.NET to Connect to the Database that provides rich set of components for creating distributed, data-sharing applications and used ADO.NET objects such as Connection Object, Command Object, Data Reader Object, Dataset Object and Data Adapter Object.\n\nCreated new database objects like Store Procedures, Functions, Packages, Triggers, Indexes and Views using T-SQL.\n\nInvolved in Unit testing of the interfaces developed.\n\nMaintained different change sets and versions of the web applications by using TFS.\n\nEnvironment:  NET Framework 4.0, ASP.NET 3.5 , C#, MS Visual Studio 2010, IIS, SQL Server 2008, ADO.NET, HTML, nHibernate, T-SQL, Silverlight, WCF, JavaScript, AJAX, XML, XSLT, Team Foundation Server (TFS).\n\nACS A "},{"Educational Profile":":\n\nBachelors of Technology. Kakatiya University, 2004.\n\nAugust\n"},{"Career Summary":":\n\nOver 9 years of extensive experience in Software Industry.\n\nExtensive experience in .NET Framework 4.0\/3.5\/3.0\/2.0 web based application using Microsoft.NET Technologies including ASP.NET 3.5\/3.0\/2.0, C#, ADO.NET, Server controls and Web Services.\n\nExtensive work experience on Web based applications using C#, VB.NET, ASP. NET, ADO.NET, VBScript, XML, CSS 3, HTML 5. Work experience on nHibernate, ASP.NET MVC 4 application.\n\nPossess excellent knowledge in Design patterns, OOP concepts and SOA.\n\n"}],"basics":{"name":{"surname":"Framework"}},"education_and_training":[{"Certifications":":\n\nProgramming in HTML5 with JavaScript and CSS3.\n\nMCTS: Web Applications Development with MS.NET Framework 4.\n\nMCTS: Windows Communication Foundation Development with MS.NET Framework 4.\n\nImplementing Data Models and Reports with "}],"work_experience":[{"date_end":"2012","jobtitle":"Developer","text":", TFS and VSS\n\n","date_start":"2005"},{"Experience":" in SQL Server 2008\/2012 SQL Server Reporting Services (SSRS) and SQL Server Integration Services (SSIS).\n\nExcellent inter personal skills, extremely dedicated, good team player and proactive in nature.\n\nExcellent communications skills, good team player and have good analytical capabilities.\n\nGood organizational skills, ability to handle multiple tasks and work independently as well as in a team.\n\n"},{"text":".\n\nDesigning Business Intelligence Solutions with Microsoft SQL Server\n\n","organization":"Microsoft","date_start":"2012"},{"date_end":"Dec 2010","text":"\n\nROLE: .NET DEVELOPER\n\nDescription:\n\nThere were multiple systems in the eCommerce area such as a tool called PMT (Product Management Tool), OCS (Order Client Service), several background Jobs and WCF services among others. PMT was a WPF application designed for internal use in which users could create, read, update, insert and delete products in the Database; Order Client Service was a Visual Studio solution with multiple background processes to help with the web-orders management.\n\nResponsibilities:\n\nDefining and Setting up Application Review (Functional Flow) of the PMT.\n\nApplication design and development of support documents.\n\nInvolved in developing, enhancing the browser based Intranet applications using ASP.NET, C#.NET and VB.NET.\n\nDeveloped the presentation layer which consisted of ASP.NET Web Forms, User Controls and their associated code-behind files.\n\nCoded the application logic layer which contained all the business rules and business entities represented by C# Classes. It also contained data access logic and data access classes using ADO.Net, which would communicate with the underlying database layer.\n\nUsed ADO.Net to provide connectivity to SQL Server back end database.\n\nDesigned the business logic and implemented it by creating interfaces, abstract classes, static classes and sealed classes.\n\nExtensively involved in using MVC and MVVM patterns.\n\nWriting Stored Procedures using T-SQL in SQL Server.\n\nDebugged programs, analyzed and made newer versions of the current components and\/or systems.\n\nMaintenance of WCF services and Web Services Provided.\n\nMaintenance of a WPF application provided.\n\nParticipated in periodic technical reviews of various modules and developed schema to improve them.\n\nSolved TFS Bugs and Tasks related to the current systems.\n\nUsed Team Foundation Server (TFS) for project repository and versioning control.\n\nEnvironment : Visual Studio 2010, ASP.Net, Entity Framework, C#.NET, VB.NET, ADO.Net, XML, MVC, MVVM, WCF, WPF, SQL Server 2008, T-SQL, HTML 4, TFS, AJAX.\n\nDean Health Plan, Madison WI July 2008 – Dec 2009\n\nROLE: .NET DEVELOPER\n\nDescription:\n\nIn today's busy world, well-being often takes a back seat to other daily priorities. Dean Health Plan is committed to helping you focus on your well-being now - before a health condition occurs or worsens. That's why Dean Health Plan offers the Well-Being Assessment (WBA). Dean Health Plan is committed to the overall health and well-being of our members, and we are dedicated to supporting healthy lifestyles. Now, take advantage of Living Healthy and get rewarded for making those everyday good choices.\n\nResponsibilities:\n\nInvolved in all the phases of Development Life Cycle.\n\nInteracting with business analysts, business users, testers, other developers and management to deliver a Web based solution.\n\nInvolved in Test Driven Development and in testing of the application as a member of the Quality Assurance team.\n\nTransformed business\/functional requirements to technical specification documents.\n\nCreated ASP.NET User Controls to reduce the complexity of User Interface (UI) design.\n\nUtilized JavaScript for Client-side validations that greatly decreased processing time and resource consumption, freeing resources for use by other applications and speeding up processing times.\n\nWorked on SSRS technology to generate different types of reports.\n\nInvolved in the creation and consumption of several XML Web Services.\n\nDeveloped several Business Classes using C#.\n\nUsed nHibernate and WCF to communicate between Data Access Layer and other business components.\n\nWorked as IIS web Server administration to manage web sites, redirect request and restart IIS.\n\nProgrammed ADO.Net for communication between application and database, used extensively Data Grid, Data Set, Data Table, Data Views, Data Adapter and Data Readers.\n\nInvolved in performance tuning and designing database tables, Stored Procedures, Functions and Triggers in SQL and T-SQL.\n\nUsed Team Foundation Server (TFS) as a Source code control.\n\nEnvironment : ASP.Net, C#, ADO.Net, HTML, JavaScript, SQL Server 2008, AJAX, Visual Studio.Net 2008, .Net Framework 3.0\/3.5, Windows 2005, TFS, nHibernate, WCF, SSRS, IIS.\n\nELOGBOOK FOR PETROCHEMICALS, INDIA Jan 2007 - Jun 2008\n\nROLE: PROGRAMMER\n\nDescription:\n\nThis is a web application for petrochemical industry, where it manages plant, departments, assets and activities of the employees. It also manages the shift allocated to each employee of a particular plant and generates customized reports depending on the details of employees. It also contained an Excel add-in application to generate Excel spreadsheets for given criteria.\n\nResponsibilities:\n\nThe existing application was in .NET 2.0 and SQL server 2005 as backend. Migrated the entire database to Oracle and My SQL with all the stored procedures and functions.\n\nMigrated the web application from .NET 2.0 from .NET 3.5 and made the application compatible with Oracle and My SQL.\n\nDatabase work involved, writing PL\/SQL statements, Triggers, Functions and Stored Procedures, which were in turn called by the Data Access modules using ADO.NET.\n\nWorked with SQL Server 2008, Oracle and MySQL for database migration.\n\nDeveloped web pages using C# to support the new functionalities and enhance the existing ones.\n\nClient communication, Requirement gathering, Analysis, Design, Coding and Development, Integration testing, Defects Solving.\n\nUsed Team Foundation Server (TFS) for the security and the version control.\n\nEnvironment:  ASP.NET, C#.Net, .NET Framework 2.0\/3.5, SQL Server 2005\/2008, Oracle 10g, My SQL, ADO.NET, Java Script, HTML, CSS, TFS.\n\n","organization":"Meijer","date_start":"Jan 2010"},{"text":", ASP.NET 3.5, C# .NET, VB.NET, ADO.NET, SQL Server2005\/2008, XML, AJAX, Share Point portal 2003, SOAP\/REST, SSRS, Agile Scrum Methodology, Crystal Reports, Team Foundation Server (TFS).\n\n","organization":"Microsoft","date_start":"2008"},{"Experience":" in developing and consuming XML Web Services using WCF, WSDL, UDDI, SOAP and LINQ.\n\nHaving 8 years of experience using ASP.NET 2.0 or above, using C# programming, using Visual Studio 2008 or above.\n\nOver 3 years of experience using .NET Entity Framework, AJAX, XML, JavaScript.\n\n"},{"date_end":"Dec 2011","text":"\n\nROLE: SR .NET DEVELOPER\n\nDescription :\n\nCyberAccess application was Healthcare application and mainly developed for State of MO, TX and KY to find patient’s information based on Patient ID, Date of Birth, First Name and Last Name. Based on their patient’s id our application is mainly find the information about patient’s drug history, prescription and doctor’s information.\n\nResponsibilities:\n\nResponsible for developing user interface by using asp.net with VS 2010.\n\nDeveloped business objects by using WCF with code behind was c#.neT.\n\nDeveloped Web forms, HTML Controls, web controls and Cascading Style Sheets (CSS) using ASP.NET 3.5, C#.NET, VB.NET as Code behind languages and developed Business objects in C# and WCF.\n\nResponsible for developing WCF Web Services with Service Model.\n\nResponsible for developing different contractors like data contractors, operation contractors, service contractors, message contractors by using WCF Service model.\n\nWrote stored procedures and Queries by using SQL Server 2005\/2008 with SSMS (Sql Server Management studio).\n\nDeveloped Reports using SQL Server 2008 Reporting Services (SSRS) and integrated with Web pages.\n\nResponsible for doing enhancements for existing production applications.\n\nMaintained different change sets and versions of the web applications by using TFS.\n\nUsed Agile Scrum Methodologies in developing web application.\n\nResponsible for writing user friendly validations by using VS2008 and Java script.\n\nGave Production support once web applications and win forms are deployed into production.\n\nResponsible for Participated ongoing maintenance, production roll outs & testing.\n\nEnvironment:  ","organization":"Xerox","date_start":"Jan 2011"},{"Experience":" in creating SOA applications using WCF and Web Services.\n\n"},{"Experience":" in database programming in writing T-SQL Stored procedures, Triggers, Constraints, Views, User Defined Functions and Indexes using various DDL and DML commands.\n\n"},{"Experience":" and excellent knowledge of working with MVC pattern, MVVM pattern, Design Pattern (singleton), reporting tools such as Crystal Reports and Reporting Services.\n\nWorking knowledge on Win Form based applications, AngularJS, Bootstrap 3 and Web API technologies.\n\nExtensively followed Agile Scrum Methodology for Software Development.\n\n"}]}