{"skills":[{"Web Technologies":" :ASP, ASP.NET, HTML5, ADO.NET, HTML, JavaScript, VB Script, CSS, AJAX, MVC, Web Services, CSS3, XML, JQuery\n\n"},{"Languages":" :C#.NET, VB6, VB, C++, PL\/SQL T-SQL. Databases :MS SQL Server […] Oracle […] . Enterprise Servers :Microsoft IIS […] & 7.5. Design Tools :MS Visio […] MS Office, MS Project.  Source Control :Team Foundation Server, GitHub. Reporting Tools :SSRS, SSIS . IDE :Visual Studio 2005, 2008, 2010, 2012, 2013, 2015. Operating Systems :Windows […] MS DOS. Software Testing :NUnit framework, T-SQL Testing.\n\n2"}],"summary":[{"Skills Summary":"\n\nOver 3 years of professional software experience in gathering Requirements, Analysis, Design, Development, Maintenance, Enhancement, & Production Support of Web Applications using Microsoft Technologies \n\nHands-on experience in UI Design using Win Forms, Web Forms, and programming ASP.NET, C#.NET, ADO.NET, JavaScript, LINQ, AJAX, Assemblies, jQuery by using .NET Framework […] \n\nProficient in development of Web & Windows based Applications; have good experience working with multithreaded applications and also proficient with migrating from ASP.NET\n\n"}],"basics":{"phone":["(408)-431-3248"],"title":"model","email":["bala1.wes@gmail.com"],"name":{"surname":"Framework"}},"education_and_training":[{"Education":"\nMasters in Computer Information Systems from University of Central Missouri\n\nBachelors in Computer Science from Andhra University\n"}],"work_experience":[{"Experience":"\n\nU-HAUL CORPORATE\n\nPhoenix, Arizona\n\nJan 2016- Till Date (10 Months)\n\nRole: .NET DEVELOPER\n\nResponsibilities: \n\nWorking in an agile environment to deliver higher-quality software far more rapidly \n\nSuccessfully organized initial set of requirements into master list of Use Cases \n\nInvolved in development of Web Forms, classes using ASP.NET that incorporates both N-Tier Architecture, and Database Connectivity \n\nDesigned and developed an application using Model View Controller (MVC) 5 application framework. \n\nUsed ASP.NET Web Form controls like Textbox, Button and Dropdown list controls for creating an easily accessible user interface. \n\nUtilized ASP.NET input validation controls and JavaScript to perform client side validation. \n\nUsed Visual Studio 2013 to design the web pages, develop and debug the web application \n\nWorked on different aspects of .NET framework like ASP.NET 5.0 and on middleware ADO.NET \n\nInvolved in designing User Interface with CSS3, HTML5 and JavaScript\n\nUsed Windows Communication Foundation (WCF) web services for creating Service end points and Service contracts for the Application and consumed the web services. \n\nUsed AJAX to trade data with a Web Server without reloading the page \n\nUsed SOAP to implement Web Services and Consumed and published XML Web Services in the application \n\nDeveloped extensive Stored Procedures and Triggers on SQL Server 2012 databases which are hosted on Windows sever 2012\n\n"},{"Experience":" working with Team Foundation Server 2013 \n\nHandled run-time errors and design time errors by implementing appropriate error handling mechanism. \n\nUsed cascading style sheets (CSS) to provide style and formatting for the Web pages. \n\nResponsible for creating detailed requirements, test plans and procedures for application testing.\n\nEnvironment: .NET Framework 4.5, C#, ASP.NET, HTML5.0, JavaScript, CSS3, JSON, MVC5, TFS 2013, XML, SOAP UI, SQL Server 2012, Windows Server 2012\n\nDelve Infotech\n\nHyderabad-Telangana\n\nJan 2013- Jul 2014 (1 Year 7 Months)\n\nRole: JR .NET DEVELOPER\n\nResponsibilities: \n\nDeveloped web pages to create messages, to set up messages rules and to set up content using ASP.NET, AJAX, C#, Oracle, JavaScript and XML. \n\nWorked in MVC architecture to create web applications using ASP.NET and Sql Server. \n\nWorked on ASP to develop web pages and mobile banking apps in our applications. \n\nUsed VB.NET as a code behind for all the web pages. \n\nWrote stored procedures based on requirement in Oracle. \n\nCreated several user controls and custom controls in ASP.NET, C# \n\nUsed Telerik controls for spell checking, sending emails in several web pages. \n\nUsed AJAX to call WCF services from JavaScript. \n\nCreated WCF Services responsible for communicating and providing real time data from integrated server to Client Application. \n\nTeam Foundation server 2010 (TFS) has been used for all the source code maintenance among the whole team members \n\nDeveloped Web forms for User Interfaces using ASP.NET WEB API and C#.NET using Server controls, HTML, controls and User controls \n\nWorked on Complex Stored Procedures, Functions, Triggers in Sql Server, Oracle. \n\n"},{"Experience":" in writing Unix scripts for scheduling jobs. \n\nWorked on SSIS packages to Consolidate data in Oracle database. \n\nCreated various reports like tabular reports, matrix reports, parameterized reports using SSRS. \n\nEnvironment: ASP.NET, C#, MVC, WEB API, Oracle 10g, Visual Studio, .NET 2008, T- SQL, TFS, Unix, XML, SQL Server 2005, Oracle, .NET Framework 3.5, AJAX Control Toolkit.\n\nTechnical skills:\n\n"},{"Experience":" in working with Microsoft Visual Studio […] using ASP.NET, C#, VB.NET, ADO.NET, JSF, AJAX, WCF on Microsoft .NET Framework […] \n\nProficient in front end UI development using HTML, AJAX, CSS (Cascading Style Sheets) and jQuery. \n\nGood experience in coordinating between onsite and offshore model. \n\nHave good communication skills and proven capabilities as a good team player. \n\nAbility to work in both a stand-alone and a team environment.\n\nCreative keen learner.\n"}]}