{"skills":[{"Skills":"\n\nC#, PHP, SQL, JavaScript, HTML5, ASP .NET, jQuery, AJAX, Bootstrap, Master Page, MySQL, SQL Server, T-SQL, Fox database, PHP MyAdmin, Crystal Reports, Windows Forms, Barcode Rendering Framework, XML, JSON.\n"},{"Union Technologies":" de México - Industrial Cleaning Services, Mexico\n\nIT "}],"summary":[{"Summary":"\n\nResponsible for gathering requirements, creating technical specifications, database design, designing the user interface, leading a team of programmers.\n\nOverall experience in the whole IT support department, with abilities to fulfill the Hardware AND Software needs of a project.\n\n4+ years of experience working as a Web developer using multiple technologies on scalable projects.\n\nExpert knowledge of front-end web technologies including HTML, CSS and JavaScript and different design frameworks.\n\nStrong skills on C#, implementing applications using ASP .NET in combination with other technologies.\n\nStrong skills on database design, implementation and administration using technologies such as SQL 2005, 2012, Oracle, SQLite, MySQL, T-SQL and Non-SQL databases.\n\n"}],"basics":{"phone":["(678)308-1708"],"title":"Developer","email":["bernie.a160@gmail.com"],"name":{"surname":"Software"}},"education_and_training":[{"Education":"\n\nComputational Systems Engineer\n\nVeracruz Institute of Technology, Veracruz, Mexico.\n\nProfessional License Number: 7262019.\n\nElectronics Technician.\n\nCentro de Bachillerato Tecnológico Industrial y de Servicios NO. 48, Mexico.\n\nProfessional License Number: 5519532.\n"}],"work_experience":[{"jobtitle":"Developer","text":"–Present\n\nDesign and develop web based and back end process applications for the company’s internal business.\n\nWorks on the maintenance or enhancement of existing data structures.\n\nFollowing best practices and implementing common patterns using ASP.NET Web Forms and major Microsoft Technologies.\n\nWork generally involved creating ASP.NET applications in C# with SQL Server databases accessed both directly, and through custom or existing web-services as simple and complex data analysis.\n\nHeavy use of Store Procedures and triggers to request and update information on the databases.\n\nDevelopment and consumption of SOAP and REST-based web services, XML, JSON.\n\nReports with special charts were made for directives using Crystal Reports.\n\nWorked with frameworks such as Bootstrap, Foundation, and HTML5 to increase the development and deployment speed of Responsive Designs.\n\nIntegration, testing and troubleshooting of different Front-End components designed by co-workers.\n\nThe use of jQuery was required, mainly for AJAX calls to the server.\n\nWorked on a Scrum environment with daily stand ups and weekly goals.\n\nAT&T, Atlanta, GA,\n\nSenior .NET ","organization":"Bank of America","date_start":"Jul.2015"},{"jobtitle":"Developer","text":"\n\nDesigned and developed layered based applications under company department’s requirements.\n\nUsed SCRUM and MVC as the design pattern under the .NET platform.\n\nDatabase analysis, data mining, business and development using .NET (C#) and SQL Server.\n\nSupported and enhanced ongoing production processes.\n\nBack-end transparent implementation and integration of customer requirements into the existing overall system.\n\nTesting, Debugging and Correction of different Front-End components using HTML, CSS, JavaScript and jQuery\n\nOptimized legacy data importers, Custom report generators and overall maintenance of the application.\n\nCreated SQL Server database and .NET software (Winforms, WPF, ASP.NET) to support production.\n\nManagement of hosting environment, including database administration and scaling of the application to support load changes.\n\nParticipated in the creation of a number of support applications in .NET to manage and accumulated information from dozens of databases.\n\n","date_start":"2015"},{"date_end":"Feb.2014","jobtitle":"Manager","text":"\n\nIn charge of all the aspects of designing, implementing and testing a Payroll Receipt System for the company.\n\nSystem GUI made entirely on HTML5 using Bootstrap for responsive design.\n\njQuery was used for asynchronous calls to the server.\n\nMySQL database was used for the back-end and data saving needed for tracking purposes.\n\nParticipated in all phases of the development life cycle, focusing on coding, testing, and debugging.\n\nPhpMyAdmin was used for the complete design of the database.\n\nThe payroll receipts were delivered in XML format from a desktop system previously developed. The web system was programmed to read that info and turn it into a pdf file that was stored in the server for a month.\n\nUsing a mail from the host when all the files are in the server and ready to be downloaded, the system send a message to all the workers in order for them to print the receipt.\n\nUsing PHP and Pagination the administrator could view all the files to add extra information individually.\n\nNOV Tuboscope - Oil Services, Mexico\n\nApplications Support Analyst\n\nMar.2012 – Aug.2013\n\nIn charge of designing and implementing a system of special reports for pipe inspection. For this particular project I had to work closely with specialists and engineers in order for the application to deliver precise information with high float point.\n\nDevelopment of the system using ASP .Net framework and C# as main programming language.\n\nThe MVC design patter was used to develop the entire project.\n\nSQL Server 2012 as Database for the back end using Entity framework with a data base first approach.\n\nStored procedures were used to maintain all fetching of the database. C# was used only to make links between the registers.\n\nThe GUI was developed via Master Page, using Bootstrap and CSS for additional styles.\n\nFor certain parts of the system the use of jQuery was required, mainly for AJAX calls to the server.\n\nThe reports needed were created using Crystal Reports using printed versions as starting point.\n\nFrom the data that field inspectors gathered, special charts were made for directives using Crystal Report as well.\n\nThe data could be exported as Microsoft Excel and PDF.\n","date_start":"Sep.2013"},{"Experience":" with many web APIs and mobile optimized development.\n\nCapable of thinking out of the box and use new or different kind of technologies.\n"},{"Experience":" in manipulating and transferring data with XML and JSON .\n\n"},{"Experience":" working in applications directed to desktop and mobile web, using responsive design with Bootstrap, JQuery and JavaScript.\n\nWorked with popular design patterns such as MVC, Singleton, Delegation, Publisher Subscriber, TDD and Key Value Observing.\n\nFront-end\/Back-end development, database development, UX design, and REST API development.\n\n"},{"Experience":" on the assembling and configuration of special PC’s in order to use them for the sole purpose of filling the databases.\n\n"}]}