{"skills":[{"Technical Skills":"\n\nVirtualization : VMware Infrastructure 3\/4\/5; VMware Workstation 5-8; VMware Server and Player; VMwareView; Citrix\/Xen\n\nOperating Systems : Windows Server 2008 SP2\/R2, Windows 7 and 8, AIX, HP-UX, SunOS, Solaris, Open Solaris, Red Hat Enterprise Linux, SUSE, Fedora, CentOS, Ubuntu, Kubuntu\n\nRelational DBMS : Oracle, SQL\/DS, DB\/2, SQL Server, Postgresql, MySQL, Firebird 1.5\n\nFull Text and Object : STAIRS, Verity TOPIC, Tika, SAX, Solr, CACHE,SQLAlchemy\n\nBig Data and NoSQL : Hadoop, Hbase, Hive, Pig, Mahout, Neo4J, MongoDB, Cassandra\n\nData Manipulation: Pentaho Kettle, DataWrangler, Miso Dataset , Processing\n\n"},{"Languages":": FORTRAN, PL\/1, REXX, PL\/SQL, C, C++, Python, Java, Javascript, R, Scala\n\nWeb Development : Django, web2Py, Turbo Gears, Pylons , Closure, Play2, jQuery\n\nFirewall Packages : Checkpoint-1; SELinux Firewall; TIS Internet Toolkit\n\nSecurity : Cheops, Tripwire, Snort, Nessus, Ethereal\/Wireshark, Nmap\n\nProvisioning : vCloud Director, Puppet, Whirr, Mesos, Ambari\n\nEnterprise Monitoring : Zenoss, Ganglia, Nagios, Cacti, RRDtool\n\nVersion Management : Git, SVN\n\nVisualization : D3.js, Envision.js, GeoCommons, Gephi, Processing, Protovis, Tableau\n\n"}],"summary":[{"Summary of Qualifications":"\n\nOver [20] years of experience in full life-cycle design, development, and support of systems application architecture\n\nExtensive experience performing as lead database administrator on multiple mainframe and mini systems and multiple database implementations (relational, object, full text and NoSQL)\n\nSolid knowledge involving system administration of VMware virtualization environments for Linux and Wintel operating systems in a Worldwide 24x7 highly-secure environment\n\n"}],"basics":{"phone":["(210) 853-7041"],"title":"Marshall","address":["1507 Catalina Drive Leander, TX 78641"],"email":["rmarshasatx@gmail.com"],"name":{"surname":"Marshall - CV","firstName":"Bob"},"gender":"male"},"accomplishments":[{"Southwest Research":" Institute, San Antonio, TX "}],"extracurricular":[{"Education & Associations":"\n\nUniversity of Notre Dame, Notre Dame, IN 46556, B.S. Chemistry 5\/1980\n\nUniversity of Texas Medical School, San Antonio, TX 78288 3\/1985\n\nIEEE Computer Society (IEEE CS) - Member\n\nAssociation for Computing Machinery (ACM) - Member\n\nInternational Information Systems Security Certification Consortium (ISC)2 – Member and CISSP\n\nCloud Security Alliance - Member"}],"work_experience":[{"Experience":" with migration to public clouds including Azure, Google Storage and BigQuery, and AWS EC2, S3 and EMR\n\nPossess International Information Systems Security Certification Consortium (ISC)2– CISSP Certification and Microsoft Certified Technology Specialist in Windows 7 Admin\n\nExperienced in data center design including high-availability clusters and Rack Mount and HP Blade Systems, including Space, Power, and Cooling, with extensive local and remote provisioning experience\n\nExtensive experience and training with security and information standards including HIPAA, FISMA, DISA STIGs and NIST\n\nProven ability to quickly learn, analyze, and apply cross-platform technology to new or existing technology in order to meet Enterprise needs\n\nHighly developed project management skills to plan, prioritize, organize, assign, and monitor work within a project team\n\n"},{"Professional Experience":"\n\nHewlitt-Packard "},{"jobtitle":"Engineer","text":" – AD\/Exchange Group, Systems Operations Branch, Sustainment Division, USAMITC\n\nTier 3 support of VMware Virtualization to Army Medical Command and Military Health System users worldwide.\n\nUpgrade of Datacenters from VMware Infrastructure 3 to vSphere 4\/ESX to ESXi.\n\nVirtualization of ","date_start":"2011 - 2012"},{"jobtitle":"Developer","text":"\n\nMaintained and updated RepDV, a system for the collection, ranking, analysis, and dissemination of malicious IP addresses and DNS entries gathered worldwide and used to control HP TippingPoint Intrusion Protection System and Security Monitoring System appliances\n\nProvisioning and maintenance of EC2-based Honeypots\n\nA Cloud For Everyone 2011 - 2012\n\nSenior Architect\n\nDesigned and implemented a POC 10-node Apache Hadoop\/CentOS\n\nDesigned a portfolio of Big Data\/HPC clusters from 20 CPUs\/112TB mini-rack (table top) to 144 CPU\/0.5PB single rack\n\nUS Army Medical Information Technology Center, Fort Sam Houston, TX ","date_start":"2012 - 2013"},{"jobtitle":"Administrator","text":"\n\nDesigned and Implemented Zenoss and Nagios network operations\/monitoring center.\n\nSQL Server to Oracle migration of Enterprise CMS.\n\nSecurity incident investigation.\n\nTrinity Millennium, San Antonio, TX 2007\n\nData Layer Expert\n\nImplemented MS SQL replication for government mainframe re-engineering project.\n\nDesigned and implemented ETL using DTS and SSIS on SQL Server.\n\nA Computer For Me, San Antonio, TX 1998 – 2007; 2008 - 2010\n\nOwner \/ Senior Officer\n\nA sole proprietorship software and hardware company dedicated to serving the requirements of the client. Specializing in secure Linux-based cluster computers for High-availability database, High-performance computational requirements, and\/or Big Data\/Batch processing\n\nClimate data processing system using Hadoop\/EMR using Apache Whirr\n\nInstalled and maintained VMware 3 & 4\n\nInstalled and operated multiple Oracle 10g and 11g RAC and MySQL 5 systems.\n\nDesigned and operated DataCenter for USAF clients including Internet connection and local network, rack space, power, and cooling on a 2 year $275k subcontract\n\nDesigned, procured, built, tested, and administered high availability cluster servers\/high performance computational clusters.\n\nInstalled, stress-tested, and operated client specified software including operating systems (Linux), compilers (Portland Group HP FORTRAN and C\/C++; Intel C++), databases (Oracle w\/RAC, MySQL, Firebird embedded), web servers (Apache, IIF), and parallel processing software (MPI-CH, PVM)\n\nAutomate admin task using Python, Perl and shell scripts.\n\nInstalled, tested and deployed cluster suites with parallel file systems (Luster; Red Hat GFS); message passing software (MPI-CH; PVM); monitoring software (Nagios); schedulers\/queuing software (Maui scheduler; Moab; NQS); visualization systems (RRD).\n\n","date_start":"2011"},{"text":" SP 2\/R2, AD, SharePoint, Exchange) including P to V and direct Virtual.\n\nAutomation of VMware operations using PowerShell\/PowerCLI, including build out, configuration and management\/reporting.\n\nMaintenance of virtual networking at the L2 and L3 layer, VLANs and NIC bonding\/teaming\n\nPKI-E System Administrator - responsible for the procurement and management of Army X.509 certificates for OSs, VMs and Application Servers.\n\nBuild, Provision and Manage HP ProLiant Blade Servers, C7000 Enclosures and P4000 Storage\n\nManagement of Army\/MHS AD forests\n\nNewTek, San Antonio, TX ","organization":"Microsoft","date_start":"2008"},{"text":"\n\nI\/T Systems Analyst\n\nMember of a Client\/Server Architecture Group providing standards and guidelines for client\/server application development, including product recommendations, coding standards, training courses, and other “how-to” products\n\nAnalyzed CORBA for middleware requirements and prevented premature deployment\n\nHelped to implement a “Universal Desktop” client using Visual Basic for interface, ORACLE SNA for mainframe communications, and Forte middleware, increasing CSR productivity by ~20%\n\nPlanned and implemented client\/server acceptance testing using the 215-node CS lab\n\n","organization":"USAA","date_start":"1997-1998"},{"jobtitle":"Administrator","text":" Div. 20 CNWRA\n\nResponsible for the integrity and availability of data and systems for the Division, while providing all Information Systems Security functions from planning through auditing.\n\nImplemented multiple mainframe Information Management Systems using AS, SQL\/DS, REXX, RXSQL, and STAIRS\n\nRe-implemented mainframe systems and implemented new systems using GALAXY, Verity, Oracle, C, C++, PL\/SQL and embedded SQL\n\nOperated a Production\/Test\/Development environment by migrating changes as developed.\n\nWrote and implemented backup and restoration procedures for Division databases\n\nSecured network and hardened computer systems per DoD\/DoE standards and passed all audits\n\nDeveloped full-text search, management, manipulation and reporting system, based on SGMLfor US NRC, one of two criteria for second 5-year, $22M award\n\n","date_start":"1988-1997"}]}