{"skills":[{"Web Technologies":"\n\nHTML, XML, XAML, CSS, JavaScript, SOAP, REST, JSON, AJAX, Angular JS, jQuery, jqGrid\n\n"},{"Database Technologies":"\n\nSQL Server 2012\/2008 R2\/2008, SSIS (SQL Server Integration Services), SQL Server Reporting Services (SSRS), Oracle 9i\/10g\/11g.\n\nIDE\n\n"},{"TECHNICAL SKILLS":"\n\n.NET Technologies\n\nASP.NET, WCF, LINQ, ASP.NET MVC, Entity Framework, Windows Forms, Web API, Web Services, IIS 7.0\/6.0, ADO.NET, NUnit, MSTest\n\n"},{"Programming Languages":"\n\nC# (C Sharp), Java, Junit, Selenium, Selenium WebDriver, Selenium Grid.\n\n"},{"Expertise":" in writing test automation suites using Selenium and Sahi .\n\nProficient troubleshooting skills, committed to achievement, maintenance of quality, excellent communication and interpersonal skills and a very good team player.\n\nInvolved in code reviews, code coverage, debugging and testing.\n\n"},{"Expertise":" in working with source controls like TFS , SVN and GIT .\n\nExpertize in working with Waterfall and Agile software development processes.\n\n"},{"Expertise":" in implementing Object Oriented Programming (OOP) Concepts including Inheritance, Abstraction, Encapsulation and Polymorphism.\n\nStrong understanding of the software development lifecycle (SDLC) and Quality Assurance techniques using source code control repositories, debugging and testing experience.\n\n"},{"Expertise":" in creating web and windows based application using technologies like ASP.NET, AJAX Toolkit, JAVA Script, XML and HTML.\n\nExperienced in XML Web Services (SOAP & WSDL).\n\nProficient in developing .NET applications using Web services like SOAP based and Windows Communication Foundation (WCF).\n\n"},{"Expertise":" in developing applications using .NET 4.5\/4.0\/3.5, C#.Net 3.0\/4.0\/5.0 (C Sharp), ASP.Net, Asp.Net MVC 3.0 & 4.0, ADO.Net, XML, WCF, Web API, Web Services, Entity Framework, HTML, jQuery, jqGrid, JavaScript, XHTML, XAML & CSS.\n\n"}],"summary":[{"PROFESSIONAL SUMMARY":"\n\nOver 5 years of experience, as a software developer, in Functional Specifications, Analysis, Design, Modeling, Development, Deployment, Configuration, Management and Implementation of various intranet, client-server, windows and web enabled applications.\n\nGood experience in full life-cycle development using Object Oriented Programming concepts .\n\n"}],"basics":{"phone":["903-920-7391"],"title":"Developer","email":["chaitanya.polipalli@gmail.com"],"name":{"surname":"Sharp"}},"extracurricular":[{"Extra-Curricular Activities":"\n\nServed as Indian Student Association President (ISA) at University of Texas at Tyler for more than one year,\n\nhttp:\/\/www.uttyler.edu\/sll\/studentorganizations\/isa.php"}],"education_and_training":[{"EDUCATION":"\n\nMaster of Science in Computer Science\n\nThe University of Texas at Tyler - Tyler, TX\n\nAugust 2014 to December 2015\n\nBachelor of Technology in Information Technology\n\nAndhra University - Visakhapatnam, India\n\n"}],"work_experience":[{"text":", TFS, AJAX, JavaScript, JQuery.\n\n","organization":"Sharp","date_start":"2008\/2010"},{"jobtitle":"Father","text":" of Automation Award (Progress Software) - August 2014\n\nAwarded for designing and developing automation scripts from scratch.\n\nFeather in My Cap - June 2012\n\nAwarded for being more innovative among Junior Software developers in the team.\n\n","date_start":"September 2007"},{"Project":": Bluestem Brands\n\nDescription:\n\nBluestem Brands, Inc. owns the Fingerhut.com, Gettington.com and PayCheck Direct brands*, which offer consumers a robust selection of consumer products with shop-at-home convenience, via direct mail catalogs and online shopping.\n\nResponsibilities:\n\nRequirement definition and Analysis, Design, Development of windows application.\n\nDeveloped windows based application to monitor the products available in inventory.\n\nAdmin can add, remove and update any product that is available on gettington.com\/fingerhut.com.\n\nVendors can order products in bulk through this application instead of using gettington.com\/fingerhut.com.\n\nFixed bugs reported by clients and involved Software Design Documentation.\n\nEnvironment: Windows forms, C# (C Sharp), SQL Server, Windows Application, TFS, Bugzilla.\n\n"},{"date_end":"Oct 2013","jobtitle":"Engineer","organization":"Sprint","date_start":"May 2012"},{"date_end":"May 2012","jobtitle":"Engineer","text":" is an insurance company committed in providing insurance products and services to meet needs of individuals.\n\nResponsibilities:\n\nDevelopment was done using C# ASP.NET using 3-tier architecture.\n\nWorked closely with Business Teams and Technical Design Architects to understand the flow and client enhancements to the existing applications along with the QA test.\n\nUsed Master Pages, Datasets, Data table and Data view to retrieve data.\n\nCreated new User Controls for general reusability.\n\nCreated Stored Procedures, Triggers, Views and User Defined Functions for easy data accessibility.\n\nInvolved in Unit testing, Build and integration testing for the interfaces.\n\nEnvironment: .NET Framework 4.0, ASP.NET 3.5\/4.0, ADO.NET, CSS, SQL Server 2008R2, T-SQL, HTML C# (C ","organization":"Liberty Mutual","date_start":"Jun 2011"},{"Project":": Online Resume System\n\nDescription:\n\nThis web application functions in two modules, user and administrator module. Administrators can search the resume, download and save. User can create profile and upload resume.\n\nFeatures:\n\nAdmin can search for resume using different search criteria like name, email id, years of experience, key skills or phone number.\n\nUpon resume search by admin, user can view student contact information, synopsis of resume, education qualifications, brief experience and personal details, etc.\n\nAdmin can download the searched resume.\n\nUsers have to register by providing a unique username, password and security question.\n\nUsers can access their password by answering security questions.\n\nUsers should upload their resume along with contact, education qualifications, work experience and personal details.\n\nResponsibilities:\n\nRequirement definition and Analysis, Design, Development of .Net web application.\n\nDesigned and developed the application from scratch.\n\nDesigned database schema and populated it with data.\n\nDesigned database to accept files in binary format and vice versa.\n\nHandled Validations to every control as per business requirement.\n\nTested the application using selenium as part of automation testing.\n\nEnvironment : ASP.NET, C# (C Sharp), SQL Server, HTML, CSS, ADO.NET, SVN, GIT, Windows, Waterfall, Visual Studio, SQL Server Management Studio.\n\n"},{"date_end":"December 2015","jobtitle":"Developer","date_start":"September 2014"},{"Project":": Rollbase\n\nDescription: Rollbase is a platform as a service (PaaS) software solution. Rollbase platform allows users to create Software as a Service (SaaS) business applications using point and click, drag and drop tools in a standard web browser with minimal programming.\n\nResponsibilities :\n\nUnderstanding business requirement with proper business interaction with managers.\n\nDevelopment of automation tasks as per requirement.\n\nExposed to all stages of Software Development Life-Cycle.\n\nStrong knowledge of Selenium.\n\nBuild Frameworks – helps re-use, reduces automation development & execution effort.\n\nDevelopment of a Driver Script to control all the automation scripts across applications.\n\nFramework is designed to achieve uninterrupted script execution.\n\nProper comments are added for every step explaining its need and for better tracking.\n\nI contributed my organizational skills and my ability to work well in a group and alone.\n\nEnvironment : C#, Visual Studio, SQL Server, MVC, Selenium, Selenium Web Driver, Selenium Grid, Agile "},{"date_end":"Jul 2014","jobtitle":"Software Engineer","date_start":"Oct 2013"},{"Project":": Foreclosure Bids Automation\n\nDescription:\n\nThis web application is used by the Foreclosure bids Automation team to create bidding instructions, appropriate bid type, bidding document and supporting financial calculations for the bid.\n\nFeatures:\n\nThe application allows processors to loads home loans that are eligible for foreclosure from DAISY, LMCA and MWS (Mortgage Web Services) into FCBids application.\n\nAllows users to create, processes and generate bid information depending on multiple criteria.\n\nBidding instructions are generated and pushed to attorneys LPS desktops or emailed.\n\nThe application distributes loan data into various queues and then into respective dashboards for generating bidding information.\n\nBids with error data are populated into QA and Secondary QA dashboards for further processing.\n\nGenerates PDF’s and Excel reports using .Net reporting services.\n\nApplication usage is restricted depending on the role of the user.\n\nResponsibilities:\n\nInvolved in Requirement Analysis and Design of the application using Entity Framework, .NET 4.5, C#.Net 4.0 (C Sharp), ASP.Net, Asp.Net MVC 4.0, ADO.Net, XML, WCF, Web API, Web Services, HTML, jQuery, jqGrid, JavaScript, XHTML & CSS.\n\nOwner and developer of modules that handle Alaska Housing and Veterans Investor Approvals loans.\n\nOwner and developer of “Create Single Bid” module.\n\nDeveloped UI using HTML Helpers, Custom HTML Helpers, CSS 3, JQuery, jqGrid and JavaScript.\n\nCreated partial views and shared templates to reusable over the application.\n\nDesigned and developed views as responsive components using HTML and CSS.\n\nConsumed web services provided by BKFS (Black Knight Financial Services) MSP’s.\n\nDesigned database schema for Alaska Housing and Updated schema for Veterans Investor tables.\n\nDesigned stored procedures to insert data from multiple sources into respective tables.\n\nDesigned, developed and tested additional enhancements and modifications to the application.\n\nInvolved in Unit testing, Integration testing and System testing.\n\nUsed HP Application Life Cycle Management tool for bug tracking.\n\nCo-ordinate several software releases from Dev to SIT to UAT and then to Production.\n\n"},{"jobtitle":"Developer","text":" – Present\n\n","organization":"Wells Fargo","date_start":"March 2016"},{"Project":": FLAD (First Legal Action Date)\n\nDescription:\n\nThis FLAD application performs critical business processes to ensure the First Legal Action date is met or extended per the HUD regulations. The FLAD processes are performed on FHA loans in Pre Foreclosure as well as loans referred to Foreclosure. A daily pipeline report is used to divide work between the Pre-Foreclosure and Foreclosure processors. This report facilitates the daily monitoring activities being performed.\n\nFeatures:\n\nThe first formal action initiating the foreclosure process.\n\nThis process notifies all parties with interest in the property of the default status and WFHM’s (Wells Fargo Home Mortgage Services) intent to foreclosure.\n\nA unique case number is assigned to the all loans that enter this phase.\n\nA set of data load schedule tasks and Autosys jobs (CA Workload Control Center) are scheduled to run every day.\n\nAutosys jobs (CA Workload Control Center) trigger SSIS jobs to load data into FLAD database from BKFS, Internal Main frames and DAISY DB Server.\n\nData from FLAD database is populated into end user application to generate appropriate reports.\n\nResponsibilities:\n\nCreated SSIS packages, which sends the end users and processors data from DAISY and BKFS to FLAD database on daily basis.\n\nMigrated data from multiple Data Sources (BKFS, Internal Mainframe and Daisy) to SQL Server databases using SQL Server Integration Services (SSIS) to overcome transformation constraints.\n\nInvolved creating .dtsx packages using SQL Server Integration Services (SSIS) to extract data from various feeder systems, apply required transformation and finally load the data to the destination databases.\n\nUsed multiple transformations including Fuzzy lookups, Merge, Merge Joins, Conditional Splits, Fuzzy Grouping, Derived Columns, Data Conversion, Union All etc. in order to get the desired output before loading it to destination.\n\nCreated packages in SSIS with error handling as well as created complex SSIS packages using various transformations and tasks like Sequence Containers, Script, For loop, For Each Loop Container, Execute-SQL, Execute Package, Send Mail, File System, Lookup, Row Count, Sort, flat file source and destination, OLE DB source and destination, excel source and destination etc.\n\nResponsible for triggering Email and Logger .dtsx packages when SSIS jobs fail.\n\nScheduled jobs that would run on the less traffic hour using Autosys.\n\nUsed SQL Profiler to estimate the Slow Running queries.\n\nData Access layer is implemented using OLEDB to Communicate with the SQL Server Database to access and update data in the database.\n\nResponsible for Deploying the SSIS packages and scheduling the package through Autosys in all environments including Dev, SIT and UAT.\n\nDevelopment and maintenance of end user web application.\n\nUsed TFS for source &amp; document version control.\n\nEnvironment : ASP.NET, C# (C Sharp), SQL Server, SQL Server Integration Services (SSIS), Autosys, HTML, CSS, ADO.NET, Team Foundation Server (TFS), Windows, AJAX Toolkit, Waterfall, Visual Studio 2015, MSP, Windows Task scheduler, SQL Server Management Studio.\n\n.Net "},{"Experience":" in deployment of applications to SIT and UAT environments.\n\nInvolved in testing and fixing the issues occurred in the testing process.\n\nInvolved in Code reviews. Peer Reviews for developing quality code.\n\n"},{"date_end":"2010\/2008","text":", XCode, Eclipse, SQL Server Management Studio 2012\/2008.\n\nOperating Systems\n\nWindows 10\/8.x\/7\/Vista\/XP, MAC OSX, Unix\n\nVersion Control Tools\n\nTFA, Subversion SVN, GIT, Bitbucket\n\nFrameworks\n\nMicrosoft .NET Framework 4.5\/4.0\/3.5\n\nSoftware Development Process\n\nAgile, Waterfall\n\n\n","organization":"Microsoft","date_start":"2015\/2012"},{"WORK EXPERIENCE":"\n\n.Net "},{"Experience":" using configuration Management Tools such as Team Foundation Server (TFS).\n\n"},{"Experience":" in writing stored procedures, triggers user defined functions and views in T-SQL & PL-SQL.\n\nExpertize in working with Caching, Session State, Cookie Management, view state, POST and GET.\n\n"},{"Experience":" in Single Page Application (SPA) using AngularJS, created Multiple & Nested Views, Routing, Controllers, Services and Custom Directives.\n\n"},{"Experience":" working with databases such as SQL Server 2008\/2008 R2\/2012, Oracle and MS Access .\n\nExtensive experience in ASP.Net, C#, ADO.Net, Web Services, LINQ, AJAX, Windows Services, WCF Services, OOPS, XML, HTML, MS IIS 7.0, JSON, JavaScript, Angular JS, Visual Studio 2008\/2010\/2012\/2015.\n\nPossess extensive knowledge and work experience using LINQ .\n\nProficient in developing Client\/Server Applications on various architectural design patterns including MVC, Two-Tier & Three Tier & N-Tier Architecture for Multi users.\n\n"}]}