{"skills":[{"Technical Skills":"\n\n? C# object-oriented concepts\n\n? HTML, CSS, Bootstrap\n\n? .NET MVC\n\n? Javascript\n\n? JQuery\n\n? SQL\n\n? Visual Studio\n\n? SQL Server\n\n? Test Driven Development\n\n? Unit Testing (NUnit)\n\n? Agile Methodologies\n\n? Atlassian tools: Jira, Crucible, Bitbucket\n\n"}],"basics":{"phone":["(952) 486-9087"],"email":["ChengThao89@gmail.com"],"name":{"surname":"Server"},"url":["https:\/\/github.com\/mathshop","https:\/\/www.linkedin.com\/in\/chengthao"]},"education_and_training":[{"Education":"\n\nMinnesota State University, Mankato, MN Bachelor of Science in Biotechnology\n\nMay 2013\n\nRelevant Coursework\n\n? Intro to Computer Science I (C++)\n\n? Intro to Computer Science II (C++)\n\n? Intro To EE\/CE\n\n? Calculus I, II\n\n? Linear Algebra\n\n? Computer Science Seminar\n"}],"work_experience":[{"date_end":"Aug. 2013","text":", Edina, MN Nov. 2005 – Aug. 2007 Senior Sales Associate\n\n","organization":"Best Buy","date_start":"Dec. 2012"},{"Professional Experience":"\n\nThe Software Guild, Minneapolis, MN July 2016 – Present C# .Net Apprentice\n\n? Created applications using C# fundamentals, test driven development, class modeling, and data layering\n\n? Used agile development methodologies along with Jira, Crucibles, and sprint for workflow management and version control\n\n? Ensured robust applications using client and server side validation\n\n? Programmed web applications to display data using ASP.NET MVC, Serialization, and SQL Server\n\n? Exposed to Single Page Applications using Javascript, JQuery, and AJAX\n\n? Performed daily scrum, presentations on code reviews, and technology talks\n\n? Created test driven development and performed validation for console applications using NUnit for unit testing\n\n? Checked in code, created issues, and fixed bugs while committing code using Git to appropriate keys in Jira\n\n? Designed projects using wire-frame, user-stories, and iterative development Lifecore Biomedical, LLC, Chaska, MN\n\n"},{"date_end":"Sept.2016","jobtitle":"representative","text":" for the Quality Control Department for IT requirements and\n\nimprovements\n\n? Wrote reports and executed software validation protocols for new installations, updates, and changes\n\n? Wrote notifications, microbial identifications, training reviews, and contamination excursions for any above alert or OOT\/OOS\/OOC limits\n\n? Conducted validation and testing for software systems (IQOQPQ)\n\n? Managed hardware installations, maintenance, and software updates within the Quality Control Department\n\n? Monitored environmental, personnel and non-viable of ISO 5-8 cleanrooms to meet regulatory compliance such FDA, cGMP, and ISO regulations\n\n? Performed redline revisions, computer change requests, and change orders for existing documents that require updates to meet Code of Federal Regulations on Electronic Records\n\n? Responsible for write up of notifications, microbial identification, training review and trending of contamination excursions using SQL in our database management system\n\n? Performed various microbiological test and reviewed tests performed by peers for raw materials, in-process, and final product samples to ensure quality results\n\nCargill, Excelsior, MN Research Scientist –Fermentation\n\nMar. 2014 – Sept. 2014\n\n? Performed strain characterization using shake flasks and bench scale fermentors\n\n? Optimized media components, experimental parameters and seed inoculum through fermentation experiments\n\n? Managed and operated over eight fermentors\n\n? Prepared batch and media components such as feed, salts, vitamins, and trace elements\n\n? Used various microbiological techniques and instrumentations for fermentation analysis\n\nLand O’Lakes, Arden Hills, MN Nov. 2013 Mar. 2014 Microbiology Test Technician\n\n? Prepared and performed routine microbiology analysis for the detection of pathogens for clients\n\n? Responsible for creating routine batches in LIMS for sample preparation and transfers\/read\n\nMinnesota Valley Testing Laboratories, New Ulm, MN ","date_start":"Sept. 2014"}]}