{"skills":[{"Web Languages":"  - Javascript, HTML, AJAX, XML, CSS, ASP.Net \/ ADO.Net – 8 years\n\n \n\nCurrent in WCF(Windows Communication Foundation), WWF (Windows Workflow Foundation), TFS (Team Foundation Server), WPF (Windows Presentation Foundation).\n\n \n\n"},{"Programming Languages":" -  C# - 8 years, VB & VB.Net – 12 years , Transact SQL - 15 years,\n\n"}],"summary":[{"TECHNICAL SUMMARY":"\n\n \n\nApplication Design  – Multi-tier, multi-user Windows applications and  .Net Web applications using Ajax, XML, JSON Serialization, HTML, DHTML, CSS, JavaScript and latest code generation tools.  All coding and design uses Microsoft best practices, Microsoft Application Blocks and C# Design Patterns whenever possible.\n\n \n\nSQL Server -  Certified in Relational Database Design and Implementation (SQL Server 2005, 2012). Data ETL (Extraction Transformation and Loading) via SSIS (Integration Services) and DTS packages (SQL Server 2000).  Author, Manage and Publish Reports in SSRS (Reporting Services). Database Optimization via Query and Index Tuning.  Identify and Resolve Deadlock and Blocking Bottlenecks.  Certified in SQL Server 2005, 2012.  Implemented table value parameters, sequential processing without cursors.\n\n \n\n"},{"PROFESSIONAL SUMMARY":"  \n\nOver 15 years of progressive programming experience using Microsoft development tools and SQL Server,\n\nRecent experience mostly using C#. Current through 4.0 Framework, familiar with 4.5 Framework.\n\nImplemented full SDLC (Software Development Life Cycle) using both Agile and Waterfall methodologies. \n\nDesigned software communication with the WCF Service Model. Current using Service Configuration Editor for defining endpoint addresses, bindings and contracts. "}],"basics":{"phone":["(925) 381-0974"],"title":"Application Developer","email":["mkayfez@yahoo.com"],"name":{"surname":"KAYFEZ","firstName":"MICHAEL"},"gender":"male"},"education_and_training":[{"EDUCATION":"\n\nChapman University 1997, Fairfield, Ca.\n\nBachelor of Science ~ Computer Information Systems\n\n10\n"},{"MICROSOFT CERTIFICATIONS":"\n\n \n\n.Net Microsoft Certified Application Developer (MCAD) Current Certifications\n\nDeveloping Web Apps with Visual Basic .Net.\n\nDeveloping XML Web Services and Server Components with Visual Basic .Net\n\nDesigning and Implementing Databases with SQL Server "}],"work_experience":[{"Project":"\n\nDesign and implement a regional\/national web based attorney directory and administrative tools using  ASP.Net  with C# as code behind forms.  \n\nTeam Lead\n\nETL from Access into SQL Server from internet screen scrape via DTS.\n\nAttorney information was provided via a Datagrid.  Stored procedures provide the data access through SQL Data Adapters.\n\nThe web forms were designed to provide advertising space.  Advertising impressions were weighted via stored procedures.\n\nThe database was implemented with a SQL Server 2000 database and uses stored procedures for all data access.\n\nMS Office integration was implemented using VBA.\n\nMoved to Area September 2005 – September 2006\n\nI took some time off while I was selling my home in Las Vegas, buying a home in Walnut Creek and getting moved in.\n\nEastridge InfoTech (Contract) April 2005 – September 2005\n\nAccess\/SQL Server Integration\n\nSQL Server Optimization\n\n"},{"Project":"\n\n:   Support and enhance existing mission critical VB6 application. This application had a SQL Server 2000 backend\n\nETL data into SQL Server from disparate data sources, including .csv, Access and Excel.\n\nPrimary function was to provide support through TSQL scripts.  These scripts were processed by company DBA's in the production environment.\n\nDB Specialists (Employee) September 2006 – May 2007\n\n Web Based Attorney Directory\n\n"},{"Project":": Custom application (iTrack) designed to manage core mortgage lending business data and business rules.\n\nFour tier .Net C# Windows Forms with SQL Server backend.\n\n.Net Web Development\n\n"},{"Project":": Add functionality and performance to and existing application that used Microsoft Access forms as the user interface to a SQL Server database. Optimum data transfer was accomplished by using MS Access pass through queries.\n\nThe SQL Server database was tuned according to the queries the interface provided the users.\n\nQueried fields were indexed individually or as composite keys. Query plans were analyzed to provide optimum performance.\n\nUSA Capital April 2004 – April 2005\n\n.Net Windows Development\n\n"},{"Project":": .Net Component Development\n\nC# Serviced Component to implement the Authorize.Net Advanced Integration Method credit card payments.\n\n"},{"Project":": Contact Management Web Application for VegasHotSpots.com\n\nCoded in C# with some Infragistic controls and SQL Server backend.\n\nTravelWorm Inc. (Employee) February 2004 – April 2004\n\n"},{"Project":": LTL Freight & Equipment Management Application\n\nSenior Visual Basic\/SQL Server developer - on multi-tier logistics program. This large enterprise application consists of multiple SQL Server 7.0 databases. Data Transformation Services (DTS), Transactional Replication, stored procedures and triggers were used. Client was written in Visual Basic 6.0 Enterprise.\n\n"},{"Project":": SQL Server development\n\nDeveloped OLAP Customer Data Mart.\n\nAuditing existing reports using Transact SQL and Stored Procedures.\n\nVectura Systems Integrators (Employee) April 2001 – April 2003\n\n.Net Web Development\n\nCustomer Web access to Warehouse Management program.\n\nDesigned and built with .Net using C#.\n\nASP.Net and ADO.Net\n\nSQL Server 7.0 database.\n\nStored Procedures and triggers were used.\n\n(2 Moderately complex applications)\n\n"},{"Project":"\n\n:  Design and build a web interface to eBay Motors that would offer loans, leases and warranties for eBay items.  The interface must have the look and feel of eBay, with integration and consumption of third party API's and  WCF services. (.Net Framework 3.5)\n\nFour-Tier Web Interface (Application, Business Logic Layer, Data Access Layer, Database) was built in Visual Studio 2008, using custom web controls, AJAX and WCF Services hosted in an IIS application domain.\n\nC# was used in code behind.\n\nLogging used batch XML to update the database on close of user Session. \n\nStyling used Cascading Style Sheets.\n\nETL , Data storage and searching via SQL Server 2005, using stored procedures, triggers, and SSIS.\n\nExcel integration done with VBA.\n\nReporting with Crystal Reports.\n\n "},{"Project":":   Normalize DoD database for use in Afghanistan Defense Integration.\n\nModify a SQL Server database from first normal to third normal form.\n\nPrepare constraints, indexes based on entity relationships and reporting needs.\n\nDesign ETL (Extract, Transform and Load) procedure to import existing data into new schema.\n\n  \n\nEBay Motors (Contract) October 2008 – February 2009\n\nEBay Web Interface and SQL Server Development \n\n \n\n"},{"Project":"\n\n:  Increase speed in existing MAX Finance SQL Server Databases\n\nDecreased page waits by moving transaction logs to separate physical drive.\n\nRan traces which identified long running queries. \n\nCreated indexes, updated statistics and modified some stored procedures to improve performance.\n\nEVault (Employee) "},{"Project":"\n\n:  Identify cause of deadlocks in existing MAX Finance SQL Server Databases\n\nIdentified deadlock types and causes with deadlock specific traces. \n\nResolved deadlocks with shorter transactions and concurrent processing.\n\nModified TSQL to include CTE (Common Table Expressions) for optimization and clarity.\n\n"},{"Project":"\n\n:  Rewrite Existing ProMail for Exchange "},{"date_end":"October 2008","jobtitle":"Developer","date_start":"September 2007"},{"Project":"\n\n:  Add new functionality to existing Product Order Portal.\n\nC# Web application using .Net 3.5 Framework with Windows Workflow Foundation.\n\nCreated new classes for additional functionality, modified existing workflows, created new WCF Services, modified existing ASP.Net web services, web user controls and javascript functions.\n\nModified existing SSRS Reports.\n\nFour Tier design.\n\nPMI   (Contract) May 2007 – August 2007\n\nDatabase Development and Proprietary Software Support\n\n"},{"jobtitle":"Team Lead","text":".\n\nMS Build Automated Deployment.\n\nExisting application used Exchange Server web services and was not Exchange 2003 compatible.\n\nDesign included a Multi-tier Windows client and Web based client for Exchange Administration and User Search capability.\n\nObject models used included were CDO, CDOWF (CDO for workflow), EMO, ADSI, and WEBDAV.\n\n","date_start":"2007"},{"Project":": Mental Health Management System- 20 Concurrent users. Access 97 GUI and Report Generator. SQL Server 6.5 Backend. N-tier. DAO Data access.\n\n"},{"Project":": Health Plan Provider Credentialing System- 25 Concurrent Users. Visual Basic 6.0 GUI and Report Generator. SQL Server 7.0 Backend. N-tier. ADO Data access. VBA MS Office integration, 120 table relational database design.\n\n"},{"Project":": Healthcare for the Homeless Management System - 7 Concurrent Users. Visual Basic 6.0 GUI with Access 97 data storage. This system used laptops in the field and updated through replication with a master Access database. 2 tier. ADO Data Access. Access 97 Replication\n\n"},{"Project":": Target Case Management System- 1 User. Access 97 for GUI and database. DAO data access, VBA (Visual Basic for Applications) code behind the forms.\n\n"},{"Project":": Basic Adult Care Management System - 30 Concurrent Users. Access 97 GUI and Report Generator. SQL Server 7.0 Backend. DAO Data Access.\n\n"},{"Project":": Clarion Data conversions - Extracted and converted data from Clarion database systems for transfer to SQL Server or Access databases.\n\nSQL Server Expertise\n\nModeling - Designed all relational models for applications using first through third as well as Boyce-Cobb normal form.\n\nSSIS (SQL Server Integration Services -DTS (Data Transformation Services) - Created scheduled DTS packages via interface and custom scripting. Multiple packages were run sequence and scheduled to run at varying times via Windows Scheduler and via code.\n\nSSRS (SQL Server Reporting Services) – Authored, Managed and Published reports of varying complexity.\n\nStored Procedures\/triggers - Wrote new stored procedures and triggers for new applications as well as optimized Transact SQL in existing applications. Tuning tools included SQL Server Profiler and SQL Server Analyzer.\n\nOLAP and OLTP -Implemented data warehouse structural change from snowflake to star configuration to enhance reporting performance. Performed performance tuning and optimization of production application databases.\n\n"},{"date_end":"March 2001","text":"\n\nThird-Party API Integration and Process Design\n\nDesigned and implemented applications that processed large text files through a third party geo-coding API.\n\nDe-engineered existing applications and analyzed processes for correctness and optimization.\n\nUpdated RDO data access to ADO and migrating Visual Basic dynamic SQL to SQL Server 7.0 stored procedures.\n\n","organization":"Pacific Bell","date_start":"November 2000"},{"Project":": GIS System\n\nSenior Design Developer - Using a third party geocoding API, an object oriented program was designed that used the File Scripting Object for file access and a class that managed individual record processing. A large text file was opened, each fixed field record was appropriately parsed and fed into the API. The API return values were concatenated per requirements to construct a geocode that PacBell used to determine high cost phone lines. Throughout the process, logs were updated and VBA was used to construct Excel spreadsheets. This application processed 10,000 records per minute.\n\n"},{"Project":": DBUpdate\n\nDepending on the type of geocoding (there were four types) a SQL Server database was updated to reflect the new type and effective date.\n\nThe old program was modified by replacing RDO with ADO and moving the SQL into a stored procedure.\n\n"},{"Project":": DBReport\n\nPer specifications, this program created Public Utility Commission reports from a SQL Server 7.0 database in Excel via Visual Basic for Applications (VBA).\n\nContra Costa County Health Services (Contract) March 1998 – October 2000\n\nWeb Applications\n\nDesigned and programmed internet and intranet web applications for the Contra Costa County Health Services Department.\n\nThese applications were built using InterDev.\n\nClient side validation using Javascript.\n\nVB COM components were packaged on Microsoft Transaction Server.\n\nADO 2.1\/2.5 for data access. The components were called from ASP pages.\n\n"},{"Project":": County Internal Phone System- Allowed users to search for county employees. Managers, via password control, updated information in their departments.\n\n"},{"Project":": Mental Health Provider System - Web access to Mental Health providers, office hours, availability.\n\n"},{"Project":": Homeless Client System - Web access to Homeless Client data.\n\n"},{"Project":": Health Plan Provider System - Web Access to Contra Costa Health Plan providers, plans, office hours, locations.\n\nClient Server Applications\n\nDesigned, implemented and managed client-server applications for the Contra Costa County Health Services Department.\n\nThe GUIs were built using Visual Basic or Microsoft Access.\n\nMost applications were three tier and used VB COM components on MTS.\n\nADO and DAO as data access. Databases were SQL Server 7.0 or Access 97. All SQL Server data accessed via Transact SQL stored procedures.\n\n"},{"Project":" :  TSMS Bus Stop Management System\n\nConvert an existing MSAccess application to a web based application.\n\nIncrease functionality, re-design application to more closely follow real time workflow.\n\nCreate C# reporting portal to display SSRS reports.\n\nBring database to 3rd normal form and produce separate website to administrate the main application.\n\nIncorporate mobile uploading functionality and mapping into application.\n\n \n\nPacific Pulmonary Services (Contract)   August 2015 – Oct. 2015\n\n.Net C#, SQL Server 2008r2\n\n"},{"EXPERIENCE":"\n\nRegional Transportation Commission (Contract) February 2016 – present\n\n.Net C#, SQL Server 2012\n\n"},{"jobtitle":"Administrator","text":".\n\n  ","date_start":"2010"},{"text":" Certification in Relational Design)\n\nStored Procedures and Triggers\n\nQuery optimization and index tuning.\n\nSQL Server Admin skills include SSRS, SSIS, Analysis Services installation.\n\nScheduling backups, restoring databases via restore or attachment\n\nDeadlock and Blocking Resolution\n\nCertified Team Foundation Server ","organization":"Microsoft","date_start":"2012"},{"EXPERIENCE":" (Cont)\n\n"},{"date_end":"November 2013","text":"\n\nC#, VB.Net\n\n","organization":"Loral","date_start":"July 2013"},{"Project":" :  Migrate data from ten year old application to new version.\n\nDesign and implement custom SSRS report portal using C# and SQL Server Reporting Service component.\n\nIntegrated reporting portal into existing .asp web application\n\nEncapsulated scattered migration sql and processes into SSIS project.\n\nProvided additional TSQL programming for ETL to new application.\n\n \n\nSpace System "},{"Project":" :  Enhancements to Social Networking\/Streaming Video Website\n\nImplemented and extended website database in SQL Server 2008r2.\n\nUsing IronSpeed, designed and prototyped the UI for stakeholders demo.\n\nFurther Modified Outlook Web App calendar for posting to the network.\n\n \n\nBrayton\/Purcell LLC        February 2014 - October 2014\n\nC#, SQL Server, Web Application, Database Migration (ETL) (Employee)  \n\n"},{"Project":" :  Compliance Application ICD-9 to ICD-10\n\nImplemented and extended website database to be inclusive of ICD9 and ICD10 diagnosis codes.\n\nModified User Interface to display new ICD10 codes wherever needed.\n\n \n\nDB Specialists (Contract)   Nov 2014 – July 2015\n\n.Net C#, SQL Server 2008r2\n\n"},{"text":" SQL Server 2012 Databases\n\n  ","organization":"Microsoft","date_start":"2012"},{"jobtitle":"Developer","text":" SQL Server ","organization":"Microsoft","date_start":"2005"},{"Experience":" hosting WCF services on IIS 6 and IIS 7.\n\nWorked extensively with SQL Server from version 4.2 through Enterprise 2008r2.\n\nIn process of being certified with SQL Server "},{"Project":" :  Re-write existing Access and Foxpro applications in Microsoft VB.Net with SQL Server backend.\n\nExtensive documentation by Business Analysts for functional requirements and  developers provided the technical requirement documentation.\n\nPort existing application into a web portal with social networking user experience.\n\nMy piece was Project Management and the design was a four tier web application implementing an AJAX enabled dot net interface, Business Logic Layer, Data Access Layer and SQL Server.\n\nIncorporate Microsoft Office components including Excel and Word using Office 14 object model and VBA (Visual Basic for Applications)\n\n \n\nDB Specialists (Employee)       November 2009 – December 2010 \n\nC#, VBA, Win32 API, Exchange Server \n\n"},{"Project":" :  Modify Outlook Web Access forms for new web application.\n\nUsed Exchange Server .Net SDK in place of Exchange SOAP calls.\n\nMicrosoft Membership model for logon control\n\nMicrosoft Enterprise Application Blocks (Data, Logging)\n\nWCF Services used for resource access.\n\n \n\n      "},{"Project":" :  Team to re-write existing VB6 Hospitality Application from Windows Forms to Web Application.\n\nImplemented SQL Server 2008 new feature of \"table value\" parameters in all Update\/Insert procedures.\n\nUpdated legacy code written in Visual Basic and VBA (Visual Basic for Applications)\n\nIntroduced Telerik controls as a time saving process.\n\nNo documentation other than the source code from the current application available.  Some information was available from long term employees.\n\nHead office decided to close the offices effective 2\/24\/2012.  Other developers chose to work from home.  I chose to find a new company. \n\n \n\n"},{"date_end":"April 2011","text":" \n\nC#, SQL Server, Web Application  (Contract) \n\n","organization":"PG&E","date_start":"December 2010"},{"Project":" :  Develop .Net web interface to allow users to customize Flash template websites.\n\nModify Flash template to read XML file and assign values to Flash parameters.\n\nDesign SQL Server stored procedures to produce XML datasets.\n\nDesign secure web interface using Microsoft Membership model to provide users access to editable fields in\n\n.Net C#, SQL Server Development\n\n     \n\n"},{"Project":" :  Design and Implement .Net C# Web Interface for Department of Defense\n\nImplement four-tier website based on SQL Server Database.  The Data Access Layer used Microsoft Application Blocks for Data Access and all tiers used the Logging Application block.   All data access was through stored procedures.  CRUD procedures, the Business Logic Layer (BLL) and the DAL were produced using automation tools and custom scripts.\n\nSite data access optimization included transporting multiple DataTables in every DataSet.  The DataTables were Cached and then applied as DataSources to various User Controls.\n\nThird party Telerik controls were used.  All AJAX calls were implemented through Telerik's interfaces.\n\nStyling used CSS and Telerik skins.\n\nRequirements included role based membership. The Microsoft Membership model was used to implement this requirement.\n\nAn industry standard Facilities Management module was also designed and integrated.\n\n \n\n"},{"Project":" :  Implement calling WCF Services from Outlook Client using VBA.\n\nOutlook Client accessed WCF Services using MEX moniker.\n\n      \n\n"},{"Project":" :  Design custom control for notification of user search in Outlook Client.\n\nOutlook search does not provide developer access to any events.\n\nUsed Win32 API to capture and raise event when user starts search.\n\nInterface and middle tier modifications were done with VBA (Visual Basic for Applications)\n\n \n\n       "},{"Project":" :  Hospital Visitor Management Application\n\nDesigned and implemented core patient location process as stored procedure\n\nHL7 Messages were read, weighted and location was generated for UI.\n\nMessages were sequentially read without using cursor and speed was maintained by using table value parameters and parallelism.\n\n \n\nDB Specialists (Contract)   July 2012 – Jan 2013\n\n.Net C#, SQL Server 2008\n\n"},{"Project":" :  Social Networking\/Streaming Video Website\n\nDesigned and Implemented database in SQL Server 2008r2.\n\nPrototyped User Interface for stakeholders buy-in\n\nModified Outlook Web App for presentation layer per prototype feedback.\n\nOutlook Client was modified to call WCF Services using VBA (Visual Basic for Applications)\n\n \n\n \n\nCEB (Continuing Education for the Bar) (Contract)   March 2012- July 2012\n\nSQL Server, MS Access, VBA\n\n"},{"Project":" :  Communication Satellite Antenna Application\n\nConvert existing application from VB.Net to C#. (10,000 lines)\n\nImplement complex algorithms necessary for data extraction and to provide data visualization.\n\n \n\n"},{"date_end":"April 2013","text":"\n\nSQL Server 2008r2\n\n","organization":"Quantum","date_start":"Jan 2013"},{"Project":" included adding programmatic dsn-less connections to multiple databases\n\nDesigning consolidation of existing functionality to meet functional requirements\n\nProvided after the fact functional requirements documentation.\n\nMS Access coding done in VBA (Visual Basic for Applications)\n\n"},{"Project":" :  Design new database in SQL Server 2008r2 to replace existing SQL Server 2000 design.\n\nUsed SQL Server 2008r2 new features such as table value parameters in the stored procedures.\n\nReplaced existing de-normalized schema with new structure normalized to third normal form.\n\n \n\nAgilysys         May 2011 - February 2012\n\nC#, SQL Server, Web Application, Silverlight  (Employee)  \n\n"},{"Project":" :  Write complex stored procedures that interfaced with a Mass Mail program called Campaign.\n\nWorked one month, more or less on this.  Followed existing templates for past Campaign projects.\n\n"},{"Project":" :  Add functionality to an existing, dual audience facing Access applications front end(s).\n\n"}]}