{"skills":[{"Technologies":": Proficiently utilised C#, ASP.NET MVC 4, JavaScript, JQuery, CSS, AJAX, MySQL, SQL Server 2008 R2, Solr, Lucene, Java, WCF, Web API 2, DropWizard, SSRS, SSIS, TDD, Jira, Agile\n\nNyc Board of Education, New York, NY Nov 2012 – Sep 2013\n\nOperates the public schools in New York City.\n\n.NET Lead Developer (Contractor)\n\nFunctioned as Lead Developer for the building a SESIS (Special Education Student Information System), a secure web-based system for managing special education cases and information, examining requirements, designing, and developing code for all application tiers. Facilitated 15,000+ users in 1,800+ schools, interacting with user community to gather and prepare specifications, applying coding, and supervising quality assurance and release management.\n\nNotable Contributions:\n\nExamined, assessed, and defined requirements, as well as delivered technical solutions for complex multi-faced system, involving prioritization, evaluations, workflow, and availability and student placement.\n\nApplied Business Intelligence (BI) solutions to assimilate SESIS with legacy systems which included database, mainframe, warehousing systems using\n\n"},{"Technologies":": C#, ASP.NET MVC, JQuery, SQL Server 2008 R2, WCF, SSRS, SSIS, TFS, Agile, Scrum, Oracle 11g\n\nVivaro Corporation, New York, NY July 2009 – Oct 2012\n\nProvides Telecommunications and Financial Services products to the Hispanic community.\n\nLead .NET Developer\n\nEstablished, planned, and confirmed innovative business software for anti-money laundering and smartphones. Attended as significant decision maker related to design architecture, generated and implemented unit tests and basic systems testing. Contributed in the investigation, development, and accomplishment of a domestic and international real time business by grossing $400MM per annum.\n\nNotable Contributions:\n\nControlled over progress, and execution of an innovative money transfer software for point of sale terminals (POS), by allocating domestic and international storefront business and grossing $400MM annually.\n\nLed Direct Store Distribution and CRM system permitting sales team to develop orders for calling card products onsite, coordinating with financial, reporting, calling card platform, and creating $7MM weekly.\n\n"},{"Technologies":": C#, ASP.NET, JavaScript, SQL Server 2008 R2, SSAS, SSRS, SSIS, Agile, Scrum, Oracle 11g, .Net Compact Framework, WinForms, AJAX, JPos, WCF\n\nContinuing Education Services, Inc., West Hempstead, NY June 2008 – June 2009\n\nOnline and multi-media education provider.\n\nSenior .Net Developer \/ Team Lead (Contractor)\n\nActed as a Team Lead performed various functions related to online and multimedia, established proprietary business platform, evaluated business requirements, authored specifications, generated prototypes, considered SQL Server database and C# library by operating multitier architecture. Produced ASP.NET B2B and BTC e-commerce websites to sell online educational courses, implement multi-media streaming, administrative tools, content management, shopping carts and credit card processing. Collaborated with marketing team on planning user friendly website.\n\nNotable Contributions:\n\nIncorporated SEO tools that led to a 25% improve in web traffic from search engines and referring sites.\n\nCreated CRM software solutions for sales representatives by permitting sales representatives to initiate and track sales and developing C#, ASP.NET and AJAX.\n\nCalculated cost-saving measures through automating and streamlined processes by decreasing staff by 20%.\n\nNaf Funding, New York, NY "},{"Languages & Technologies":"\n\n.NET Framework 4.6\/1.1\/2.0\/3.5 | ASP.NET MVC 5 | C# | WEB API 2 | ADO.NET | LINQ | WinForms | Compact Framework | SQL | PL\/SQL | T-SQL | Visual Basic 6 | JavaScript | AngularJS | JQuery | AJAX | RESTful Web Services | SOAP | ASP | XML | XLIFF | JSON | OOP\/OOD | CSLA | Multi-Threading | HTML | CSS | Delphi ColdFusion | RestFB | Lucene | Solr | SolrNet | Dropwizard | Java | ORM | Entity Framework | Bootstrap | Responsive Web Design"},{"Areas of Expertise":"\n\nTechnical Documentation\n\nWeb Services\n\nQuality Assurance & Control\n\nStrategic Planning & Analysis\n\nTroubleshooting\/Maintenance\n\nTechnical Support\n\n"},{"Technical Skills":"\n\nDatabases: Oracle 11g\/10g\/9i | SQL Server 2014\/2012\/2008 R2\/2005 | SSAS | SSIS | MySQL | Stored Procedures Packages | Triggers | Indexes | SQL | Queries | Visual Studio 2015\/2005\/2008\/2010\/2012 | TFS | SVN | Github | Perforce | SSRS & Crystal Reports | JIRA | Agile | Scrum | Confluence\n\n"},{"Technologies":": C#, SQL Server 2016, ASP.NET MVC 5, Entity Framework 6, Web Services, WEB API 2, SQL Server 2016, JavaScript, JQuery, AJAX, CSS3, HTML5, Bootstrap, TeamCity, Jira, Agile, Scrum, Perforce, NUnit, TDD, T-SQL, RWD\n\nMedmeme, New York, NY Aug 2015 – June 2016\n\nMaintains the world’s largest and most up-to-date data warehouse of disseminated medical science information.\n\nSenior .Net Developer\n\nDirected the architecture and implementation of two SaaS applications, such as Insightmeme and ProfileMeme, utilized by 18 of the largest 25 pharmaceutical companies for global R&D, sales, and marketing purposes. Insightmeme allowed users to create highly complex, customized searches of all medical data and developed relevant alerts associated with the continuously updated data. ProfileMeme endorsed users to track profiles of scientists and research organizations by furnishing details including profile pictures and respective contributions related to the number of grants, patents, publications, and clinical trials.\n\nNotable Contributions:\n\nInstituted and led the development of applications by assembling the business requirements while documenting and cooperating expansively with the quality assurance team throughout the testing phase.\n\nAuthored ETL process of collecting data from numerous sources to central location for processing currently implemented to process approximately 250,000 new medical data per day.\n\nDesigned and developed a maintenance application utilized by a team of over 300 users to interact with the author and analyze the accuracy and efficiency of the disambiguation algorithm.\n\n"},{"Technologies":": Utilized C#, ASP.NET MVC 5, Web API 2, AngularJS, JavaScript, JQuery, CSS3, HTML5, SQL Server 2014, Solr, SolrNet, Oracle 11g, SSIS, SSRS, Bootsrap, RWD, Git, Jenkins, Jira, Agile\n\nHigh 5 Games, New York, NY "}],"basics":{"phone":["718-801-1705","718-801-1705","718-801-1705"],"title":"Web Developer","email":["DavidA.Maslow@gmail.com","DavidA.Maslow@gmail.com","DavidA.Maslow@gmail.com"],"name":{"surname":"Maslow","firstName":"David"},"gender":"male","url":["https:\/\/www.linkedin.com\/in\/davidmaslow"]},"education_and_training":[{"Education":"\n\nNY Computer Science Associate Degree | Cope Institute New York\n\n"}],"work_experience":[{"date_end":"May 2008","jobtitle":"Developer","text":" (Contractor)\n\nGenerated comprehensive Crystal reporting suite, and ran reports on business performance, forecasting, accounting and P&L analysis alongside automated report processing and notifications applying .NET technology.\n\nNotable Contributions:\n\nDesigned SQL Server database, and created executive dashboards employing C# and ASP.NET technologies.\n\nIdt Corporation, Newark, NJ Feb 1999 – June 2007\n\nProvides U.S. long distance telephony, prepaid calling cards, web design\/hosting, brochure display, and roadside assistance services.\n\nTeam Lead\/ Senior Analyst\/ Developer\n\nExecuted the development of mission critical software and updates, within the financial, logistics and telecom sector. Analyzed business requirements and implemented cost savings through effective streamlining, database creation, system maintenance, and management processes and ultimately saving $50MM annually. Developed GPS Customer Service application utilized to discover nearest available Tow Truck Company, and expedited Customer Service to identify customer and a list of nearest potential tow truck companies, while assisting dispatch for the best matches.\n\nNotable Contributions:\n\nDesigned and instigated systems in Delphi, including a real-time credit card processing system interfacing with companywide credit card platforms and devised a system determined the most profitable method for routing calls.\n\nHandled several major migrations, including migrating the wholesale telecom business from SQL Server to Oracle database, and directing the conversion of Access files to Oracle platform, designing and integrating the database.\n\nAutomated a $25MM process by developing a calling card monitoring system in VB 6.0 tracking cards distribution.\n\n","date_start":"June 2007"},{"Project":" Management\n\nSoftware Architect\n\nSoftware Development\n\nDatabase Management\n\nWebsite Development\n\nMobile Development\n\nSocial Gaming Software\n\nBusiness & IT Leadership\n\nJavaScript\/JQuery\/AJAX\n\n\n"},{"Professional Experience":"\n\nBroadridge "},{"jobtitle":"Developer","text":" (Contractor)\n\nDeveloped all the functions associated with web app including portals supporting financial trades, along with involving troubleshooting all relevant portals expertly determine and investigate failures occurring in the processing of multiple transition transactions, files, clients, accounts, security, and incomes each possessing particular portal.\n\nNotable Contributions:\n\nDeveloped a research portal with in-built UI facility to streamline the research process of trading transactions which included: holding periods, income, file processing, client info and security info in order to facilitate the users to research the troubleshooting’s or taxes’ supporting transactions like files, client and security information.\n\nCreated and established a Notification Portal as the apps internal notification system implemented for both internal user communications for troubleshooting also, internal application notifications.\n\n","date_start":"July 2016"},{"date_end":"Aug 2015","jobtitle":"Premier","text":" game creator in the casino industry and owns the highest-rated social casino on Facebook.\n\nSoftware Engineer – Senior Developer\n\nCreated and instigated games and supported tools for the casino industry as senior staff within a team of twenty members. Overhauled large, diverse market with 1.3+ monthly users on Facebook and 500,000 active daily users. Led the proper evaluation of all the business requirements and systems, produced business support and maintenance tools to improve customer service and support more than 3 million users.\n\nNotable Contributions:\n\nProduced and initiated translation and content management system for online social gaming platform.\n\nRestructured reporting, forecasting, profit and loss (P&L), and revenue processes by forming and maintaining a system that integrate with Facebook, Apple, and GooglePlay.\n\nPlanned, built, and tested debugging tool for online gaming platform, while implementing quick expansion and debugging for Facebook, Web, and Mobile clients in JavaFX.\n\n","date_start":"Sep 2013"}]}