{"skills":[{"Technologies":": .NET framework, C#, VB\/VB.NET, classic ASP, ADO, MS SQL Server, Crystal Reports, SAP BAPI\/RFC, SAP Internet Transaction Server (ITS), SAP Employee Self Service (ESS)\n\n"},{"Technologies":": VB, Java, classic ASP, ADO, MS SQL Server, Crystal Reports, SAP BAPI\/RFC, SAP Employee Self Service (ESS)\n\nIndependent SAP "},{"Technologies":": ASP.NET MVC, StructureMap, PostSharp, Log4Net, NUnit, RhinoMock, mSpec, TeamCity, VisualParadigm UML, Fit\/Fitnesse, Betas, MyGeneration, C#, LINQ, SQL Server "},{"Technologies":": C#, ASP.NET, Winforms, ADO.Net, Team Foundation Server (TFS), MS SQL Server 2005, LinqToSQL, CSLA.NET, CodeSmith, Reporting Services (SSRS\/SSIS), web services, AJAX\n\nIndependent "},{"Technologies":": C#, ASP.NET MVC, Microsoft Cloud\/Azure, Lightspeed\/ORM, LINQ, WebAPI\/WCF, SQL Server, StructureMap, NUnit\n\nSolutions Architect, PayFirst Solutions, Philadelphia, PA (June 2011 to July 2013)\n\nArchitect, build, and deploy secure commercial solutions for core Point of Sales (POS) application. PayFirst POS is a commercial grade desktop Point of Sales application designed for several markets including the restaurant, retail and salon industries. Design and develop alternative mobile POS solutions to enhance the effectiveness of the POS application. Design and develop value added online services to complement the core POS application. The Microsoft .NET platform was used in all three of the product lines including desktop, mobile, and web-based solutions.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Manager of a 3 member development team ; managed 2 senior developers\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop core POS desktop application, PayFirst POS\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop mobile POS solutions, for both the Apple iOS and Android platforms, using MonoTouch and Mono for Android.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop internet ASP.NET MVC application for mobile payment solutions: http:\/\/mobilecharge.payfirstsolutions.com\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Customized and enhanced internal ASP.NET CRM application\n\nSolutions Architect\/"},{"Technologies":": C#, ASP.NET MVC, StructureMap, NUnit, RhinoMock, TeamCity, FIT\/Fitnesse, LINQ, Windows Workflow (WWF) Sharepoint , Integration Services (SSIS), Reporting Services (SSRS), Analysis Services (SSAS), Tableau\n\nSenior Software Developer, Trion Inc., "},{"Technologies":": VB, Java, ABAP\/4, SAP Internet Transaction Server (ITS), SAP Java GUI, SAP Employee Self Service (ESS), SAP BAPI\/RFC, SAP Internet Application Components (IAC), ASP, Haht, IIS, ISAPI\n\nHRIS Systems Analyst , Smithkline Beecham, Philadelphia, PA (September 1991 to "},{"Technologies":": VB, VBA, DAO, MS Access, MSDE, MS SQL Server, Crystal Reports, Microsoft Office\n\n"}],"work":[{"summary":" to December 2006)\n\nWork as an independent consultant utilizing various Microsoft and SAP technologies. This position required 100% travel and involved both windows and web application development. Design and develop .NET interfaces and applications using C#, VB\/VB.Net, and SAP BAPI\/RFC objects.\n\n","position":"Consultant","startDate":"November 2002"},{"summary":" to October 2002)\n\nDesign and develop a web application called Lam’s Internet Pricing and Configuration (IPC) tool. The IPC tool was used as a B2B application allowing Lam’s client to configure a sales quote in real time. Before the tool, Lam’s sales quote process was done manually by its sales force and took days to compile and deliver a sales quote to the client. The IPC tool allowed the sales force to drive the sale quote process in real time and deliver a sales quote within minutes. The tool utilized the SAP CRM module as well as the SAP Variant Configurator module.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Interfaced with SAP 4.6C platform & SAP java-based (IPC) Internet Pricing and Configuration Engine\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop SAP internet\/intranet solutions for various internal departments using VB\/ASP\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Serve as a key resource for SAP external interfaces using BAPI’s and RFC’s\n\n","position":"Senior Software Developer","startDate":"June 2000","company":"Lam Research"},{"summary":" to May 2009)\n\nDesign and develop an enterprise level ASP.NET web application for Trion’s core benefits administration processes. The application is called [Enroll Online] (URL: www.enrollonline.com ) and is Trion’s core application to manage all of its customers’ employee HR benefits. It is an ASP.NET MVC employee self service application that allows users to enroll and manage their HR benefits including healthcare benefit elections during the benefits open enrollment season.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Senior\/Lead Developer of a 9 member development team\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Develop application based on Microsoft’s new ASP.NET MVC platform utilizing the Model-View-Controller OO design pattern\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Use Inversion of Control (IOC) and Dependency Injection (DI) for designing loosely coupled systems that is easily testable\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Use Extreme Programming (XP) techniques with Test Driven Development (TDD) using the NUnit testing framework with RhinoMock\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Use SCRUM agile development processes and work closely with SCRUM master for task management and daily scrum reviews\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Use FIT\/Fitness acceptance testing framework for acceptance testing automation to ensure business logic consistency between revisions\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Use TeamCity continuous Integration server to incorporate dynamic builds of the source code that is linked to the FIT and NUnit tests\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Use UML modeling for design and technical analysis\/specifications; create Use Case scenarios, Activity and Component diagrams\n\n","position":"King","startDate":"August 2008"},{"summary":", LA Weightloss Franchise Inc., Horsham, PA (January 2007 to August 2008)\n\n#1 : Develop and enhance an ASP.NET web application called SlimNet. It is a web application that provides all business areas and franchise owners a unified view of all SlimPOS data across all business modules. The business modules consist of employee management, product management, tax management, and web reporting.\n\n#2 : Develop and enhance globally distributed point of sales POS\/CRM application called SlimPOS. SlimPOS is a windows application responsible for processing the POS sales revenue from the 500 franchise centers and the management of all client data via the CRM module. Data is consolidated from all the centers via a .NET web service and propagated back to corporate headquarters into a single production DB. Data is propagated again to the reporting server using MS SQL Replication.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Perform n-tier application design and development in front-end, back-end, and middleware using various .NET technologies\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Actively involved in code reviews, coding standards, unit testing, integration testing, and documentation\n\n","position":"Senior Software Developer","startDate":"2005"},{"summary":" to June 2011)\n\nArchitect, build, and deploy secure enterprise solutions for core banking business processes. Apply senior level knowledge and experience to understand business challenges and opportunities and drive new and innovative approaches to resolving them. Bridge the gap between business and technology to develop the right solutions for internal and external clients\/customers. Contribute as subject matter expert\/ senior consultant\/solutions architect to the project teams comprised of customers, vendors, and peers from project inception through the handoff to operations. Develop technical documentation of the detailed proposals and solutions. Organize\/lead solution design sessions with customers, partners, and other technical resources of all levels.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Manager of a 4 member development team ; managed 2 senior developers and 1 systems analyst; reports directly to CIO\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop internet ASP.NET MVC application for core banking cemetery loans process: https:\/\/cemeterylotfinancing.fbdel.com\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop secure web services for core banking consumer loans process (URL: www.simplycredit.net )\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop secure web services for core banking consumer loans process (URL: www.fbdloans.com )\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop automated ACH system for core banking daily ACH transactions from vendors\/processors\/merchants\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Design and develop Decision Engine for core banking Installment Loan Application (ILP) system\n\n","position":"VP","startDate":"May 2009","company":"Bank"},{"summary":" to May 2000)\n\nWork as an independent consultant utilizing various SAP Internet technologies. This position performed the same duties as a SAP Basis consultant and required 100% travel. I performed the same duties developing SAP internet applications and generally had the same clients. SAP and the Haht Corporation hired me as independent consultant to improve on their existing SAP internet solutions. I wrote the 4.6c upgrade documentation for the SAP ESS solution and continued to work closely with SAP in creating internet solutions for SAP’s clients.\n\nSAP Basis Consultant , SAP America , Philadelphia, PA (April 1996 to July 1998)\n\nWork as a Basis consultant in the SAP Emerging Technologies group. This group’s primary responsibility was to serve as the key development resource for all clients in any SAP internet\/intranet-related application development. SAP developed two separate internet application solutions. They released the SAP Internet Transaction Server (ITS) and the SAP Employee Self Service (ESS) toolsets. Both were based on very different underlying technologies. The ITS was an ISAPI application written to run on top of IIS. The ESS toolset was a VB\/Com-based application built to run using the ASP\/Haht application server. The both offered similar business modules like sale quotes, purchase orders, and employee management.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Have proficient knowledge of all SAP Internet tools, i.e., SAP VB\/Com Business Objects, SAP Internet Transaction Server (ITS), SAP Java GUI, SAP Employee Self Service (ESS), SAP BAPI\/RFC, and SAP Internet Application Components (IAC)\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Consult with SAP clients on various emerging technologies solutions as related to the R\/3 platform\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Serve as a key resource for SAP Internet tools technical support\n\n","position":"Consultant","startDate":"July 1998"},{"summary":" to Current)\n\nWork as an independent consultant utilizing the Microsoft .NET platform. Architect, build, and deploy web-based applications using C# and ASP.NET MVC. ","position":"Developer","startDate":"July 2013"},{"summary":" for daily support of all HR system processes. The position was responsible for business analysis, application design and development of applications that interfaced with the Tesseract HRIS system.\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Develop and maintain client\/server applications and enhancements using Visual Basic and MS SQL\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Provide recommendations for software\/hardware implementations of enhancements and development of HR systems\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Establish documentation\/guidelines of HR systems and applications\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h Some applications developed were merit processing systems, data entry systems, and travel and expense processing.\n\n","position":"analyst","startDate":"March 1996"}],"basics":{"summary":"\n\nMore than 20 years of experience in Microsoft .NET object oriented software development. A team player and a skilled mentor.\n\n","phone":["(610) 500-3390"],"email":["alexdoan101@gmail.com"],"name":"Alex Doan "},"education":[{"EDUCATION":"\n\nSYMBOL 110 \\f \"Wingdings\" \\s 6 \\h CANDIDATE, BACHELOR OF SCIENCE IN COMPUTER SCIENCE, Chester, PA (Sep 1989 to May 1992)\n\nWidener University, Chester Pennsylvania\n"}]}